[{"id":"495e7c10-a208-415b-a4f4-c27bb515bbeb","type":"Full Time","url":"https://jobs.github.com/positions/495e7c10-a208-415b-a4f4-c27bb515bbeb","created_at":"Mon Oct 28 20:52:07 UTC 2019","company":"Botkeeper","company_url":"https://botkeeper.com","location":"Charlotte, NC","title":"Senior Javascript Engineer","description":"\u003cp\u003e\u003cstrong\u003eSummary\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBotkeeper is looking for an experienced software engineer to join our team and help us build the world’s most advanced bookkeeping platform. You will help drive technical innovation by acquiring expertise in one or more of the domains in which botkeeper operates (accounts payable, accounts receivable, transaction categorization, etc..). A successful candidate will be a skilled collaborator and team player who is passionate about technology.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMust be willing to relocate to Charlotte, NC\u003c/strong\u003e\nOur office is located at 615 S College St, Charlotte, NC 28202\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePay range:\u003c/strong\u003e 100K to 150K based on experience\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop secure and scalable software to automate business processes\nParticipate in the architecture, design, and development of large-scale, distributed software applications, tools, systems and services\u003c/li\u003e\n\u003cli\u003eDevelop core technology and the refinement of existing code\u003c/li\u003e\n\u003cli\u003eParticipate in the full software development life cycle, end-to-end, from scoping, planning, conception, design, implementation and testing, documentation, delivery, and maintenance, using best practice engineering standards\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews and provide feedback to other developers to maintain a quality codebase\u003c/li\u003e\n\u003cli\u003eDevelop RESTful web services to support data-driven web applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of building RESTful APIs to support data-driven web applications in a service-oriented architecture\u003c/li\u003e\n\u003cli\u003eMust have advanced knowledge of JavaScript (Node.JS)\u003c/li\u003e\n\u003cli\u003eExtensive experience in designing, building, and consuming REST APIs\u003c/li\u003e\n\u003cli\u003eExperience with technology challenges trying to scale applications 10x\u003c/li\u003e\n\u003cli\u003eStrong knowledge of NoSQL databases (MongoDB)\u003c/li\u003e\n\u003cli\u003eFamiliarity with Domain-Driven Design - Microservices and Bounded Contexts\u003c/li\u003e\n\u003cli\u003eGood communication and collaboration skills\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to \u003ca href=\"mailto:justin+hiring@botkeeper.com\"\u003ejustin+hiring@botkeeper.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmwxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--77755993a424dc6d5205515904c411298b58cacd/botkeeper-featured-image.jpg"},{"id":"81db1819-f3aa-4f53-8736-4e7d13d8ea91","type":"Full Time","url":"https://jobs.github.com/positions/81db1819-f3aa-4f53-8736-4e7d13d8ea91","created_at":"Mon Oct 28 18:58:27 UTC 2019","company":"The Public Theater","company_url":null,"location":"New York","title":"Web Developer","description":"\u003cp\u003eThe Public Theater seeks a Web Developer to join its Digital Engagement team!\u003c/p\u003e\n\u003cp\u003eA subset of the Marketing and Communications department, the Digital Engagement team oversees the administration, development, and curation of The Public’s digital platforms, including our website (publictheater.org), our intranet, and our social media channels.\u003c/p\u003e\n\u003cp\u003eThe Public is a cultural institution dedicated to upholding principles of diversity, equity, and inclusion. The ideal candidate must be willing to investigate how those principles apply in the context of marketing and communications.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesigns, implements and supports new web features for the public facing website and internal tools.\u003c/li\u003e\n\u003cli\u003eDevelops and maintains front-end user interface designs using HTML, CSS, and JavaScript and back-end functionality in C#/ASP.NET.\u003c/li\u003e\n\u003cli\u003eIntegrates website with the Public Theater’s CRM, Tessitura, in collaboration with other Tessitura stakeholders.\u003c/li\u003e\n\u003cli\u003eAligns development timelines with priorities of the larger organization.\u003c/li\u003e\n\u003cli\u003eInteracts with stakeholders across the organization, effectively communicating technical details to a non-technical audience.\u003c/li\u003e\n\u003cli\u003eWorks with the IT team to maintain the website’s IT infrastructure.\u003c/li\u003e\n\u003cli\u003eIdentifies opportunities to improve the web patron experience and recommends solutions.\u003c/li\u003e\n\u003cli\u003eOptimizes the Episerver CMS user experience through trainings, customizations, and documentation.\nREQUIREMENTS\nCandidates must have a working knowledge of HTML, CSS and JavaScript, familiarity with JavaScript libraries (ex. jQuery, Vue, React), and working knowledge of a backend programming language (ex. C#, Java, Ruby, Python).  They should also have experience interfacing with a third party API,  an eye for web design, and strong debugging skills.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for a self-starter with strong communication and project management skills. Must be able to approach their work with patience, diplomacy, and detail amidst a high-volume, fast-paced environment. Familiarity in the following platforms is ideal, but not required: Tessitura, Episerver, SQL, AWS, and/or Google Analytics.\u003c/p\u003e\n\u003cp\u003eThe Public is committed to creating a diverse and inclusive environment and is proud to be an equal opportunity employer. Applicants from populations underrepresented in the theater field are strongly encouraged to apply. All qualified applications will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, familial status, sexual orientation, national origin, ability, age, or veteran status.\u003c/p\u003e\n\u003cp\u003ePlease send cover letter, resume, and salary expectations to: \u003ca href=\"mailto:jobs@publictheater.org\"\u003ejobs@publictheater.org\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send cover letter, resume, and salary expectations to: \u003ca href=\"mailto:jobs@publictheater.org\"\u003ejobs@publictheater.org\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"6877ff67-c5c9-43f0-a97f-ebbddf1224e6","type":"Full Time","url":"https://jobs.github.com/positions/6877ff67-c5c9-43f0-a97f-ebbddf1224e6","created_at":"Mon Oct 28 15:53:26 UTC 2019","company":"Essent","company_url":"https://www.werkenbijessent.nl/","location":"Den Bosch","title":"Web Developer","description":"\u003ch2\u003eWeb Developer Energiedirect.nl\u003c/h2\u003e\n\u003cp\u003eessent - NL, Den Bosch\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDeze baan biedt de ideale combinatie van web development, werken met de laatste tooling voor een topmerk in de energiebranche. Wil jij een onderdeel zijn van ons power team bij energiedirect.nl, in een omgeving waar je de vrijheid krijgt om een top prestatie te leveren voor onze klanten? Claim dan deze job!\u003c/em\u003e_\u003c/p\u003e\n\u003cp\u003eAls web developer bij energiedirect.nl werk je aan het continu verbeteren en optimaliseren van de stroom en gas ‘sales funnel’ en de loyality proposities op de eigen website. Ook houdt je je bezig met het op orde houden en verbeteren van de development tool en omgevingen. De focus ligt hierbij op het verhogen van het conversiepercentages in de funnel, het verbeteren van de performance en laadtijd van onze website en het verhogen van de time to market van onze development oplossingen en implementaties.\u003c/p\u003e\n\u003ch2\u003eJij maakt het mogelijk\u003c/h2\u003e\n\u003cp\u003eJij gebruikt de nieuwste technieken om het beste product aan de interne organisatie te leveren. Je denkt commercieel en bent in staat om te schakelen met collega’s met diverse vakspecialisten binnen een grote organisatie. Je weet een goede balans te vinden tussen professioneel en fun en je krijgt een kick van werken voor een mooi merk. Je staat open voor feedback en deelt graag je (development) ideeën binnen de teams.\u003c/p\u003e\n\u003cp\u003eInspirerend, samenwerkingsgericht en met de nodige eigenaarschap pak jij als Web Developer je rol als het gaat om het:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMee ontwikkelen van een future proof online platform\u003c/li\u003e\n\u003cli\u003eInvullen en aanscherpen van user stories samen met het development team\u003c/li\u003e\n\u003cli\u003eOpleveren van nieuwe front-end componenten (iteraties van 3 weken)\u003c/li\u003e\n\u003cli\u003eFungeren als een belangrijke schakel in het ontwikkelen en verbeteren van de bestaande salesfunnels samen met een UX-designer en een e Performance Specialist\u003c/li\u003e\n\u003cli\u003eS.O.L.I.D. ontwikkelen en het leveren van code van hoge kwaliteit\u003c/li\u003e\n\u003cli\u003eJe stelt verbeteringen voor en creëert commitment voor jouw werk.\u003c/li\u003e\n\u003cli\u003eJe werkt nauw samen met een UX-designer, (online) marketeers en digital specialisten en professionals binnen andere afdelingen waaronder IT\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eHier gebeurt het\u003c/h2\u003e\n\u003cp\u003eBij Essent! Een energiebedrijf dat elke dag werkt aan betaalbare energieoplossingen voor haar klanten en moederbedrijf is van de bekende merken Essent, energiedirect.nl en Powerhouse. In deze rol ga je specifiek werken voor het merk energiedirect.nl. energiedirect.nl is onze ‘value for money’ speler in de markt. Het is de beschermer van het Essent merk op prijs. 15 jaar geleden ontstaan vanuit het geloof dat energiezaken veel eenvoudiger kunnen; op prijs, op service en duidelijkheid. Met nuchterheid zijn we de markt gaan uitdagen. Zonder omwegen. Altijd voordelig, dat is de merkessentie. En dat levert voordeel op en gaat zelfs verder dan stroom en gas. Als voorvechters van vrijheid en gelijkheid trekken we ons niets aan van de gebaande paden. Waarom zou je op het fietspad blijven als het olifantenpaadje rechtdoor makkelijker en directer is? Deze overtuiging is doordrenkt in onze communicatie en stuurt al ons handelen.\u003c/p\u003e\n\u003cp\u003eJe versterkt het team C+ Activation (C+ staat voor Commodity+: levering stroom en gas). Samen zijn jullie verantwoordelijk voor een maximale klantwaarde over alle merken en kanalen. Jullie pakken de end-to-end regie op sales voor Essent, energiedirect.nl en Essent Zakelijk. Wij hebben de ambitie om meer dan 30% marktaandeel te realiseren en delen de ‘winner takes it all’ mindset. Jij rapporteert aan Manager Online Channel.\u003c/p\u003e\n\u003ch2\u003eJij hebt het\u003c/h2\u003e\n\u003cp\u003eEr zit iets in jou, wat anderen aansteekt. Je neemt eigenaarschap, zoekt de samenwerking met collega’s en je laat je door ze inspireren. Als jij eenmaal iets in je hoofd hebt, ga jij door alle barrières heen. Tevens ben je leergierig, wil je je ontwikkelen en ben je een teamplayer. Wat je verder nog in huis hebt:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe hebt minimaal 5 jaar relevante werkervaring\u003c/li\u003e\n\u003cli\u003eGoede beheersing van de Nederlandse en Engelse taal\u003c/li\u003e\n\u003cli\u003eJe bent bekend met agile werken en hebt ervaring met het werken binnen een agile team\u003c/li\u003e\n\u003cli\u003eJe weet wat er speelt binnen ons vakgebied en weet het team te inspireren met de nieuwste feiten en technologieën\u003c/li\u003e\n\u003cli\u003eJe bent goed bekend met ASP.net MVC 4, HTML5, CSS3, AngularJS, Javascript ES5 + ES6, SASS, Gulp, Web pack én Git Flow\u003c/li\u003e\n\u003cli\u003eJe hebt basiskennis van UX en SEO-technieken en hebt ervaring in het werken met Sitecore 8\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eVoor jou, van Essent\u003c/h2\u003e\n\u003cp\u003eJe komt in een organisatie die je alle ruimte geeft om te experimenteren en waarin je nek uitsteken wordt beloond. In geld, kansen en persoonlijke groei. Wat je precies kunt verwachten (o.b.v. 40 uur per week):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen baan bij een succesvol en leidend energiebedrijf dat altijd in beweging is. Stilstaan is geen optie! Durf jij op deze rijdende sneltrein te springen?\u003c/li\u003e\n\u003cli\u003eEen bruto maandsalaris tussen € 3.113 en € 4.841, precies afgestemd op jouw niveau\u003c/li\u003e\n\u003cli\u003eMeer dan gemiddeld aantal vakantiedagen\u003c/li\u003e\n\u003cli\u003eEen andere manier van werken! Dankzij @nders werken kun je namelijk tijd- en plaats onafhankelijk werken, zo heb je zowel thuis als op kantoor alle faciliteiten om je werk goed te kunnen doen\u003c/li\u003e\n\u003cli\u003eNaast @nders werken doen we nog meer ‘anders’. Bij Essent streven we naar een hoge mate van effectiviteit en is de House-in-Order LEAN-methodiek in de hele organisatie geïntegreerd\u003c/li\u003e\n\u003cli\u003eEen inspirerende kantooromgeving op een toplocatie in Den Bosch! Met CS Den Bosch op slechts 850 meter, is reizen met het openbaar vervoer een aanrader. Al helemaal met de NS Business Card die je van ons ontvangt. Liever met eigen auto? Dan krijg je natuurlijk een kilometervergoeding\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEn last but not least: een breed scala aan ontwikkel- en doorgroeimogelijkheden. Want Essent staat niet stil, maar jij ook niet!\u003c/p\u003e\n\u003cp\u003eBen jij onze nieuwe Web Developer energiedirect.nl? Stel je aan ons voor en reageer via deze link: \u003ca href=\"https://essent.redirect.your-jobresponse.com/web_developer_den_bosch/257487/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://essent.redirect.your-jobresponse.com/web_developer_den_bosch/257487/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHQxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3b0e0471cef772525820ec918c4beffe122ce218/companyLogo-Logo%20Essent.jpg"},{"id":"d1c77cd3-6a84-4684-b0b2-8fd2a399b51d","type":"Full Time","url":"https://jobs.github.com/positions/d1c77cd3-6a84-4684-b0b2-8fd2a399b51d","created_at":"Mon Oct 28 15:33:30 UTC 2019","company":"AltaMed","company_url":"http://www.Click2apply.net/fdzw6f85vpzvybpy","location":"Monterey Park,California,United States","title":"Senior Software Engineer","description":"\u003cp\u003eThe Senior Web Software Engineer will be responsible for the analysis, design, development, testing, documenting and support of information systems.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDesigns and delivers web applications with emphasis on security and performance\u003c/li\u003e\n\u003cli\u003eAble to develop complex modules with little to no supervision.\u003c/li\u003e\n\u003cli\u003eConducts system analysis and development, with limited support, to keep systems current with changing technologies\u003c/li\u003e\n\u003cli\u003eDiagnoses current applications and designs solutions to problematic programming\u003c/li\u003e\n\u003cli\u003eDevelops, tests, and reviews code to ensure accurate and efficient solutions; provides assistance to junior developers\u003c/li\u003e\n\u003cli\u003eAnalyzes system specifications and translates system requirements to task specifications for junior developers\u003c/li\u003e\n\u003cli\u003eResponds promptly and professionally to defect reports\u003c/li\u003e\n\u003cli\u003eReviews and repairs legacy code\u003c/li\u003e\n\u003cli\u003eResearches and utilizes tools that assist with development, security, and performance\u003c/li\u003e\n\u003cli\u003eBe the subject matter expert for software solutions as they relate to healthcare\u003c/li\u003e\n\u003cli\u003eMaintains positive relations with all peers, stakeholders, and clients\u003c/li\u003e\n\u003cli\u003eBA/BS in related field (computer science, information systems, etc.) or equivalent experience\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of OOP principles and design patterns\u003c/li\u003e\n\u003cli\u003e7+ years of formal .NET web application development in C#, Visual Studio, and TFS\u003c/li\u003e\n\u003cli\u003e2+ years of ASP.NET MVC development\u003c/li\u003e\n\u003cli\u003e5+ years of full stack development on all layers of a web application\u003c/li\u003e\n\u003cli\u003eStrong experience with HTML5, CSS3, Bootstrap, Less/Sass, AngularJS, TypeScript\u003c/li\u003e\n\u003cli\u003eExperience with JavaScript libraries (jQuery, Modernizr, etc.)\u003c/li\u003e\n\u003cli\u003eExperience resolving production and infrastructure issues\u003c/li\u003e\n\u003cli\u003eExperience researching and presenting technologies and solutions\u003c/li\u003e\n\u003cli\u003eExperience and ability to lead, teach, and instruct teams\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/fdzw6f85vpzvybpy\"\u003ehttp://www.Click2apply.net/fdzw6f85vpzvybpy\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI114835106\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Online\u003c/p\u003e\n","company_logo":null},{"id":"c4f4f00e-d4f0-457f-87fd-40e503da119d","type":"Full Time","url":"https://jobs.github.com/positions/c4f4f00e-d4f0-457f-87fd-40e503da119d","created_at":"Mon Oct 28 14:10:43 UTC 2019","company":"Matrix42","company_url":"http://www.matrix42.com","location":"Kiyv","title":"Senior developer(.NET+JS)","description":"\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of experience as a developer\u003c/li\u003e\n\u003cli\u003eDeep knowledge of .NET, C#, JavaScript\u003c/li\u003e\n\u003cli\u003eAnalytical and problem-solving skills\u003c/li\u003e\n\u003cli\u003eThe candidate needs to be a team player with a positive attitude\u003c/li\u003e\n\u003cli\u003eLevel of English Intermediate+\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAs plus\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eASP.NET\u003c/li\u003e\n\u003cli\u003eWeb API\u003c/li\u003e\n\u003cli\u003eAngularJS\u003c/li\u003e\n\u003cli\u003eHTML5, CSS3\u003c/li\u003e\n\u003cli\u003eSQL\u003c/li\u003e\n\u003cli\u003eWPF/WCF/WWF\u003c/li\u003e\n\u003cli\u003eExperience in building responsive applications\u003c/li\u003e\n\u003cli\u003eHigher technical education\u003c/li\u003e\n\u003cli\u003eExperience with Agile frameworks\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWe offer:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eParticipate in the development of an enterprise software product, Matrix42 Workspace Management, utilizing cutting-edge technologies and methodology, like SPA, AngularJS\u003c/li\u003e\n\u003cli\u003ePossibility to influence technical decisions, requirements, development process.\u003c/li\u003e\n\u003cli\u003eHighly Competitive compensation (depends on the candidate level)\u003c/li\u003e\n\u003cli\u003eWork in a strong team to deliver business-oriented solutions that meet requirements and expectations.\u003c/li\u003e\n\u003cli\u003eLong-term employment\u003c/li\u003e\n\u003cli\u003eAttractive benefits package\u003c/li\u003e\n\u003cli\u003epaid sick leave\u003c/li\u003e\n\u003cli\u003evacations (25 working days)\u003c/li\u003e\n\u003cli\u003eFree English courses\u003c/li\u003e\n\u003cli\u003eMedical Insurance\u003c/li\u003e\n\u003cli\u003eOffice in downtown Kiev\u003c/li\u003e\n\u003cli\u003eProfessional training which meets company needs\u003c/li\u003e\n\u003cli\u003eFree coffee, tea, juice, snacks\u003c/li\u003e\n\u003cli\u003eRegular company events locally and abroad\u003c/li\u003e\n\u003cli\u003eCasual, positive and open work environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAbout:\u003c/h2\u003e\n\u003ch2\u003eManagement\u003c/h2\u003e\n\u003cp\u003eMatrix42 Workspace Management is a Business Process Platform that helps IT Department of any company to become a full blown Service Provider. The latest and greatest IT and Non-IT Business Processes are supported and certified, like Incident-, Problem-, Change-, Configuration-, Service Level Management, SAM or any other Service Management Process you wish for. We provide the means for our customers to shape the Solution according to their business needs without worrying about update issues and with any need of development skills - it just works! With drag\u0026amp;drop Workflows, an intuitive Layout Designer and a tool to ensure that the data is flowing seamlessly from any data source. No matter if your data is on-premise, in the cloud, a Microsoft SQL Server Database or a fancy REST API, you can connect and interact with it with a technology called SolutionBuilder.\u003c/p\u003e\n\u003ch2\u003ePLATFORM - The Solution Builder\u003c/h2\u003e\n\u003cp\u003eMatrix42 SolutionBuilder is the core of all our business processes. It's a modern drag\u0026amp;drop application builder based on Microsoft ASP.NET WebAPI with a Microsoft SQL Server on the backend and AngularJS with Angular Material on the frontend. Our invention let you create any UX you seek for as well as any datapersistance you want, just by configuration through with a nice UserExperience. We develop SolutionBuilder so our customers don't have to acquire any development skills, but let their creativity flow and create awesome apps to ensure that their business is reacting as fast to business changes, as we react on technilogy changes - always be on the latest and greatest.\nThe Matrix42 Workflow Studio, based on Microsoft's latest Workflow Foundation with a Visual Studio rehosted designer, enables our customers to model their Business Logic with straight forward Workflows and our many Workflow Activities.\u003c/p\u003e\n\u003ch2\u003ePROCESS - Lean \u0026amp; Agile\u003c/h2\u003e\n\u003cp\u003eWe living and breathing SCRUM, Lean and Agile. Self motivation and autonomous working in our one week sprints is key to success for us.\n\"Innovate like a startup, deliver like an enterprise\" is our CTO's key quote.\nOur modern office provides you startup flavor with the security of a strong software vendor that has a strong manifest for over 20 years in the industry.\u003c/p\u003e\n\u003ch2\u003eWork hard - Play hard!\u003c/h2\u003e\n\u003cp\u003eWe're working on Visual Studio Team Services on git repositories. Our weekly iterations and our continuous integration approach ensures cloud-like deployment to our customers, even though it is an enterprise solution that is by 90% installed on-premise.\u003c/p\u003e\n\u003cp\u003eApply now via the \u003cstrong\u003eapplication form\u003c/strong\u003e for Matrix42 and help us to create the game changing enterprise software solutions that will roll up the market!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2WlWP8s\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2WlWP8s\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczUxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fc668c803f031ccb2b4ecf9f659b6f2b7dc240bf/matrix%2042%C2%A0ag.jpg"},{"id":"f7cf7ea3-988f-4675-8121-8508e5e51c15","type":"Full Time","url":"https://jobs.github.com/positions/f7cf7ea3-988f-4675-8121-8508e5e51c15","created_at":"Sun Oct 27 22:13:44 UTC 2019","company":"AdviceCoach","company_url":null,"location":"Remote","title":"Entrepreneurial Developer","description":"\u003cp\u003eSeeking Entrepreneurial Developer\nWe need an ambitious and hands-on developer to lead our software team, building mobile and Web apps.  You will be responsible for turning our current MVP app into a leading product with much wider distribution. Next steps include improving the UX, adding security layers, and adding automated testing and continuous integration. You will join our distributed team, and get a full salary plus early stage startup options.\u003c/p\u003e\n\u003cp\u003eKEY SKILLS\nJava\nReactNative\nMYSQL\nJavascript\nAWS\nGit\nQUALIFICATIONS\nTalented programmer with a proven ability to write Web and mobile apps\nCan work remotely and independently\nLikes working with early stage startups\nCan grow to handle architecture and team building\nFluent in written and verbal English\nDesire to integrate behavioral change science into digital health\u003c/p\u003e\n\u003cp\u003eSalary and equity with a cliff/vesting schedule.\u003c/p\u003e\n\u003cp\u003eAdviceCoach/AC Health is an app provider that gives healthcare providers -- initially physical therapists -- a much more effective way to communicate personalized medical instructions to their patients. We received a Net Promoter Score of 91 from hundreds of our beta users.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend an email to \u003ca href=\"mailto:susannah.bailin@advicecoach.com\"\u003esusannah.bailin@advicecoach.com\u003c/a\u003e summarizing your skills and areas of expertise, describe projects you’ve worked on and provide contact details\nAfter an initial conversation, we will ask for a one-week trial contract.  During the trial we will work together on some of our outstanding tasks. After that we will seek a long term, full-time commitment\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1YxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99491abc43f22cac734fc703e99aa8bb0895412b/1FC54DDE-8EF4-4A8B-8C72-7613C3EA7AE4.jpeg"},{"id":"8af0509e-3d27-4e57-8938-dc633722b046","type":"Full Time","url":"https://jobs.github.com/positions/8af0509e-3d27-4e57-8938-dc633722b046","created_at":"Fri Oct 25 11:35:33 UTC 2019","company":"Innogames","company_url":"https://www.innogames.com","location":"Hamburg","title":"SENIOR JAVA ENGINEER","description":"\u003cp\u003eAs \u003cstrong\u003eSenior Java Engineer\u003c/strong\u003e, you will play a key role in the technical infrastructure team of our Corporate Systems department. You will be part of a passionate and experienced agile engineering team responsible for some of the most critical systems behind InnoGames’ sustainable success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will be part of a diverse engineering team developing our Marketing platforms as well as our player account management system\nYou will work in an agile environment with several cross-functional Kanban teams consisting of Backend, Frontend and Quality Assistance Engineers\nYou will work closely together with our game teams to shape and design our centralised and highly available user management system\nAs part of our Corporate Systems department, you will help to maintain and further develop our high-performance culture in a cheerful and cooperative work environment – where achievements are recognised, regular knowledge sharing is encouraged, and fun is our foundation\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou have completed a Computer Sciences, Business Information Systems degree or have relevant experience\nYou take on a high level of responsibility and are able to make good decisions based on an excellent understanding of business requirements\nYou know the advantages and disadvantages of various architectures and have experience implementing them\nYou have proven experience with relational databases, preferably with high availability MySQL environments\nYou have excellent communication skills and are willing to embrace our company culture and values\nYour presentation skills are superb, and you like to give talks at one of our various internal knowledge sharing events\nYou have excellent English language skills\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we offer to all employees:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou’ll work in a multicultural agile team – enabling you and your team to form and actively optimise work processes\nWe actively support personal development, pay for any necessary textbooks as well as sending you to developer conferences\nYou can set up your workspace as you wish: Mac, Linux or Windows, two or more monitors, a free choice of IDE as well as other software\nWe provide you with a mobile device (e.g. iPhone or iPad) for private use\nYou can take creative breaks: play table tennis with your team, play on our arcade machines, work out in our gym or simply go to our roof terrace to get some fresh air\nWe contribute to your public transport ticket and subsidise contributions to the company pension plan\nWe offer free drinks and fresh fruit to contribute to your health and wellbeing\nWe have regular team events (e.g. curling, cooking, paintball), barbecue together on our roof terrace and a company-organised after work get together every Thursday\nWe offer trust-based working times in a modern office in the centre of Hamburg\nOur company language is English, and we support all our employees and their partners with optional German lessons\nWe help you relocate to Hamburg\nWe have fun at work!\u003c/p\u003e\n\u003cp\u003eExcited to start your journey with InnoGames and join our dynamic team as a Senior Java Engineer? We look forward to receiving your application as well as your salary expectations and earliest possible start date through our online application form. \u003cstrong\u003eMaximilian Kaeding\u003c/strong\u003e would be happy to answer any questions you may have.\u003c/p\u003e\n\u003cp\u003eInnoGames is Germany’s leading developer and publisher of mobile and online games. The company based in Hamburg is best known for Forge of Empires, Elvenar and Tribal Wars. InnoGames’ first mobile title Warlords of Aternum is a fantasy turn-based strategy game. InnoGames’ complete portfolio encompasses seven live games and several mobile titles in production.\u003c/p\u003e\n\u003cp\u003eBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.innogames.com/de/innogames-karriere/detail/job/senior-java-engineer/?s=github\"\u003ehttps://www.innogames.com/de/innogames-karriere/detail/job/senior-java-engineer/?s=github\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"027d0e51-552d-40aa-893a-0626c48f9c26","type":"Full Time","url":"https://jobs.github.com/positions/027d0e51-552d-40aa-893a-0626c48f9c26","created_at":"Thu Oct 24 12:17:57 UTC 2019","company":"GoodHabitz BV","company_url":"https://www.goodhabitz.com/","location":"Eindhoven","title":"Javascript frontend developer","description":"\u003ch2\u003eDe functie.\u003c/h2\u003e\n\u003cp\u003eAls allround Javascript programmeur ben je samen met Ivo, Bardt en Bas, Evert, Armand en Fatih bezig met het constant draaiend houden en upgraden van ons leerplatform. Jij leest en interpreteert het design prototype en zorgt dat dit design vertaald wordt naar een technisch prototype. Hierna produceer je JS componenten op basis van het technisch prototype en zorg je voor aansluiting op de API’s. Tenslotte documenteer je de nieuwe componenten.\u003c/p\u003e\n\u003ch2\u003eJij.\u003c/h2\u003e\n\u003cp\u003eJij werkt in een agile werkomgeving waarin je in 2-weekse cycli in overleg toegewezen deliverables oplevert. Er wordt een zekere mate van zelfredzaamheid verwacht waarin jij optimaal kan werken aan jouw taken en verantwoordelijkheden.\u003c/p\u003e\n\u003cp\u003eGedurende deze cyclus houden we elkaar op de hoogte van onze vorderingen en eventuele problemen. In een review sessie worden alle deliverables besproken en wordt de nieuwe planning bepaald.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat je sowieso kunt.\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGoede beheersing van de Nederlandse en Engelse taal;\u003c/li\u003e\n\u003cli\u003eJe hebt Vanilla JS volledig onder de knie (minimaal drie jaar werkervaring);\u003c/li\u003e\n\u003cli\u003eKennis van Object Oriented Programming;\u003c/li\u003e\n\u003cli\u003eCommunicatief vaardig.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDit zijn pluspunten.\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGedegen kennis van CSS3;\n• Sass ervaring is een dikke pre;\u003c/li\u003e\n\u003cli\u003eErvaring in het vertalen van functioneel ontwerp in technische specificaties;\u003c/li\u003e\n\u003cli\u003eKennis en ervaring met Visual Studio.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWij.\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eWat we bieden.\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen fulltime functie (40 uur) met goede arbeidsvoorwaarden bij een dynamisch internationaal bedrijf;\u003c/li\u003e\n\u003cli\u003ePrima salaris en overige arbeidsvoorwaarden (inclusief winstdeling en pensioenregeling);\u003c/li\u003e\n\u003cli\u003eLaptop van de zaak;\u003c/li\u003e\n\u003cli\u003eOnbeperkt toegang tot onze interne trainingsbibliotheek;\u003c/li\u003e\n\u003cli\u003eEen schitterend kantoor in hartje Eindhoven, inclusief gameroom;\u003c/li\u003e\n\u003cli\u003eBruisende teams met gedreven medewerkers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWie we zijn.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMet een groot aantal grote klanten en een bereik van meer dan een miljoen cursisten is GoodHabitz uitgegroeid tot toonaangevende aanbieder van online trainingen in Nederland. Inmiddels krijgen we met onze visie op online leren ook in de rest van Europa voet aan de grond: we zijn actief in zes landen met hoofdkantoren in Eindhoven, Londen, Parijs, Madrid, Frankfurt en Antwerpen.\u003c/p\u003e\n\u003cp\u003eOns doel is om onze cursisten productiever, positiever en gelukkiger te maken met behulp van onze trainingen, zowel op de werkvloer als in hun privéleven. Daarom hebben alle werknemers van onze klanten toegang tot ons volledige, steeds uitbreidende trainingsaanbod. Onderwerpen variëren van management en persoonlijke effectiviteit tot MS Office en communicatie.\u003c/p\u003e\n\u003ch2\u003eReageren.\u003c/h2\u003e\n\u003cp\u003eHeb je interesse? We maken graag kennis met je! Reageer via de \"\u003cstrong\u003eSolliciteer\u003c/strong\u003e\" button en vul het sollicitatieformulier in. Wij zullen zo snel mogelijk iets van onszelf laten horen.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://goodhabitz.redirect.your-jobresponse.com/javascript_frontend_developer_eindhoven/257301/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEIxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5744d30aa8195367282c5eaf855c5a53a42a959f/goodhabitzlogo.jpg"},{"id":"ac8d1c1f-46f3-414a-a392-9043f493fca3","type":"Full Time","url":"https://jobs.github.com/positions/ac8d1c1f-46f3-414a-a392-9043f493fca3","created_at":"Thu Jul 25 09:58:05 UTC 2019","company":"SoundCloud","company_url":"https://jobs.soundcloud.com/","location":"Berlin","title":"Search Relevance Engineer","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced Relevance Engineer to join our team in Berlin. As a relevance engineer on search, you will contribute to build and maintain systems that empower our users to actively and easily discover SoundCloud’s huge and unique catalog. You will contribute to increase the search experience with respect to ranking, user assistance and user interface in order to enable listeners to find the most relevant and engaging content. We want people that come equipped with an open mind, creativity and a get-it-done attitude.\u003c/p\u003e\n\u003cp\u003eAs engineers at SoundCloud, our work often involves large-scale distributed systems, parallel computing, and data science. We actively improve our tools and processes to support collaboration and productivity. We cultivate an environment where we can all learn and grow. For more, read about engineering at SoundCloud.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIndustry experience working on search relevance and large scale data processing.\u003c/li\u003e\n\u003cli\u003eIn-depth understanding of search relevance ranking.\u003c/li\u003e\n\u003cli\u003eExperienced in languages such as Scala, Java, Go or Python.\u003c/li\u003e\n\u003cli\u003eExperienced with technologies, such as Elasticsearch, Kafka and data processing pipelines.\u003c/li\u003e\n\u003cli\u003ePassionate about working with large amount of data to develop and evaluate data-driven products, striking a healthy balance between principled and pragmatic approaches to solve consumer use cases.\u003c/li\u003e\n\u003cli\u003eGood communication skills with both technical and non-technical people (e.g. designers and product managers)\u003c/li\u003e\n\u003cli\u003eValues teamwork, shares gained knowledge with teammates and brainstorm new ideas\n If this describes you, we'd love to chat. \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDiversity at SoundCloud:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe have a flexible, friendly and inclusive office environment in Mitte \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou can contribute to our Engineering Blog post. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe offer free German courses in office at beginning, intermediate and advanced. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLunch twice a week, plus countless snacks and goodies! \u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply via this link: \u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4364072002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4364072002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eor email your CV to \u003ca href=\"mailto:anya.voronova@soundcloud.com\"\u003eanya.voronova@soundcloud.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb050IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d6c90b7c200e89f017f728c67de94733594148d5/logo.png"},{"id":"c3160e50-d094-434b-b884-2c27c91df656","type":"Full Time","url":"https://jobs.github.com/positions/c3160e50-d094-434b-b884-2c27c91df656","created_at":"Wed Oct 23 20:21:54 UTC 2019","company":"YouVersion","company_url":"http://youversion.com/careers","location":"Oklahoma City, OK","title":"YouVersion Software Engineer","description":"\u003cp\u003eThe YouVersion Software Engineer will help develop and build software and services that lead to increased engagement and growth through the Bible App across the globe.\u003c/p\u003e\n\u003cp\u003eYou’ve got skills. You’re motivated. You’ve got a passion to see people come to know Christ. All you’ve been missing is a place to put all of it together. The YouVersion Team could be that place. God brings people from a wide variety of backgrounds and experiences here, but He does it because we all have one thing in common: we won’t stop until every person on this Earth knows the love of Jesus. Ministry might not have been the first stop on your road map, but if you’ve been praying to put your skills to work alongside a team of Kingdom-minded, sold-out, on-fire believers, we’ve got good news. You’re on the right path.\u003c/p\u003e\n\u003cp\u003eThe YouVersion team is looking for a unique individual to serve as a Software Engineer. With more than 238 million installs of the Bible App and 13 million installs of the Bible App for Kids, the YouVersion team continues to grow and evolve in an effort to appropriately steward the opportunities brought our way.\u003c/p\u003e\n\u003cp\u003eIf you are excited about using technology to help people become fully devoted followers of Christ, keep reading for details.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Basics\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGreat at solving large, complicated, and brain-melting technology problems\u003c/li\u003e\n\u003cli\u003eSkilled in managing time, details, and deadlines\u003c/li\u003e\n\u003cli\u003eWilling to do whatever it takes to help your team succeed\u003c/li\u003e\n\u003cli\u003eConsistently seek to learn and grow personally and professionally\u003c/li\u003e\n\u003cli\u003eWork in warp speed and enjoy variety Skilled in Python, Java, C++ or other general-purpose programming languages\u003c/li\u003e\n\u003cli\u003eProficient in Object-Relational Database Management Systems, such as Postgres\u003c/li\u003e\n\u003cli\u003eHave at least five years of experience working on an agile software team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThe Works\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as key engineer on our team – planning, building, and delivering highly scalable software and services to meet the demand of our users\u003c/li\u003e\n\u003cli\u003eEngage as an active contributor within our agile development process\u003c/li\u003e\n\u003cli\u003eCollaborate with design, platform, and product teams to ensure the continuous delivery of high quality and reliable software\u003c/li\u003e\n\u003cli\u003eTake ownership of projects and oversee them with minimal direction\u003c/li\u003e\n\u003cli\u003eManage schedules and duties to efficiently meet the needs of the organization in the pursuit of helping others become fully devoted followers of Christ\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThe Cherry on Top\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou can translate English into Binary\u003c/li\u003e\n\u003cli\u003eBrewing your morning coffee requires at least seven different apparatuses, none of which are a coffeemaker\u003c/li\u003e\n\u003cli\u003eYour root@localhost password is the chemical formula for caffeine\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis position is located at the Life.Church Central Offices in Edmond, OK\u003c/p\u003e\n\u003cp\u003eApply today at \u003ca href=\"http://bit.ly/YouVersionSoftwareEngineer\"\u003ehttp://bit.ly/YouVersionSoftwareEngineer\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eReady to apply? Visit \u003ca href=\"http://bit.ly/YouVersionSoftwareEngineer\"\u003ehttp://bit.ly/YouVersionSoftwareEngineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2wxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8e303a660539f7e6bb5703d6cd81146f649317cd/YouVersion-Logo-dark.png"},{"id":"e498085b-f981-4bb5-a1eb-3301d0f81ff1","type":"Full Time","url":"https://jobs.github.com/positions/e498085b-f981-4bb5-a1eb-3301d0f81ff1","created_at":"Wed Oct 23 18:06:30 UTC 2019","company":"YouVersion","company_url":"http://youversion.com/careers","location":"Oklahoma City, OK","title":"YouVersion Mobile Engineer - Android","description":"\u003cp\u003eThe YouVersion Mobile Engineer will help people around the world engage with God’s Word by developing, refining, and growing the YouVersion Bible App mobile experience on Android devices.\u003c/p\u003e\n\u003cp\u003eGod has placed you on the earth for a reason, at this crucial moment in time. He’s given you a purpose. With the smartest tech at our fingertips and more distractions vying for our attention than ever before, the need for the Bible has never been greater. If you’re looking for a place you can combine the skills God has given you with your passion to see people engage with His Word in new ways—no matter where they are or what languages they speak—the YouVersion Team is the place to start. Come change the world with us!\u003c/p\u003e\n\u003cp\u003eWe’re looking for a unique individual with a passion for Android application development to serve as a Mobile App Engineer. With more than a quarter of a billion installs of the Bible App and 16 million installs of the Bible App for Kids, the YouVersion team continues to grow and evolve in an effort to appropriately steward the opportunities brought our way. Are you excited about building awesome mobile apps for a variety of tablets and smartphone` devices and interested in exploring the unique challenges of large-scale mobile apps? Then keep reading!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou'll be:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContributing to all aspects of development on our mobile engineering team helping to drive enhancements to our Android application\u003c/li\u003e\n\u003cli\u003eEngaging as an active member within our agile development process\u003c/li\u003e\n\u003cli\u003eCollaborating with our various platform teams to ensure features and software design patterns are consistent\u003c/li\u003e\n\u003cli\u003eTesting, debugging, and maintaining software throughout the product lifecycle\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou'll fit right in if you are:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassionate about the mission of YouVersion: Helping people engage with the Bible\u003c/li\u003e\n\u003cli\u003eGreat at solving large, complicated, and difficult technology problems\u003c/li\u003e\n\u003cli\u003eLooking to dedicate your life to something that makes a difference on a global scale\u003c/li\u003e\n\u003cli\u003eA team player who is willing to do whatever it takes to make the team successful\u003c/li\u003e\n\u003cli\u003eLiving in or willing to relocate to the Oklahoma City metro area\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou'll work well if you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAre experienced with Android technologies (Java, Android SDK, etc.)\u003c/li\u003e\n\u003cli\u003eHave strong time management and organizational skills to drive projects to completion\u003c/li\u003e\n\u003cli\u003ePublished one or more applications in the Android Market\u003c/li\u003e\n\u003cli\u003eKnow Git\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou'll love us if:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBrewing your morning cup requires at least seven different apparatuses, none of which are a coffeemaker\u003c/li\u003e\n\u003cli\u003eYour root@localhost password is the chemical formula for caffeine\u003c/li\u003e\n\u003cli\u003eYou can translate English into Binary\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eReady to apply? Visit \u003ca href=\"http://bit.ly/YouVersionAndroidEngineer\"\u003ehttp://bit.ly/YouVersionAndroidEngineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0oxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d303b3ce0b610a0b6e3b02fd24efd4c486f1bb1e/YouVersion-Logo-dark.png"},{"id":"88aea7d8-c315-4313-823a-1f14feab33c9","type":"Full Time","url":"https://jobs.github.com/positions/88aea7d8-c315-4313-823a-1f14feab33c9","created_at":"Wed Oct 23 19:05:05 UTC 2019","company":"GetUpside","company_url":"https://www.getupside.com/","location":"Washington, DC","title":"Senior Software Engineer","description":"\u003cp\u003eMeet GetUpside\u003c/p\u003e\n\u003cp\u003eGetUpside helps businesses grow and people save by driving customers to nearby businesses with personalized cash back offers. We’re driving new customers to local businesses (more than 5,000 businesses across 13 states have made $10+ million in profit through GetUpside). We’re putting cash back in consumers’ pockets (more than $7 million cash back earned).\u003c/p\u003e\n\u003cp\u003eIn the end, we want to help local businesses get what they need (customers) and consumers get what they need (gas, groceries, you name it) for less. GetUpside is growing rapidly, with 17x growth in transaction volume in 2018 and we’re driving hundreds of millions of dollars of commerce a year.\u003c/p\u003e\n\u003cp\u003eWe're a DC-based startup founded in 2016 and made up of a great collection of people from companies like Google, Opower, Washington Post, MasterCard, Capital One, and LivingSocial. We recently closed our second round of funding and are well-funded by a great group of investors who care about our company, our mission, and our team’s success.\u003c/p\u003e\n\u003cp\u003eMeet GetUpside Engineering\u003c/p\u003e\n\u003cp\u003eThe engineering team at GetUpside is a close-knit group of talented, fast-learning individuals that believes in our mission to help communities thrive. We believe in a data-driven approach to decision-making and a supportive culture that emphasizes learning from our mistakes. We debate and deliberate on the best ideas to improve our tech stack, and strive for an inclusive atmosphere that champions the psychological wellness of all of our teammates.\u003c/p\u003e\n\u003cp\u003eOur technology stack\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAWS to run our microservices in a message-oriented-architecture\u003c/li\u003e\n\u003cli\u003eJava 8 / Dropwizard / 12-factor apps\u003c/li\u003e\n\u003cli\u003ePython 3 / Serverless AWS Lambdas\u003c/li\u003e\n\u003cli\u003eMySQL \u0026amp; DynamoDB\u003c/li\u003e\n\u003cli\u003eS3 \u0026amp; Athena\u003c/li\u003e\n\u003cli\u003eJenkins / Github / Terraform\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat will you do?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou will work in a team of 2-3 engineers and a product manager on our larger projects and sometimes individually on smaller, bite-sized improvements.\u003c/li\u003e\n\u003cli\u003eYou will deliver new product features in support of our mobile apps for users and web dashboards for merchants and improve our existing products’ ability to scale with increased user and merchant demand.\u003c/li\u003e\n\u003cli\u003eYou will build Java REST services to act in concert with our AWS-based message-oriented architecture and also build Python “glue” logic, deployed on AWS Lambda using the Serverless framework.\u003c/li\u003e\n\u003cli\u003eYou will identify, design, lead and/or contribute to anything and everything that needs to get done.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat do you bring?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have previous experience working on back-end jobs and services in Java\u003c/li\u003e\n\u003cli\u003eYou have strong analytical, organizational, and prioritization skills.\u003c/li\u003e\n\u003cli\u003eYou demonstrate ability to bring code from whiteboard scribbles to running in production.\u003c/li\u003e\n\u003cli\u003eYou are passionate about working in a dynamic and growing startup environment with a tight-knit, supportive engineering team that strives to make work interesting, challenging and fun.\u003c/li\u003e\n\u003cli\u003eYou have a constant desire for learning and self-improvement.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe're an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply directly via this job link: \u003ca href=\"https://www.getupside.com/careers/?gh_jid=4486367002\"\u003ehttps://www.getupside.com/careers/?gh_jid=4486367002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2QxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6e648d6965cb9e0acf4cdb3ab23af40f11b37e7c/Logo.jpg"},{"id":"a96b9c4d-5fca-4ecc-83f2-88d7558a4162","type":"Full Time","url":"https://jobs.github.com/positions/a96b9c4d-5fca-4ecc-83f2-88d7558a4162","created_at":"Wed Oct 23 16:36:13 UTC 2019","company":"YouVersion","company_url":"http://youversion.com/careers","location":"Oklahoma City, OK","title":"YouVersion Full-Stack Software Engineer","description":"\u003cp\u003eThe Full-Stack Software Engineer will be responsible for engineering web-based solutions that directly support features built by YouVersion’s Product Engineering Teams.\u003c/p\u003e\n\u003cp\u003eGod has placed you on the earth for a reason, at this crucial moment in time. He’s given you a purpose. With the smartest tech at our fingertips and more distractions vying for our attention than ever before, the need for the Bible has never been greater. If you’re looking for a place you can combine the skills God has given you with your passion to see people engage with His Word in new ways—no matter where they are or what languages they speak—the YouVersion Team is the place to start.\u003c/p\u003e\n\u003cp\u003eWith over 6,000 spoken languages and the majority of the world on 3G or slower mobile connections, the YouVersion Team is inventing technical solutions that create a first-class Bible experience for every person, regardless of language or location. We’re seeking a Full-Stack Engineer who will be responsible for engineering web-based solutions that directly support features built by YouVersion’s Product Engineering Teams. This includes (but is not limited to) internal content management systems, new feature development, and rapid prototyping.  You’ll work alongside world-class programmers to solve complex problems as you strive to make the Bible accessible in every language, everywhere on earth, on systems that are used by millions every day.\u003c/p\u003e\n\u003cp\u003eIf your passion for innovation is only surpassed by your desire to see people changed through the power of God’s Word, keep reading!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou are:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCalm and efficient under pressure and able to learn new things quickly\u003c/li\u003e\n\u003cli\u003eSomeone who knows when a 301 is better than a 404\u003c/li\u003e\n\u003cli\u003eGood at translating the big picture into bite-size requirements\u003c/li\u003e\n\u003cli\u003eNot tied down to a single language, library, or framework\u003c/li\u003e\n\u003cli\u003eComfortable switching contexts, but you really enjoy focus time\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou will be:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUsing Web technology to help people engage with the Bible daily\u003c/li\u003e\n\u003cli\u003eExploring the unique challenges of a large-scale web app\u003c/li\u003e\n\u003cli\u003eWriting code, fixing bugs, and changing the world\u003c/li\u003e\n\u003cli\u003eWorking with a team to build new features for Bible.com, the YouVersion Bible App, and new experiences and platforms\u003c/li\u003e\n\u003cli\u003eEngineering complex solutions based on designs and prototypes from our Product Team\u003c/li\u003e\n\u003cli\u003ePart of a cross-functional team of engineers and designers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou know well:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eModern Javascript Syntax and Tools (ES6+,Babel, Webpack, etc.)\u003c/li\u003e\n\u003cli\u003eA modern front-end Web framework (React,Vue, Angular,or something similar)\u003c/li\u003e\n\u003cli\u003eA Node.js Web server (Express,Fastify,or something similar)\u003c/li\u003e\n\u003cli\u003eCSS Syntax, Preprocessors,and CSS-in-JS libraries\u003c/li\u003e\n\u003cli\u003eResponsive Web Design strategies and tools\u003c/li\u003e\n\u003cli\u003eBasic Accessibility and SEO best practices\u003c/li\u003e\n\u003cli\u003eAt least the fundamentals of Gitlab CI and Kubernetes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIt would rock if you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBelieve that accessibility, responsiveness, and site speed are the second holiest trinity\u003c/li\u003e\n\u003cli\u003eThink it’s normal to write a SQL query, build a React Component, and squash a bug before lunch\u003c/li\u003e\n\u003cli\u003eEnjoy a continuous integration workflow with zero-downtime deploys\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis position will be located at the Life.Church Central Offices in Edmond, OK.\u003c/p\u003e\n\u003cp\u003eApply at \u003ca href=\"http://bit.ly/YouVersionFullStackEngineer\"\u003ehttp://bit.ly/YouVersionFullStackEngineer\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eReady to apply?\nVisit \u003ca href=\"http://bit.ly/YouVersionFullStackEngineer\"\u003ehttp://bit.ly/YouVersionFullStackEngineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0IxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9e16909262fd3a37cdf4466c4593c8499edb8606/YouVersion-Logo-dark.png"},{"id":"0baf0ff5-34f2-4ebb-948f-85b8a1bed168","type":"Full Time","url":"https://jobs.github.com/positions/0baf0ff5-34f2-4ebb-948f-85b8a1bed168","created_at":"Wed Oct 23 14:24:02 UTC 2019","company":"Intact Financial Corporation","company_url":"https://careers.intact.ca/ca/en","location":"Montreal","title":"Senior AI Developer","description":"\u003cp\u003eHow do you imagine life at an insurance company - its people, its culture, its offices? We bet that if you visit our team, you'll be in for quite the surprise!\u003c/p\u003e\n\u003cp\u003eOur team merges the speed and culture of a start-up with the resources and means of a large corporation. Located in downtown Montreal, we are a growing team, passionate about innovation and advanced technologies.\u003c/p\u003e\n\u003cp\u003eYou dream of exciting challenges at one of Canada’s top 100 places to work? Join our team as an Developer, Artificial Intelligence and take part in building the next generation of software products.\u003c/p\u003e\n\u003cp\u003eHiring Manager: Étienne Gauthier\u003c/p\u003e\n\u003cp\u003eWorkplace: Montreal (2020, Blvd. Robert-Bourassa)\u003c/p\u003e\n\u003cp\u003eYour mission :\u003c/p\u003e\n\u003cp\u003e•Enhance data usage and deliver AI-based and machine learning solutions\n•Participate in building and supporting the AI foundations used by the company’s different teams;\n•Evolve AI-based and machine learning software products;\n•Join a team with high visibility and a multitude of challenges.\u003c/p\u003e\n\u003cp\u003eYou are :\u003c/p\u003e\n\u003cp\u003e•A developer passionate about artificial intelligence, able to interact with software engineers, data scientists and R\u0026amp;D teams\n•An agent of change\n•Adept at translating a business problem into a technology solution\n•Comfortable working in complex environments that are constantly evolving and multidisciplinary team\u003c/p\u003e\n\u003cp\u003eYou have :\u003c/p\u003e\n\u003cp\u003e•A bachelor’s degree in computer science, software engineering, mathematics or a related discipline\n•3 years of experience in software development / engineering\n•Excellent understanding of machine learning and artificial intelligence\n•Proficiency with Python\n•Strong experience of software engineering practices such as Agile, Devops, CI and CD and others\u003c/p\u003e\n\u003cp\u003eAssets:\u003c/p\u003e\n\u003cp\u003e•Proficiency with at least one programming language such as Java, C# or C++\n•Strong experience with machine learning and scientific computing libraries such as scikit-learn, NumPy, SciPy, Weka, etc.\n•Knowledge of the machine learning life cycle;\n•A good knowledge of DevOps modern tools such as Docker, OpenShift, Kubernetes, ELK, Jenkins;\n•Knowledge of a deep learning framework such as Tensorflow, Caffe2, PyTorch or other.\n•Knowledge of the Actor model and asynchronous communication Akka., Kafka, RabbitMQ, etc.\u003c/p\u003e\n\u003cp\u003eHere are a few reasons why others have joined our team:\u003c/p\u003e\n\u003cp\u003e•An award-winning, inspiring workplace that supports its people and recognizes great work (Canada’s Top 100 Employers, Aon Platinum Best Employers, LinkedIn Top Company, Glassdoor Best Place to Work \u0026amp; Top CEO, Indeed Top-Rated Workplaces)\n•Stimulating, challenging projects and development opportunities to help you grow your skills and career\n•Flexibility in how and where you work\n•A comprehensive financial rewards program that recognizes your success\n•An extensive, flexible benefits package\n•An industry leading Employee Share Purchase Plan where we match 50% of net shares purchased\n•A casual ‘dress for your day’ culture that encourages you to be yourself\n•A $350 annual wellness account that promotes an active lifestyle\u003c/p\u003e\n\u003cp\u003eAbout us:\u003c/p\u003e\n\u003cp\u003eAs Canada’s largest provider of property and casualty insurance, we’re not only leading our industry, but we’re redefining what it means to work for it.  As a recognized top employer, we’re committed to living our values and supporting our dedicated people who bring their best to work each day because they know their work matters.\u003c/p\u003e\n\u003cp\u003eOur people are at the heart of what we promise – getting people back on track and helping them prosper in good times and be resilient in bad times.   We have over 13,000 employees who live our values every day and strive to deliver legendary service to our millions of customers across Canada and the U.S.  We have many brands that are a part of the Intact family.   In Canada, Intact Insurance and Brokerlink distribute insurance through a wide network of brokers, while belairdirect delivers products direct-to-consumer.\nIn the U.S., OneBeacon Insurance Group handles our specialty insurance line of business.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eClick on the link to apply: \u003ca href=\"https://bit.ly/362LRJQ\"\u003ehttps://bit.ly/362LRJQ\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVYxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8ac86751610ec731edd484e2f330c61f022eb1de/Logo%20intact.gif"},{"id":"a7ae3007-ecc1-43e6-a844-03122e021dc0","type":"Full Time","url":"https://jobs.github.com/positions/a7ae3007-ecc1-43e6-a844-03122e021dc0","created_at":"Wed Oct 23 14:14:12 UTC 2019","company":"Intact Financial Corporation","company_url":"https://careers.intact.ca/ca/en","location":"Montreal","title":"AI Application Architect","description":"\u003cp\u003eAt Intact, our values guide everything that we do.  We celebrate our differences and appreciate our similarities.  That’s why we are committed to building an inclusive and inspiring environment for all employees.\u003c/p\u003e\n\u003cp\u003eIf you are in need of a specific accommodation during the recruitment process, please let us know and we will be happy to provide.\u003c/p\u003e\n\u003cp\u003eLocated in downtown Montreal, we are a rapidly growing team of people who are passionate about innovation and leading-edge technologies. We focus on exploiting data to innovate and transform the insurance sector to make life easier for our customers.\u003c/p\u003e\n\u003cp\u003eHow do we do it? It’s really quite simple. We’re hiring a team of amazing talent – people like you – who are passionate about artificial intelligence and machine learning, and who want to make a difference. We’re rewriting the future of insurance. Are you ready to be a part of the story? This is your opportunity!\u003c/p\u003e\n\u003cp\u003eHiring Manager: Christine Couture\nWorkplace: Montreal (2020, Robert-Bourassa)\u003c/p\u003e\n\u003cp\u003eYour contribution:\n•Be part of a team with a high profile and a multitude of challenges to take on.\n•Develop and evolve the AI platform architecture and integration models with our systems and market tools.\n•Collaborate with members of various technical teams to develop solutions that address the constraints of our systems, data warehouses and environments.\n•Develop scalable and robust architectures that can support the growing volumes of our AI environment.\n•Provide solutions that meet our security and data protection standards.\n•Ensure the architecture is aligned with our corporate vision and objectives, while being able to propose new approaches.\u003c/p\u003e\n\u003cp\u003eYou are:\u003c/p\u003e\n\u003cp\u003e•Passionate about creating software that uses artificial intelligence, able to interact with teams of software developers, data scientists and researchers.\n•An agent of change with up-to-the-minute awareness of new AI technologies and approaches on the market.\n•Able to take a business problem and turn it into a technological solution.\n•Comfortable working in complex and constantly changing environments, and with multidisciplinary teams.\n•Excellent at explaining your ideas to various stakeholders.\n•Well organized, with a good sense of how to manage priorities.\n•A very good communicator who is able to cope with stress.\n•Bilingual\u003c/p\u003e\n\u003cp\u003eWhat you have:\n•A bachelor’s degree in information technology/software engineering or any equivalent combination of education and experience.\n•At least 5 years' experience in an architecture role.\n•At least 10 years' experience in software engineering.\n•Knowledge of SOA (and SOAP/REST), Java, Infrastructure Openshift/Kubernetes, Micro-service, Security (OWASP standards).\n•Will be considered as assets:\n•Skills in machine learning/AI\n•Hands-on experience delivering solutions using AI\u003c/p\u003e\n\u003cp\u003eA career in Insurance has never been this exciting.\nEvolving consumer expectations and technology have helped to shape a new vision for our industry – and we are leading the way. Our Technology teams are reshaping the way we do business and setting new industry benchmarks. Our Claims representatives are helping customers to get back on track after they experience a loss.  Our product teams are developing products that protect people and businesses so they can focus on what matters to them most.\nOur success story is written by our passion for living our values and creating a better tomorrow.  We’re re-writing the future of insurance - are you ready to be a part of the story?\u003c/p\u003e\n\u003cp\u003eExcellent benefits are offered: competitive salary, flexible benefits, flexible work arrangements, flexible leave, pension plan defined benefit, etc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eClick on this link to apply:\n\u003ca href=\"https://bit.ly/2MGskXO\"\u003ehttps://bit.ly/2MGskXO\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUYxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f272ab6a80ca817fc9a7bcc750fb241b5d015203/Logo%20intact.gif"},{"id":"7b0fa23d-5208-4ecd-84b4-580dba076c87","type":"Full Time","url":"https://jobs.github.com/positions/7b0fa23d-5208-4ecd-84b4-580dba076c87","created_at":"Wed Oct 23 13:51:59 UTC 2019","company":"LoginID","company_url":"http://www.loginid.io","location":"Toronto, ON","title":"Full Stack Developer - LoginID","description":"\u003cp\u003eAbout Us\nLoginID is on a mission to redefine how to protect user identity, providing users secure control over personal information through a privacy compliant decentralized network.  Our enterprise platform is comprised of three key pillars:  strong authentication, user privacy and identity, and uses a combination of biometrics and/or decentralized blockchain networks.  This approach creates higher customer interaction and sales conversions, while improving overall security for both customers and businesses.\u003c/p\u003e\n\u003cp\u003eWe are a team based in the Valley and Toronto, and are experts in security, encryption and tokenization.  We are looking for passionate team members to help build LoginID into a global leader.\u003c/p\u003e\n\u003cp\u003eAbout the role – Full-Stack Software Developer\nWe are looking for a driven, ambitious and self-starting Full-Stack Software Developer.  Reporting to our Head of Development, as a LoginID team member you will help design, build, and scale our platform. You’ll be part of a highly collaborative team, you’ll be whiteboarding, coding, and discussing our technology with our team members.\u003c/p\u003e\n\u003cp\u003eOur current code base includes technologies like Nodejs, PHP, Javascript, HTML, CSS, SQL, and/or NoSQL and will touch technologies across emerging blockchain networks.  You have also deployed containerized solutions with Docker.\u003c/p\u003e\n\u003cp\u003eAbout You\nAs a senior engineer, you’ve encountered and solved problems across the full server-side stack. You are a guru in delivering solid code, which includes designing, implementing, and testing new features or capabilities. You get excited about new technologies and helping build transformative platforms. You’re comfortable both working on server-side configurations and helping with front-end work. In addition:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a senior developer\u003c/li\u003e\n\u003cli\u003eYou have 5+ years of experience building and scaling web infrastructure and applications\u003c/li\u003e\n\u003cli\u003eYou are familiar with industry-wide processes, patterns and practices\u003c/li\u003e\n\u003cli\u003eYou can collaborate across multiple teams\u003c/li\u003e\n\u003cli\u003eYou understand and can implement testing strategies\u003c/li\u003e\n\u003cli\u003eYou have strong verbal and written communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther Qualities We’re Looking For\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbility to de-construct complex business requirements and the ability to think out of the box\u003c/li\u003e\n\u003cli\u003eExcitement for working in a start-up environment with a high level of ambiguity and change\u003c/li\u003e\n\u003cli\u003eA passion for delivery and a willingness to focus on the achievement of milestones\u003c/li\u003e\n\u003cli\u003eLearning new technologies such as biometrics, blockchain\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHow to apply\nInterested in this role? Please email your resume, LinkedIn and Github profiles to \u003ca href=\"mailto:support@loginid.io\"\u003esupport@loginid.io\u003c/a\u003e with the subject iine heading “GIT FS posting”.\u003c/p\u003e\n\u003cp\u003eApplicants must be legally eligible to work in Canada.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:support@loginid.io\"\u003esupport@loginid.io\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGQxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--994fe7b06b04126211fca3c1121fa4322900177c/LoginID%20logo.png"},{"id":"9eb3765e-4ee9-4dd6-aef8-ca294cda7e76","type":"Full Time","url":"https://jobs.github.com/positions/9eb3765e-4ee9-4dd6-aef8-ca294cda7e76","created_at":"Wed Oct 23 10:38:24 UTC 2019","company":"Accenture AG\t","company_url":"https://www.accenture.com/ch-de","location":"Zurich","title":"Java / Full-Stack Developer (all genders) Voll-/Teilzeit","description":"\u003cp\u003eDeine Persönlichkeit und Individualität machen den Unterschied. Im Team von Accenture steigern wir die unternehmerische Leistungsfähigkeit unserer Kunden und weisen ihnen den Weg ins digitale Zeitalter. So auch im Bereich Technology: Hier gestalten wir die Technologien von morgen und beschleunigen den digitalen Wandel. Und hier setzt du frische Impulse im Team von IES, den Intelligent Engineering Services von Accenture, wo in direkter, interaktiver und agiler Zusammenarbeit zwischen Entwicklern und Kunden innovative Lösungen rund um Cloud Computing, Big / Fast Data, Enterprise Architecture, Maschinelles Lernen und Künstliche Intelligenz entstehen.\u003c/p\u003e\n\u003cp\u003eDas ist genau dein Ding? Dann lebe deine Leidenschaft in einer Position, in der du als Java Entwicklerin bzw. Java Entwickler an unseren Standorten (Zürich, Bern oder Lugano) mit modernsten Technologien spannende Kundenprojekte zum Erfolg führst. Nimm die Herausforderung an und arbeite an DEN High-Performance-Lösungen der Zukunft!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHier machst du den Unterschied\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu entwickelst (Web-)Anwendungen auf Basis von Java, Java EE, Spring und/oder moderne Webtechnologien (JavaScript, HTML5, CSS3, etc.)\u003c/li\u003e\n\u003cli\u003eDabei kreierst du innovative Konzepte, implementierst die finale Softwarelösung und übernimmst, abhängig von deiner Erfahrung, schnell (Teil-)Projektverantwortung\u003c/li\u003e\n\u003cli\u003eDu bleibst technologisch immer auf dem aktuellsten Stand und findest bei uns die Möglichkeit, dich individuell einzubringen, von Java-Experten zu lernen und dich so weiterzuentwickeln, wie du es planst\u003c/li\u003e\n\u003cli\u003eAls Teil agiler Teams arbeitest du intensiv mit deinen Kolleginnen und Kollegen zusammen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHiermit kommst du bei uns an\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium oder Berufsausbildung und relevante Berufserfahrung\u003c/li\u003e\n\u003cli\u003eErfahrung mit Backend-orientierten und/oder Frontend-orientierten Technologien kombiniert with Know-How in DevOps, CI/CD, Cloud-Konzepten, RESTful APIs und microservices\u003c/li\u003e\n\u003cli\u003ePraxis in der Anwendungsentwicklung mit Java EE, J2EE, Spring framework, SQL und ORM Technologien kombiniert mit Kenntnissen in agilen Entwicklungsprozessen und -methoden\u003c/li\u003e\n\u003cli\u003eErfahrung mit JavaScript und eines Frameworks/Plattform wie Angular, React, Vue and Node.js\u003c/li\u003e\n\u003cli\u003eFliessend in Englisch, Deutsch ist von Vorteil\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDein Kontakt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDu hast Fragen? Dann wende dich an unser Recruiting Team oder telefonisch unter 0041 44 219-5005.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://accenture.join.com/jobs/423437-java-full-stack-developer-all-genders-voll-teilzeit?pid=757e7cf81db3118dbbf1\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=java%2Bfull-stack%2Bdeveloper%2Ball%2Bgenders%2Bvoll-%2Bteilzeit\"\u003ehttps://accenture.join.com/jobs/423437-java-full-stack-developer-all-genders-voll-teilzeit?pid=757e7cf81db3118dbbf1\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=java%2Bfull-stack%2Bdeveloper%2Ball%2Bgenders%2Bvoll-%2Bteilzeit\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFYxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1acd68a96b53188e2565e2fcc55e4b93cf9a588b/cq5dam.thumbnail.360.360.png"},{"id":"5ceb7560-3be5-446d-a878-1482a7ff0728","type":"Full Time","url":"https://jobs.github.com/positions/5ceb7560-3be5-446d-a878-1482a7ff0728","created_at":"Wed Aug 07 19:54:07 UTC 2019","company":"American Physical Society","company_url":null,"location":"Ridge","title":"Software Developer","description":"\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eThe American Physical Society (APS) is a nonprofit membership organization working to advance and diffuse the knowledge of physics through its outstanding research journals, scientific meetings, and education, outreach, advocacy, and international activities. APS represents over 55,000 members, including physicists in academia, national laboratories, and industry in the United States and throughout the world. Society offices are located in College Park, MD (Headquarters), Ridge, NY, and Washington, D.C.\u003c/p\u003e\n\u003cp\u003ePosition Summary\u003c/p\u003e\n\u003cp\u003eThe American Physical Society, a leading publisher of scientific journals, based in Suffolk County, LI, is seeking a front end developer. This is an exciting opportunity to apply your strong front end development and UX skills to build applications used in all aspects of scientific publishing.\u003c/p\u003e\n\u003cp\u003eWe’re a group who happily share knowledge and value other ideas, while working in a bright, modern office with a friendly atmosphere and flat hierarchies. We will challenge you with interesting work while providing you with a collaborative culture in a fast paced environment. Our staff is encouraged to attend industry conferences and we are constantly playing with new tools and use all the latest and greatest technologies, affording you the capability to impact all aspects of your projects.\u003c/p\u003e\n\u003cp\u003eYou must have excellent English communication skills, be a problem solver and a team player, and be results oriented.  Other incentives for working at APS are great pay, great benefits, generous 403(b), fun company events, commuter benefits, and 3 weeks paid vacation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf possible, when applying, please provide code samples and URL's of previous applications you've developed. Candidates who provide links to their GitHub profiles or personal websites with technical articles and/or code samples will receive priority.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert knowledge of HTML5, CSS3, and associated web standards\u003c/li\u003e\n\u003cli\u003eExperience writing modern Javascript (ES6/ES2015, ES2017, Typescript, etc).\u003c/li\u003e\n\u003cli\u003eExperience with front-end frameworks such as React or Vue.js\u003c/li\u003e\n\u003cli\u003eExperience with modern front-end tooling (Babel, webpack, gulp, parcel, etc.)\u003c/li\u003e\n\u003cli\u003eProficiency in building responsive web applications\u003c/li\u003e\n\u003cli\u003eKnowledge of UI/UX design concepts, pattern libraries, style guides, etc.\u003c/li\u003e\n\u003cli\u003eBasic command line proficiency (Linux and/or Mac OS X preferred)\u003c/li\u003e\n\u003cli\u003eExperience with Git or a similar version control system\u003c/li\u003e\n\u003cli\u003eExperience with AWS or similar cloud service providers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience doing test driven development with Jest, Jasmine, Mocha/Chai/Sinon, Karma. Integration testing with Selenium.\u003c/li\u003e\n\u003cli\u003eExperience with server side development (node.js, express, etc.)\u003c/li\u003e\n\u003cli\u003eBasic knowledge of GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with additional programming languages (clojurescript, Typescript preferred)\u003c/li\u003e\n\u003cli\u003eAccessibility\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe American Physical Society strives to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe the leading voice for physics and an authoritative source of physics information for the advancement of physics and the benefit of humanity.\u003c/li\u003e\n\u003cli\u003eProvide effective programs in support of the physics community and the conduct of physics.\u003c/li\u003e\n\u003cli\u003eCollaborate with national scientific societies for the advancement of science, science education and the science community.\u003c/li\u003e\n\u003cli\u003eCooperate with international physics societies to promote physics, to support physicists worldwide and to foster international collaboration.\u003c/li\u003e\n\u003cli\u003ePromote an active, engaged and diverse membership, and support the activities of its units and members.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe American Physical Society is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, disability or veteran status.\u003c/p\u003e\n\u003cp\u003eWe welcome you to apply today!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://aps.applicantstack.com/x/apply/a270i42bpshs/aaal\"\u003ehttps://aps.applicantstack.com/x/apply/a270i42bpshs/aaal\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkp1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--118ea800d52adb23c90a10f0a276e48f221f8dcf/APSLogo_2color.gif"},{"id":"740ce758-53cc-4f3d-88b9-80aaa92e2105","type":"Full Time","url":"https://jobs.github.com/positions/740ce758-53cc-4f3d-88b9-80aaa92e2105","created_at":"Tue Oct 22 17:42:36 UTC 2019","company":"Farm Journal","company_url":"http://www.farmjournal.com","location":"Chicago","title":"Software Developer","description":"\u003cp\u003e\u003cstrong\u003ePOSITION DESCRIPTION\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFarm Journal, the nation’s leading agricultural B2B information and media company, is seeking an experienced \u003cstrong\u003eSoftware Developer\u003c/strong\u003e to join our growing digital and web development team.  We reach agribusiness professionals through 44+ million monthly engagements via our branded websites, e-newsletters, native mobile apps, print publications, events and conferences, and our nationally syndicated television and radio broadcasts; as well as an array of data-driven products. We use technology to actively shape the agriculture marketplaces of the future.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYOU ARE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProfessionally Proficient. Your background reflects a combination of back-end and front-end programming skills and solution architecture design.\u003c/li\u003e\n\u003cli\u003eComfortable working under general direction, delivering solution approaches  that address ambiguous, time-sensitive, business challenges\u003c/li\u003e\n\u003cli\u003eCollaborative – you will work closely with the organization’s technology leaders and non-technical stakeholders. You are an excellent communicator – skilled at explaining complex technical concepts to non-technical stakeholders.\u003c/li\u003e\n\u003cli\u003eBusiness-Aware. You have a demonstrated ability to quickly identify the business problem driving technology requests and align that understanding with solution design recommendations.\u003c/li\u003e\n\u003cli\u003eClient-Focused. You prioritize user needs over technical feasibility and identify ways to solve problems that do not increase technical debt.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU OFFER\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\u003c/li\u003e\n\u003cli\u003e3+ years experience developing user-facing features using ReactJS and building reusable components and front-end libraries\u003c/li\u003e\n\u003cli\u003e3+ years of experience with RESTful APIs\u003c/li\u003e\n\u003cli\u003e1+ years of experience with GraphQL\u003c/li\u003e\n\u003cli\u003eAbility to translate designs and wireframes into high quality code, optimizing components for maximum performance across a variety of web-capable devices and browsers\u003c/li\u003e\n\u003cli\u003eExperience with data structure libraries (e. g., Immutable. js)\u003c/li\u003e\n\u003cli\u003eKnowledge of modern authorization mechanisms, such as Oauth2\u003c/li\u003e\n\u003cli\u003eFamiliarity with modern front-end build pipelines and build tools\u003c/li\u003e\n\u003cli\u003eCommitment to software practices of continuous Integration, automated/repeatable testing, and collaborative work environments.\u003c/li\u003e\n\u003cli\u003eAbility to think abstractly and deal with ambiguous/under-defined problems.\u003c/li\u003e\n\u003cli\u003eAbility to enable business capabilities through innovation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE OFFER\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHealthy work / life balance\u003c/li\u003e\n\u003cli\u003eDaily “mental Break” opportunities with Table Tennis, Jenga and Connect4\u003c/li\u003e\n\u003cli\u003eFlexible Work-from-home days each month\n•Competitive annual salary\u003c/li\u003e\n\u003cli\u003ePaid vacation\u003c/li\u003e\n\u003cli\u003eMedical PPO and HSA coverage through BlueCross\u003c/li\u003e\n\u003cli\u003eDental and vision coverage\u003c/li\u003e\n\u003cli\u003eEmployer paid life and AD\u0026amp;D coverage\u003c/li\u003e\n\u003cli\u003eEmployer paid short-term and long-term disability coverage\u003c/li\u003e\n\u003cli\u003eFlexible spending account\u003c/li\u003e\n\u003cli\u003e401k retirement savings plan with employer matching\u003c/li\u003e\n\u003cli\u003ePre-tax transit and parking benefits via direct payroll deduction\u003c/li\u003e\n\u003cli\u003eConvenient location in our downtown Chicago office featuring an open and collaborative floor plan, amazing views of the River, and located close to Union Stations, Ogilvie Station and the Brown/Orange/Pink/Purple El stations\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:hr@farmjournal.com\"\u003ehr@farmjournal.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazkxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--655bfcb391e88cf8e2bde04acfad720f176faf38/NEW%20LOGO300.jpg"},{"id":"2ffe2180-1bf6-4e3f-b7da-f45fd719cbcb","type":"Full Time","url":"https://jobs.github.com/positions/2ffe2180-1bf6-4e3f-b7da-f45fd719cbcb","created_at":"Tue Oct 22 08:26:13 UTC 2019","company":"PlusServer GmbH","company_url":"http://www.plusserver.com/karriere","location":"Köln","title":"Java Entwickler Front- und Backend","description":"\u003cp\u003eWir bieten die Sicherheit eines Konzerns mit der Aufbruchsstimmung eines Startups!\u003c/p\u003e\n\u003cp\u003ePlusServer ist der deutsche Managed Cloud Service Provider für komplexe IT-Landschaften und skalierbare Cloud-Lösungen. Mit innovativen Betriebsmodellen und maßgeschneiderten Systemarchitekturen begleiten wir den Mittelstand sowie Großunternehmen aus Branchen wie Handel, Agenturen, Versorgungsbetriebe oder produzierendes Gewerbe umfassend bei der digitalen Transformation.\u003c/p\u003e\n\u003cp\u003eDank flacher Hierarchien und Gestaltungsfreiräumen kann bei uns jeder Mitarbeiter sein volles Potential entfalten und zum weiteren Fortschritt von PlusServer beitragen.\u003c/p\u003e\n\u003cp\u003eFür den Standort in Köln suchen wir zum nächstmöglichen Termin mehrere Java Entwickler Front- und Backend (m/w/d).\u003c/p\u003e\n\u003cp\u003eDeine Aufgaben:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu programmierst individuelle webbasierte Anwendungen mit den modernsten Technologien (Spring, Java EE, Wicket) für komplexe Plattformen namhafter Kunden\u003c/li\u003e\n\u003cli\u003eIn diesem Zusammenhang wirkst Du bei der Planung von neuen Features und Projekten mit und arbeitest in interdisziplinären und agilen Entwicklungsteam\u003c/li\u003e\n\u003cli\u003eWeiterhin integrierst Du externe und pflegst bestehende Systeme\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas zeichnet Dich aus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu bist passionierter Entwickler und hast Erfahrung in der Entwicklung von webbasierten Anwendungen mit Java EE – dabei sind Einsteiger bis zum Senior alle Level willkommen\u003c/li\u003e\n\u003cli\u003eDu hast Freude an Teamarbeit mit agilen Herangehensweisen und gestaltest gerne Entwicklungs- und Releaseprozesse mit\u003c/li\u003e\n\u003cli\u003eWicket, Spring, SQL, Netzwerk und Deployment sind keine Fremdwörter für Dich\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUnser Angebot:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHervorragende Zukunftsperspektiven beim Marktgestalter der Digitalisierung\u003c/li\u003e\n\u003cli\u003eGroße Gestaltungsfreiräume für Deine Ideen und Dein Engagement\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten für eine ausgewogene Work-Life-Balance\u003c/li\u003e\n\u003cli\u003eEin freundliches, familiäres und offenes Betriebsklima in allen Hierarchieebenen\u003c/li\u003e\n\u003cli\u003eEine strukturierte Einarbeitung in Dein Aufgabenfeld auf Augenhöhe mit Deinem Paten\u003c/li\u003e\n\u003cli\u003eFortwährende Weiterbildungsmöglichkeiten in unserer PlusAcademy\u003c/li\u003e\n\u003cli\u003eZertifizierung als AWS-Premiumpartner und IHK-Ausbildungsbetrieb\u003c/li\u003e\n\u003cli\u003eSehr viele schöne Momente bei regelmäßigen Firmenveranstaltungen\u003c/li\u003e\n\u003cli\u003eTäglich ein reichhaltiges und kostenfreies Frühstücksbuffet, Obst, Wasser, Tee und Kaffee in unserem hauseigenen PlusBistro\u003c/li\u003e\n\u003cli\u003eModern eingerichtete Arbeitsplätze mit sehr guten Bahn- und Zuganbindungen\u003c/li\u003e\n\u003cli\u003eBezuschusste Parkplätze oder ein bezuschusstes Jobticket\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDein Kontakt:\nMarco steht Dir gerne unter 0220310453521 für Rückfragen zur Verfügung.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eWir erwarten Deine Bewerbung an \u003ca href=\"mailto:karriere@plusserver.com\"\u003ekarriere@plusserver.com\u003c/a\u003e oder über unser Homepage.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajkxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9e83de08ef2fe6ba77f8fe3c21359f9b8176a9ce/Bildschirmfoto%202019-10-22%20um%2010.13.59.png"},{"id":"008ab00a-89bb-4541-98e8-e7b85ffa6035","type":"Full Time","url":"https://jobs.github.com/positions/008ab00a-89bb-4541-98e8-e7b85ffa6035","created_at":"Tue Oct 22 08:13:53 UTC 2019","company":"Softbrik","company_url":"https://softbrik.com","location":"remote","title":"Frontend developer","description":"\u003cp\u003e\u003cstrong\u003eJob description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLooking for a challenge? Enjoy doing different types of development? We're seeking a Web a skilled web developer to join our startup team and help us raising the bar on creativity and user experiences.\u003c/p\u003e\n\u003cp\u003eProficiency in JavaScript, HTML, CSS and/or other web/JavaScript based frameworks is essential to succeeding in this role. The web developer will have an immediate effect on our brand and that of our clients’, as well as an ongoing impact on the usability and user experience of our web applications.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eObjectives of this Role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eCreate well-designed, tested code using best practices for website development, including mobile and responsive site design\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCreate websites and user interfaces, using standard HTML/CSS practices, while incorporating data from back-end databases and services\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop or validate testing schedules, addressing all browsers and devices to ensure various computers can access content\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMaintain updated knowledge of new and emerging industry trends and technology\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSkills and Qualifications\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eFive years of development experience with at least three years of JavaScript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience in planning and developing websites across multiple products and organizations\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWorking knowledge of web applications, programming languages, and web services, such as APIs, CSS, SCSS, cross-browser compatibility, HTML, HTML5, JavaScript, JQuery, PHP, security principles, REST, SOAP, and web user interface design (UI)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAdvanced understanding of multiple JavaScript frameworks and libraries (jQuery, Angular, React, Vue or similar).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGood knowledge in UX design principles.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eExperience implementing and using modern web development workflows and operations using a variety of tools including GitHub\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePreferable knowledge of AWS Lambda, API Gateway, DynamoDB or other basic AWS services.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCompany offers\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a cloud/SaaS focused startup and You will be part of our fast moving and growing development team. We value high customer focus and delivering systems that customers benefit from. Being a start up, Softbrik offers plenty of room for growth and plenty of technical challenges. You will help to shape the company and your own options for carrier advancement.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply or know more about Softbrik and the Front-end developer role, just email us at \u003ca href=\"mailto:jobs@softbrik.com\"\u003ejobs@softbrik.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBangxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--004a2b390563e848c8796aad1ee3c30a75640d69/logo.png"},{"id":"092c5660-bd5c-484f-96fe-0d9796e87031","type":"Full Time","url":"https://jobs.github.com/positions/092c5660-bd5c-484f-96fe-0d9796e87031","created_at":"Thu Sep 19 21:48:28 UTC 2019","company":"LeapYear","company_url":"https://leapyear.ai/careers","location":"San Francisco","title":"Haskell Engineer at LeapYear - Core Platform","description":"\u003ch2\u003eWhat we do\u003c/h2\u003e\n\u003cp\u003eLeapYear's secure machine learning platform is deployed by some of the largest enterprises in the world across finance, healthcare, and technology.\u003c/p\u003e\n\u003cp\u003eOur technology ensures differential privacy, a widely recognized standard of data privacy that enables all data - including sensitive information - to be utilized for analytics, while providing mathematically proven privacy protection.\u003c/p\u003e\n\u003cp\u003eThe LeapYear system is composed of a core set of components that allow private machine learning on data sets that can scale to petabytes. The system includes private algorithms for relational operations, statistical methods and machine learning. A data scientist accesses private data using a Python API. Administration is provided  via a web-based GUI or an API.\u003c/p\u003e\n\u003cp\u003eLeapYear's platform team builds the services that allow our product to integrate with complex enterprise environments and operate effectively on our customers’ most sensitive data.\u003c/p\u003e\n\u003cp\u003eThe platform includes services for authentication, access control, logging, auditing  and support for integration of data from a variety of data sources including SQL/NoSQL Databases, HDFS and S3. Queries are processed using Spark to support to enable fast, distributed processing  of massive data sets. The services are primarily written in Haskell, with Python, Scala, and Java used as additional supporting languages.\u003c/p\u003e\n\u003cp\u003eWe are looking for platform engineers that have a track record of developing enterprise-ready features for technical end users, including enterprise integrations, rigorous security, flexible deployment, and support for diverse data sources.\u003c/p\u003e\n\u003ch2\u003eRecent technical challenges we've been working on\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDeveloping a Spark-based query engine with strong typechecking.\u003c/li\u003e\n\u003cli\u003eAchieving terabyte and petabyte scale on Spark.\u003c/li\u003e\n\u003cli\u003eRefactoring our persistence layer.\u003c/li\u003e\n\u003cli\u003eUsing Haskell to implement enterprise-ready subsystems for authentication, permissioning, job management, and logging.\u003c/li\u003e\n\u003cli\u003eExtending the platform to support automated daily data updates.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor details on the specific responsibilities and requirements of this role, please see below.\u003c/p\u003e\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop greenfield systems and scale existing services to support internet-scale deployments.\u003c/li\u003e\n\u003cli\u003eOwn the full software development lifecycle - problem definition, design, development, testing, demoing, and supporting production use of the features you own.\u003c/li\u003e\n\u003cli\u003ePartner with product management to define problems and identify iterative solutions\u003c/li\u003e\n\u003cli\u003eBalance immediate business objectives against long-term architectural vision\u003c/li\u003e\n\u003cli\u003eContribute to an engineering-wide culture of code quality and shared responsibility for testing\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of professional experience writing production code\u003c/li\u003e\n\u003cli\u003eAcquainted with and interested in functional programming (Haskell, OCaml, Clojure, Erlang, Scala)\u003c/li\u003e\n\u003cli\u003eTrack record of delivering high-quality product features on schedule\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003ePreferred\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperience developing for on-premise enterprise deployments\u003c/li\u003e\n\u003cli\u003eProfessional experience with functional programming\u003c/li\u003e\n\u003cli\u003ePrior experience developing production-level Spark applications or machine learning platforms\u003c/li\u003e\n\u003cli\u003eExperience with ODBC/JDBC databases, AWS, CircleCI\u003c/li\u003e\n\u003cli\u003eLifelong learners and mentors\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eA Few of the Perks\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eCulture of teaching and learning\u003c/li\u003e\n\u003cli\u003eCompetitive compensation package of salary and equity\u003c/li\u003e\n\u003cli\u003eCatered lunch every day\u003c/li\u003e\n\u003cli\u003eCompany outings\u003c/li\u003e\n\u003cli\u003eBuild your ideal work station\u003c/li\u003e\n\u003cli\u003eGenerous health insurance plan\u003c/li\u003e\n\u003cli\u003eRelocation support and visa sponsorship\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSubmit an application at \u003ca href=\"https://leapyear.ai/careers\"\u003ehttps://leapyear.ai/careers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUZ5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--53d46724c12970a933bdb01988af00e6b043b39e/LeapYear%20Logo%20Transparent%20Black%20cropped.png"},{"id":"b3704276-7ed7-4880-8d45-f35052964659","type":"Full Time","url":"https://jobs.github.com/positions/b3704276-7ed7-4880-8d45-f35052964659","created_at":"Mon Oct 21 21:12:11 UTC 2019","company":"Datadog","company_url":"http:","location":"NewYork","title":"Software Engineer- Frontend","description":"\u003cp\u003eHave you been writing beautiful web UIs for as long as you can remember? Are you excited about the rapid evolution of browser apps? Do typical shallow web opportunities out there leave you wanting for more?\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to bring sanity to Dev \u0026amp; Ops, and we need you to engineer engaging and usable UIs to effortlessly explore large amounts of data, and to help our users understand their infrastructure through interactive visualizations.\u003c/p\u003e\n\u003cp\u003eWhat you will do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTransform large and complex datasets to beautiful visualizations\u003c/li\u003e\n\u003cli\u003eImplement compelling, usable UIs; contribute to their design; and engineer them with React and Redux\u003c/li\u003e\n\u003cli\u003eJoin a tightly knit team solving hard problems the right way\u003c/li\u003e\n\u003cli\u003eImprove performance and address scalability limits\u003c/li\u003e\n\u003cli\u003eOwn meaningful parts of our service, have an impact, grow with the company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we're looking for\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have been designing and engineering UIs for several years\u003c/li\u003e\n\u003cli\u003eYou’re a master of Javascript, HTML, and CSS and you’re aware of the latest trends with frontend technologies\u003c/li\u003e\n\u003cli\u003eYou know how to use design patterns to create simple and reusable components for complex UIs\u003c/li\u003e\n\u003cli\u003eYou are familiar with data structures and algorithms, profiling and optimization\u003c/li\u003e\n\u003cli\u003eYour work or portfolio is visible online\u003c/li\u003e\n\u003cli\u003eYou value code simplicity, performance and details\u003c/li\u003e\n\u003cli\u003eYou want to work in a fast, high growth startup environment that respects its engineers and customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou fell in love with D3 (we did)\u003c/li\u003e\n\u003cli\u003eYou’ve worked on a large application using React, Angular, Backbone, Ember, Flux, or Redux\u003c/li\u003e\n\u003cli\u003eYou write your Javascript in ES6 and Babel\u003c/li\u003e\n\u003cli\u003eYou enjoy writing Python, Ruby, C++, Rust or Go\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/f0a956961\"\u003ehttps://grnh.se/f0a956961\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakIxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1f0a28603d214045d8d3d943048caf0039fc5d2/dd_logo_v_rgb.png"},{"id":"a71fdb23-3447-4b5f-8fca-db08a774e48b","type":"Full Time","url":"https://jobs.github.com/positions/a71fdb23-3447-4b5f-8fca-db08a774e48b","created_at":"Mon Oct 21 18:28:48 UTC 2019","company":"Abt Associates","company_url":"https://www.abtassociates.com/","location":"Cambridge, MA","title":"Senior Application Developer","description":"\u003cp\u003e\u003cstrong\u003eOpportunity\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAbt Associates seeks a qualified Senior Application Developer to support the Data Science and Survey and Enabling Technologies Division. We are looking for experienced candidates with expertise of one or more of the following: client and server side web programming in PHP, JavaScript frameworks like Angular/Node/React/Vue, backend databases MySQL along with a good understanding of web design and usability. Experience in configuring and using cloud environments such as AWS and technologies like Lambda.   The senior developer will work closely with internal and external clients and serve as both a consultant and solutions provider. The senior developer will help architect and define solutions to meet the business needs. The senior developer will oversee testing, quality assurance and post rollout troubleshooting and enhancements.  Candidate should demonstrate a willingness to seek novel solutions to technology and business problems and the flexibility to acquire the necessary skills for implementation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKey Roles and Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate technical application designs by documenting process flows; mapping functional requirements to technical requirements; creating database diagrams; and creating application prototypes, where applicable\u003c/li\u003e\n\u003cli\u003eEstimate the level of effort required to complete technical work. Plan technical work so that it may be completed on schedule and within budget\u003c/li\u003e\n\u003cli\u003eDevelop complex applications using the appropriate approach and technology, with focus on long-term support implications\u003c/li\u003e\n\u003cli\u003eCoordinate quality control activities by developing test plans, executing tests, and facilitating transition to end-users for testing and signoff\u003c/li\u003e\n\u003cli\u003eBuilds web applications using predefined template structures to respond to client needs\u003c/li\u003e\n\u003cli\u003eParticipates in client needs assessments, develops strategy and information architecture, including sitemaps and wireframes\u003c/li\u003e\n\u003cli\u003eSupports clients’ technical issues with web applications\u003c/li\u003e\n\u003cli\u003eActs as liaison with internal partners and individual users to ensure positive web experience\u003c/li\u003e\n\u003cli\u003eMay serve as project leader and/or supervise other technical staff on project teams, as required\u003c/li\u003e\n\u003cli\u003eEnsures that all documents meet established content standards\u003c/li\u003e\n\u003cli\u003eStrong verbal and written communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred Skills / Prerequisites\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWeb and application development using PHP\u003c/li\u003e\n\u003cli\u003eExperience in writing JavaScript targeting the Node runtime for AWS Lambda or equivalent\u003c/li\u003e\n\u003cli\u003eJavaScript and JavaScript frameworks such as Angular/Node/React/Vue\u003c/li\u003e\n\u003cli\u003eHTML5 / CSS\u003c/li\u003e\n\u003cli\u003eVersion control repositories like Bitbucket\u003c/li\u003e\n\u003cli\u003eTask management in software development tools like Jira and Confluence\u003c/li\u003e\n\u003cli\u003eA desire to write re-usable, readable code using the most up to date industry standards\u003c/li\u003e\n\u003cli\u003eStrong communication skills, particularly in translating perceived needs into technical requirements\u003c/li\u003e\n\u003cli\u003eSelf-motivated and able to work independently in a fast paced, deadline driven environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eMinimum Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBA/BS with (6-8) years of experience OR the equivalent combination of education and experience\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply online here:\n\u003ca href=\"https://career4.successfactors.com/sfcareer/jobreqcareer?jobId=61607\u0026amp;company=AbtPROD\u0026amp;username=\"\u003ehttps://career4.successfactors.com/sfcareer/jobreqcareer?jobId=61607\u0026amp;company=AbtPROD\u0026amp;username=\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTkxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--260d417bf74b976e6534c29bfdaf92de60b775a2/data.png"},{"id":"df2d1d3f-4408-45ca-b586-3f07eb24e0e6","type":"Full Time","url":"https://jobs.github.com/positions/df2d1d3f-4408-45ca-b586-3f07eb24e0e6","created_at":"Mon Oct 21 18:25:41 UTC 2019","company":"Sertifi","company_url":"https://corp.sertifi.com/","location":"Chicago","title":"Senior Software Developer","description":"\u003cp\u003eSertifi offers an Agreement Platform built for businesses who need a more efficient and secure way to manage the full contract process. We simplify how businesses send and collect agreements and payments by bringing it all into one secure platform. Sertifi automates business processes, saves you time from performing repetitive tasks, enhances security and PCI-compliance, and provides customers an easy and convenient way to do business with your company. Thousands of businesses around the world use Sertifi to streamline their contracts and payment processes, recognize revenue faster, and increase job efficiency.\u003c/p\u003e\n\u003cp\u003eWe are looking for a talented and highly motivated Full Stack Developer to help launch new features and expand capabilities of our electronic signature and payment application. The web application is written in ASP.NET, with client-side Angular/Typescript, Node.JS, JavaScript, and jQuery. The back-end database is SQL Server with web services used to expose a rich and simple to use API.\u003c/p\u003e\n\u003cp\u003eOur ideal candidate is a self-starter who is capable of building advanced ASP.NET applications as part of a team. You must be able to fully understand the ins and outs of ASP.NET, how it works, or be able to pick up a book or online tutorial and teach yourself when something unknown comes your way. You’ll have the opportunity to immediately contribute and see results of your work in use by millions of users across the globe. This position reports to our Engineering Manager in our downtown Chicago office.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChallenges You’ll Tackle:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eTake ownership of, architect, build and scale business critical services\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop a deep understanding of the relevant business areas and various components in the stack\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop integration strategies\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll Need to Succeed:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e5+ years of experience working on large scale web applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExpert in .NET based technologies and ecosystem - .NET Framework through 4.5, WebAPI, ASP.NET MVC\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFor the Front End we’re looking for expert level knowledge of Angular/Typescript and Node.JS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWorking knowledge of HTML, CSS, and JavaScript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWeb service consumption and design experience (REST or SOAP)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid competencies in data structures, design patterns, algorithms\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong web application design and architectural skills\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of data layer concerns and working knowledge of SQL\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBachelor’s degree in Computer Science or equivalent experience\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNice to haves:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with mercurial or git\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with cloud platforms such as Azure and Salesforce\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with SSO flows and SAML\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with eCommerce payments or PDF parsing and manipulation\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with message bus/distributed systems\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s in it for you:\u003c/strong\u003e You will work in a collaborative office environment that welcomes new ideas and allows you to make an immediate impact on the team. You can also expect to have dedicated heads down time to code along with time set aside each month to work on Innovation ideas. Additionally, we offer great benefits such as: competitive salary, medical/dental/vision insurance, short-term and long-term disability insurance, 401k with company match, paid parental leave, life insurance, pre-tax Transit Benefit Program, casual work environment, weekly team lunches, company outings, and a convenient River North location close to public transit.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://sertifi.applytojob.com/apply/1seCsRym85/Senior-Software-Developer?source=Github\"\u003ehttps://sertifi.applytojob.com/apply/1seCsRym85/Senior-Software-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"aa48ee67-6f39-47ae-b1d0-0bcabcbfac6f","type":"Full Time","url":"https://jobs.github.com/positions/aa48ee67-6f39-47ae-b1d0-0bcabcbfac6f","created_at":"Mon Oct 21 09:43:20 UTC 2019","company":"Shell","company_url":"http://www.shell.com","location":"London","title":"DevOps Engineer","description":"\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAn exciting opportunity to join a dynamic, innovative team, working on cutting edge technology. Bring your technical engineering expertise and we’ll give you every opportunity to enhance and grow your professional experience.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhere you fit\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a chance to join one of our new innovation hubs at Shell, bringing your talent and excellent communication skills to a role as DevOps Engineer.\u003c/p\u003e\n\u003cp\u003eAt Shell’s Agile Hub, we’re taking pride in doing things differently – by taking a unique approach of balancing human-centred and digital design with an agile technology capability to tackle complex problems in original ways.\u003c/p\u003e\n\u003cp\u003eJoining a proactive team of engineers, and with a huge variety of potential projects to grow across the business, you’ll be challenged to think innovatively, with many different areas to investigate.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s the role?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs DevOps Engineer, you’ll thrive on working smart, as you build environments for Agile projects, always on the lookout for opportunities and remaining continually curious as to why things happen.\u003c/p\u003e\n\u003cp\u003eYour responsibilities will be wide-ranging, from responding to and fixing issues of all sizes and prevent them from happening again, to working with subject matter experts to learn new skills and integrate them into team learnings. Other duties will include:\u003c/p\u003e\n\u003cp\u003eDeveloping alerts to improve our monitoring.\nCo-ordinating incidents, including alerts to other engineering teams.\nWriting and refining troubleshooting guides and documentation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we need from you\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re keen to hear from men and women with DevOps Engineering experience, relevant expertise as a developer, a strong background in Linux as well as strong Kubernetes experience. Plus, we’d also hope to see as many of the following on your CV:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience of Agile and/or DAD (Scrum \u0026amp; Kanban), plus experience using Docker and programming in Hashicorp Terraform, Bash, Python and Ansible.\u003c/li\u003e\n\u003cli\u003eStrong experience of Kubernetes in building environments from scratch, preferably over PaaS. Exposure to Kops, Kubespray and Kubeadm is also advantageous\u003c/li\u003e\n\u003cli\u003eAn understanding of Microservice based Architecture.\u003c/li\u003e\n\u003cli\u003eAn ability to implement infrastructure as code.\u003c/li\u003e\n\u003cli\u003eA strong understanding of web server application design.\u003c/li\u003e\n\u003cli\u003eAn understanding of application security and information security controls.\u003c/li\u003e\n\u003cli\u003eData Science platform experience, plus monitoring and logging platforms, will be an advantage.\u003c/li\u003e\n\u003cli\u003eKnowledge of configuration management tools.\u003c/li\u003e\n\u003cli\u003eExperience in Javascript development and mobile app development is also desirable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAn innovative place to work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThere’s never been a more exciting time to work at Shell. Everyone here is helping solve one of the biggest challenges facing the world today: bringing the benefits of energy to everyone on the planet, whilst managing the risks of climate change.\u003c/p\u003e\n\u003cp\u003eJoin us and you’ll add your talent and imagination to a business with the power to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAn inclusive place to work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTo power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential…\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re creating a space where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply and we’ll take it from there.\u003c/li\u003e\n\u003cli\u003eWe’re closing the gender gap – whether that’s through action on equal pay or by enabling more women to reach senior roles in engineering and technology.\u003c/li\u003e\n\u003cli\u003eWe’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity.\u003c/li\u003e\n\u003cli\u003eWe consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA rewarding place to work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCombine our creative, collaborative environment and global operations with an impressive range of benefits and joining Shell becomes an inspired career choice.\u003c/p\u003e\n\u003cp\u003eWe’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePlease apply via the \u003ca href=\"https://shellinternational.redirect.your-jobresponse.com/devops_engineer_london/257033/V819/apply\"\u003eLink!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompany Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eShell started operations in the United Kingdom more than 110 years ago. Since then we have grown into a leading innovative oil and gas company that rewards its employees by investing heavily in their careers and learning. Our people are our greatest asset, and our commitment to your career will see you thrive in a work environment that offers an industry-leading development programme. When your ideas travel, Shell will benefit and innovation will thrive. Shell has a key role to play in helping meet the UK’s growing energy demand, whilst using innovative technologies to develop cleaner energy. We are the largest FTSE 100 company in the UK by market capitalisation, and make a significant contribution to the UK economy. As well as processing 35% of the gas coming into the UK, we serve more than four million customers at our filling stations each week. Shell employs some 6,400 skilled staff as well as many contractors.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDisclaimer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePlease note: We occasionally amend or withdraw Shell jobs and reserve the right to do so at any time, including prior to the advertised closing date.\u003c/p\u003e\n\u003cp\u003eBefore applying, you are advised to read our data protection policy. This policy describes the processing that may be associated with your personal data and informs you that your personal data may be transferred to Royal Dutch/Shell Group companies around the world.\u003c/p\u003e\n\u003cp\u003eThe Shell Group and its approved recruitment consultants will never ask you for a fee to process or consider your application for a career with Shell. Anyone who demands such a fee is not an authorised Shell representative and you are strongly advised to refuse any such demand.\u003c/p\u003e\n\u003cp\u003eShell is an Equal Opportunity Employer.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://shellinternational.redirect.your-jobresponse.com/devops_engineer_london/257033/V819/apply\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVYxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c806040709f9612a77ec8495d56fc50c6a08769/shell_logo.jpg"},{"id":"d81e897e-0bc7-4013-81b9-85c35cb96f57","type":"Full Time","url":"https://jobs.github.com/positions/d81e897e-0bc7-4013-81b9-85c35cb96f57","created_at":"Mon Oct 21 08:14:49 UTC 2019","company":"AJ Madison","company_url":"http://www.ajmadison.com/","location":"Brooklyn, United States","title":"Senior Full Stack Engineer","description":"\u003cp\u003e\u003cstrong\u003eSenior Full Stack Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAJ Madison is looking for a \u003cstrong\u003eSenior / Lead Full Stack Engineer\u003c/strong\u003e who’s a true technophile, an independent thinker, and a strong team player to lead our web engineering team.\u003c/p\u003e\n\u003cp\u003eThis is a critical leadership position.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesigning and developing systems and applications, making specific determinations about system performance.\u003c/li\u003e\n\u003cli\u003eDesign and develop fault-tolerant scalable systems.\u003c/li\u003e\n\u003cli\u003eDesigning and developing next-gen architecture (web, mobile etc.).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAJ Madison prides itself on its innovative and knowledgeable staff. Our team members are not just sales associates; they are passionate chefs, laundry enthusiasts, and design aficionados. Our mission is to leverage the unique talents and passions of our employees to inspire, delight, and enrich the lives of each of our customers. Through the usage of the latest technology, product knowledge and passion for the industry, we at AJ Madison have been successful at providing the best experience possible for each of customers. If you have a passion and curiosity for what is possible and enjoy people, we invite you to join us on our mission.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll Do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on a cross-functional team of other engineers (frontend, backend, and full stack), a Product Manager and a Designer.\u003c/li\u003e\n\u003cli\u003eWork on our production application – a PHP and MySql app with React/Redux on the frontend.\u003c/li\u003e\n\u003cli\u003eShip new experiences to our customers via A/B tests.\u003c/li\u003e\n\u003cli\u003eDeploy to code to production multiple times a day.\u003c/li\u003e\n\u003cli\u003eHelp us figure out engineering solutions that give 80% of the benefit with 20% of the work.\u003c/li\u003e\n\u003cli\u003eWrite automated functional and unit tests.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou..\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave at least 7+ years of full stack experience. Minimum 3 years' experience developing rich, large-scale web applications (prerebaly ecommerce applications).\u003c/li\u003e\n\u003cli\u003eHave seen what works well and what doesn’t work well in frontend and backend codebases.\u003c/li\u003e\n\u003cli\u003eAre an expert in one server language, (preferably PHP), Javascript and one frontend framework (preferably React).\u003c/li\u003e\n\u003cli\u003eLike being part of a small team composed of UX designers, product managers, frontend/backend/full stack engineers.\u003c/li\u003e\n\u003cli\u003eAre excited to teach and learn from those around you.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe..\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAre a collaborative \u0026amp; close-knit team: our team is Brooklyn-based and in the office because as great as technology is, there are few substitutes for in-person collaboration.\u003c/li\u003e\n\u003cli\u003eTake pride in our work and shares responsibility to see it through from conception to deployment to fixing bugs.\u003c/li\u003e\n\u003cli\u003eCan offer you top of the line equipment: your choice of hardware, standing desks, two 4K monitors, and more.\u003c/li\u003e\n\u003cli\u003eOffer a competitive compensation and benefits package.\u003c/li\u003e\n\u003cli\u003eValue honesty, transparency and respect.\u003c/li\u003e\n\u003cli\u003eAre excited to hear from you.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\nYou can apply via the \u003cstrong\u003e\u003ca href=\"https://ltpx.nl/fgo0SPv\"\u003eonline application form\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/e9e77d07fd62365f2656c61b71c8008857375719/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313238353835\"\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUIxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--66c8eeb0ee9cff41bdaca7be154ae35fc4b81e5e/LogoAJMadison.jpg"},{"id":"25f23b53-161e-4dcb-9c21-a0131784412d","type":"Full Time","url":"https://jobs.github.com/positions/25f23b53-161e-4dcb-9c21-a0131784412d","created_at":"Fri Oct 18 15:07:46 UTC 2019","company":"BASF SE","company_url":"http://on.basf.com/BASFSE","location":"Ludwigshafen","title":"IT-Architekt_in in der Digitalisierung (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eEinsatzgebiet:\u003c/strong\u003e IT / Informationsmanagement\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eStandort:\u003c/strong\u003e Ludwigshafen, DE\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFirma:\u003c/strong\u003e BASF SE\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVertragsart:\u003c/strong\u003e Unbefristet\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReferenzcode:\u003c/strong\u003e DE58016582_DIGI4_2\u003c/p\u003e\n\u003cp\u003eWir sind das führende Chemieunternehmen der Welt, weil wir intelligente Lösungen bieten - für unsere Kunden und für eine nachhaltige Zukunft. Dazu vernetzen und fördern wir Menschen mit den unterschiedlichsten Talenten - weltweit. Das eröffnet Ihnen vielfältige Entwicklungschancen. Bei uns zählt Ihre Leistung ebenso wie Ihre Persönlichkeit, unabhängig von Alter, Herkunft, Geschlecht, sexueller Identität, Behinderung oder Weltanschauung. So werden aus Chancen Karrieren. Bei BASF.\u003c/p\u003e\n\u003cp\u003eLudwigshafen ist der weltweit größte Standort und Sitz der Konzernzentrale. Das Herz der BASF liegt gleichzeitig im Herzen der europäischen Metropolregion Rhein-Neckar. Hier erwartet Sie beruflich sowie in Ihrer Freizeit ein attraktives Umfeld.\u003c/p\u003e\n\u003cp\u003eMehr über die BASF SE erfahren Sie unter: \u003ca href=\"http://on.basf.com/BASFSE\"\u003ehttp://on.basf.com/BASFSE\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eWas Sie erwartet\u003c/h2\u003e\n\u003cp\u003eVon Ludwigshafen aus treibt unser interdisziplinäres Team die digitale Transformation europaweit an drei Standorten (Ludwigshafen, Schwarzheide und Antwerpen) voran. Dazu verwenden wir ein breites Spektrum moderner Methoden aus agiler Softwareentwicklung, Cloud Computing, IoT, Data Science und Machine Learning, wobei wir auf flache Hierarchien setzen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAls hochmotivierte_r IT-Architekt_in begleiten Sie Digitalisierungsprojekte von der Ideenfindung über erste Prototypen bis hin zur Inbetriebnahme.\u003c/li\u003e\n\u003cli\u003eSie unterstützen die Technologieentwicklung, begleiten den Roll-Out sowie den Betrieb digitaler Produkte.\u003c/li\u003e\n\u003cli\u003eDabei bewegen Sie sich in einem fach- und einheitsübergreifenden Expertennetzwerk und kooperieren eng mit unseren Kunden in Produktion, Infrastruktur und Logistik.\u003c/li\u003e\n\u003cli\u003eSie erfassen technische, operative und wirtschaftliche Anforderungen an unsere IT-Infrastruktur. Darauf aufbauend beurteilen, entwickeln und implementieren Sie zukunftsfähige Architektur für Industrie 4.0- und Digitalisierungsanwendungen.\u003c/li\u003e\n\u003cli\u003eSie bringen Ihre Kreativität ein, um die Digitalisierung der BASF durch neue IT-Technologien voranzubringen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWas wir erwarten\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eIhr Master- oder Diplomstudium in Informatik, Nachrichten-, Elektro-, Informations- bzw. Automatisierungstechnik oder einer vergleichbaren Disziplin haben Sie überdurchschnittlich abgeschlossen.\u003c/li\u003e\n\u003cli\u003eDarüber hinaus haben Sie langjährige Erfahrung mit dem Entwurf, der Entwicklung und dem Betrieb komplexer heterogener IT-Systeme.\u003c/li\u003e\n\u003cli\u003eSie verfügen über fundierte Kenntnisse im Bereich SQL- sowie NoSQL-Datenbanken und sind sicher in Python, Java, C/C++, JavaScript oder einer vergleichbaren Programmiersprache.\u003c/li\u003e\n\u003cli\u003eKenntnisse im Bereich moderner Kommunikationsprotokolle, -dienste und -technologien in den Bereichen IoT, Cloud Computing und Industrie 4.0 sind von Vorteil, ebenso wie Erfahrungen mit agilen Methoden und DevOps-Ansätzen.\u003c/li\u003e\n\u003cli\u003eNicht zuletzt sind am digitalen Puls der Zeit, haben Spaß daran etwas zu bewegen und wollen greifbare Ergebnisse schaffen, die direkt bei Kunden und Partnern eingesetzt werden.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWir bieten\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEin anspruchsvolles Aufgabengebiet mit hoher Eigenverantwortung. Ihre Einarbeitung erfolgt \"on the job\" in einem engagierten, kompetenten Team.\u003c/li\u003e\n\u003cli\u003eUnterstützung unserer Mitarbeiterinnen und Mitarbeiter mit unterschiedlichen Maßnahmen bei der Vereinbarkeit von Beruf und Privatleben.\u003c/li\u003e\n\u003cli\u003eAttraktive Vergütung einschließlich betrieblicher Sozialleistungen sowie hervorragende Entwicklungschancen in einem internationalen Unternehmen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInteressiert?\u003c/h2\u003e\n\u003cp\u003eWir freuen uns auf Ihre Bewerbung über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://basfse.redirect.your-jobresponse.com/it_architekt_in_in_der_digitalisierung_m_w_d_ludwigshafen/255073/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWerden Sie Teil des besten Teams mit einem Netzwerk von mehr als 110.000 Mitarbeitern weltweit. Entdecken Sie Ihre Karriere bei BASF auf on.basf.com/meinekarriere.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://basfse.redirect.your-jobresponse.com/it_architekt_in_in_der_digitalisierung_m_w_d_ludwigshafen/255073/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHgxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f00314e79be775c3b681144f69155385762028ae/Basf.jpg"},{"id":"db868fae-b183-4585-ba44-edd0f8d5ef20","type":"Full Time","url":"https://jobs.github.com/positions/db868fae-b183-4585-ba44-edd0f8d5ef20","created_at":"Fri Oct 18 13:59:49 UTC 2019","company":"BASF SE","company_url":"http://on.basf.com/meinekarriere","location":"Ludwigshafen","title":"Softwareentwickler_in in der Digitalisierung (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eEinsatzgebiet:\u003c/strong\u003e IT / Informationsmanagement\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eStandort:\u003c/strong\u003e Ludwigshafen, DE\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFirma:\u003c/strong\u003e_ BASF SE\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVertragsart:\u003c/strong\u003e Unbefristet\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReferenzcode:\u003c/strong\u003e DE58016567_DIGI4_2\u003c/p\u003e\n\u003cp\u003eWir sind das führende Chemieunternehmen der Welt, weil wir intelligente Lösungen bieten - für unsere Kunden und für eine nachhaltige Zukunft. Dazu vernetzen und fördern wir Menschen mit den unterschiedlichsten Talenten - weltweit. Das eröffnet Ihnen vielfältige Entwicklungschancen. Bei uns zählt Ihre Leistung ebenso wie Ihre Persönlichkeit, unabhängig von Alter, Herkunft, Geschlecht, sexueller Identität, Behinderung oder Weltanschauung. So werden aus Chancen Karrieren. Bei BASF.\u003c/p\u003e\n\u003cp\u003eLudwigshafen ist der weltweit größte Standort und Sitz der Konzernzentrale. Das Herz der BASF liegt gleichzeitig im Herzen der europäischen Metropolregion Rhein-Neckar. Hier erwartet Sie beruflich sowie in Ihrer Freizeit ein attraktives Umfeld.\u003c/p\u003e\n\u003cp\u003eMehr über die BASF SE erfahren Sie unter: \u003ca href=\"http://on.basf.com/BASFSE\"\u003ehttp://on.basf.com/BASFSE\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eWas Sie erwartet\u003c/h2\u003e\n\u003cp\u003eVon Ludwigshafen aus treibt unser interdisziplinäres Team die digitale Transformation europaweit an drei Standorten (Ludwigshafen, Schwarzheide und Antwerpen) voran. Dazu verwenden wir ein breites Spektrum moderner Methoden aus agiler Softwareentwicklung, Cloud Computing, IoT, Data Science und Machine Learning, wobei wir auf flache Hierarchien setzen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAls hochmotivierte_r Softwareentwickler_in begleiten Sie Digitalisierungsprojekte von der Ideenfindung über erste Prototypen bis hin zur Inbetriebnahme und betreuen die entwickelten Lösungen im laufenden Einsatz.\u003c/li\u003e\n\u003cli\u003eZudem konzipieren und implementieren Sie verschiedenste IT-Lösungen, z. B. intelligente Assistenzsysteme, Web-Applikationen oder Microservices, die eine zentrale Rolle in der digitalen Transformation spielen.\u003c/li\u003e\n\u003cli\u003eDabei bewegen Sie sich in einem fach- und einheitsübergreifenden Expertennetzwerk und kooperieren eng mit unseren Kunden in Produktion, Infrastruktur und Logistik.\u003c/li\u003e\n\u003cli\u003eSie bringen ihre Kreativität ein, um die Digitalisierung der BASF durch neue Technologien voranzubringen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWas wir erwarten\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eIhr Master- oder Diplomstudium in Informatik, Naturwissenschaften, angewandter Mathematik, Ingenieurwesen oder einer vergleichbaren Disziplin haben Sie überdurchschnittlich abgeschlossen.\u003c/li\u003e\n\u003cli\u003eSie verfügen über fundierte Kenntnisse in Python, R, Java, JavaScript, SQL oder einer vergleichbaren Sprache und haben Erfahrung mit der Entwicklung komplexer Software.\u003c/li\u003e\n\u003cli\u003eZudem haben Sie Kenntnisse in der Entwicklung von Webanwendungen, REST APIs und Microservices. Von Vorteil sind Erfahrungen mit High-Performance- und Cloud-Computing (AWS, Azure).\u003c/li\u003e\n\u003cli\u003eErfahrungen mit agilen Methoden (Scrum, Kanban) sowie DevOps-Elementen (z.B. unit tests, Versionskontrolle, CI/CD, Container-Virtualisierung) sind von Vorteil.\u003c/li\u003e\n\u003cli\u003eNicht zuletzt sind Sie am digitalen Puls der Zeit, haben Spaß daran etwas zu bewegen und wollen greifbare Ergebnisse schaffen, die direkt bei Kunden und Partnern eingesetzt werden.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWir bieten\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEin anspruchsvolles Aufgabengebiet mit hoher Eigenverantwortung. Ihre Einarbeitung erfolgt \"on the job\" in einem engagierten, kompetenten Team.\u003c/li\u003e\n\u003cli\u003eUnterstützung unserer Mitarbeiterinnen und Mitarbeiter mit unterschiedlichen Maßnahmen bei der Vereinbarkeit von Beruf und Privatleben.\u003c/li\u003e\n\u003cli\u003eAttraktive Vergütung einschließlich betrieblicher Sozialleistungen sowie hervorragende Entwicklungschancen in einem internationalen Unternehmen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInteressiert?\u003c/h2\u003e\n\u003cp\u003eWir freuen uns auf Ihre Bewerbung über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://basfse.redirect.your-jobresponse.com/softwareentwickler_in_in_der_digitalisierung_m_w_d_ludwigshafen/255079/V819/anwenden\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWerden Sie Teil des besten Teams mit einem Netzwerk von mehr als 110.000 Mitarbeitern weltweit. Entdecken Sie Ihre Karriere bei BASF über den Bewerben-Button oder auf on.basf.com/meinekarriere.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://basfse.redirect.your-jobresponse.com/softwareentwickler_in_in_der_digitalisierung_m_w_d_ludwigshafen/255079/V819/anwenden\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHAxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b6c6b46e86585fcdeaa007796f4b723fc0dc4505/Basf.jpg"},{"id":"72a7d943-8c12-4fb1-8822-9379471472ba","type":"Full Time","url":"https://jobs.github.com/positions/72a7d943-8c12-4fb1-8822-9379471472ba","created_at":"Fri Oct 18 12:04:43 UTC 2019","company":"Kognition, LLC","company_url":"https://www.kognition.ai","location":"Philadelphia, PA","title":"Senior Software Engineer","description":"\u003cp\u003e\u003cstrong\u003ePosition Summary:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKognition is an enterprise software company that develops an interoperability infrastructure for smart buildings and smart cities.  Kognition provides an AI-powered, real-time policy engine for automated operations.  We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R\u0026amp;D team.  We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!\u003c/p\u003e\n\u003cp\u003eAs a Senior Software Engineer, you will be a key part of our research and development team that builds our core products. You will design, develop, document, test and debug software applications and services. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMinimum Job Qualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEducation/Training :\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBusiness Experience:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience in software engineering\u003c/li\u003e\n\u003cli\u003eCritical Skills\u003c/li\u003e\n\u003cli\u003eStrong application design skills and understanding of enterprise software design patterns\u003c/li\u003e\n\u003cli\u003eThorough understanding and experience working with both functional and object oriented programming languages and paradigms such as Java, C++, and Rust\u003c/li\u003e\n\u003cli\u003eThorough understanding and experience working with scripts and scripting languages such as (e.g. Bash, Python)\u003c/li\u003e\n\u003cli\u003eExperience working with containers and container orchestration systems (e.g. Docker, Kubernetes, DC/OS, Nomad)\u003c/li\u003e\n\u003cli\u003eExperience developing highly available, highly scalable web applications\u003c/li\u003e\n\u003cli\u003eExperience building and integrating RESTful APIs\u003c/li\u003e\n\u003cli\u003eExperience with real-time pub/sub, flow, and streaming frameworks (e.g. Kafka, NiFi)\u003c/li\u003e\n\u003cli\u003eExperience with NoSQL databases (e.g. MongoDB, Cassandra)\u003c/li\u003e\n\u003cli\u003eExperience working with various testing methodologies, including test-driven development (TDD), -behavior-driven development (BDD), and unit testing\u003c/li\u003e\n\u003cli\u003eExperience with performance-monitoring and tuning of complex applications\u003c/li\u003e\n\u003cli\u003eExperience deploying, managing, and configuring applications both on-prem and in-cloud (AWS, Google Cloud, Azure)\u003c/li\u003e\n\u003cli\u003eSolid understanding of the Software Development Life Cycle in Agile environment (e.g. Kanban, Scrum)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with machine vision (i.e. openCV)\u003c/li\u003e\n\u003cli\u003eExperience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)\u003c/li\u003e\n\u003cli\u003eExperience working with deep net frameworks (e.g. Tensorflow, Torch, mxnet, gluon)\u003c/li\u003e\n\u003cli\u003eExperience working with native code in non-native languages (e.g. JNA, JNI, DllImport)\u003c/li\u003e\n\u003cli\u003eSecurity industry experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional Specialized Knowledge/Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for cutting-edge software design and development\u003c/li\u003e\n\u003cli\u003eHighly motivated and self-directed\u003c/li\u003e\n\u003cli\u003eExcellent written and oral communication skills\u003c/li\u003e\n\u003cli\u003eKeen attention to detail\u003c/li\u003e\n\u003cli\u003eProven analytical, evaluative, and problem-solving abilities\u003c/li\u003e\n\u003cli\u003eAbility to effectively prioritize and execute tasks in a high-pressure environment\u003c/li\u003e\n\u003cli\u003eExceptional customer service orientation\u003c/li\u003e\n\u003cli\u003eExtensive experience working in a team-oriented, collaborative environment\u003c/li\u003e\n\u003cli\u003eWillingness to mentor and train junior developers\u003c/li\u003e\n\u003cli\u003eWillingness to support resolution of escalated technical support issues\u003c/li\u003e\n\u003cli\u003eWillingness to travel to client locations is preferred\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWork Location:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePosition located in our Philadelphia, PA office (between Ivy Ridge and Manayunk).\u003c/li\u003e\n\u003cli\u003eWFH flexibility with a focus on in-office availability.\u003c/li\u003e\n\u003cli\u003eGeneral Office, Travel less than 10%.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:jobs@kognition.ai\"\u003ejobs@kognition.ai\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFYxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a5e84425548e238ce5857ce86b623ecf545e7c0a/kognition-logo-no-tagline.png"},{"id":"eeb8a550-a0db-4a86-b10e-6b38cd876820","type":"Full Time","url":"https://jobs.github.com/positions/eeb8a550-a0db-4a86-b10e-6b38cd876820","created_at":"Fri Oct 18 12:03:37 UTC 2019","company":"DKV Euro Service GmbH + Co. KG","company_url":"http://www.dkv-euroservice.com/de","location":"Ratingen bei Düsseldorf","title":"Operator Web Services (m/w/d)","description":"\u003cp\u003eFuhrparks in über 40 Ländern verlassen sich auf unsere smarten und zukunftsweisenden Mobilitätslösungen. Werden Sie Teil eines engagierten und begeisterten Teams, das die gewerbliche Mobilität von morgen europaweit mitgestaltet.\u003c/p\u003e\n\u003ch2\u003eNehmen Sie Einfluss\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eVerantwortung des Betriebs einer umfangreichen Serverlandschaft mit diversen Webanwendungen\u003c/li\u003e\n\u003cli\u003eWartung und Optimierung der existierenden Systemlandschaft und Konfiguration\u003c/li\u003e\n\u003cli\u003eAusweitung des Monitorings\u003c/li\u003e\n\u003cli\u003eWeiterentwicklung der Betriebs-relevanten Prozesse\u003c/li\u003e\n\u003cli\u003e2nd Level Support\u003c/li\u003e\n\u003cli\u003ePlanung und Durchführung von Deployments in Zusammenarbeit mit dem Entwicklungsteam\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDas macht Sie aus\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMehrjährige Erfahrungen im Bereich Konzeption, Setup, Konfiguration und Tuning von WebanwendungsBetriebsumgebungen auf Basis der folgenden Technologien und Konzepte:\u003c/li\u003e\n\u003cli\u003eAdministration von Linux-Systemen (optimal: Ubuntu)\u003c/li\u003e\n\u003cli\u003eAdministration von Java-Webanwendungen\u003c/li\u003e\n\u003cli\u003eErfahrung in den Bereichen Load-Balancing, Ausfallsicherheit, Resilienz, Monitoring-Integration\u003c/li\u003e\n\u003cli\u003eOptimalerweise Erfahrung mit Produkten wie: Liferay, Tomcat, WildFly, Apache HTTPD, Mule ESB\u003c/li\u003e\n\u003cli\u003eSelbständige Arbeitsweise, Teamfähigkeit und Kommunikationsfähigkeit\u003c/li\u003e\n\u003cli\u003eGute Englischkenntnisse\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDavon werden Sie profitieren\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eBei uns finden Sie beste Voraussetzungen, um Zukunft zu gestalten. Unser internationales Team widmet sich mit Drive neuen Herausforderungen. Sie finden bei uns\u003c/li\u003e\n\u003cli\u003eFreiraum für eigene Ideen,\u003c/li\u003e\n\u003cli\u003eflexible Arbeitszeiten mit Home-Office und Gleitzeit,\u003c/li\u003e\n\u003cli\u003eNew Work Umgebung\u003c/li\u003e\n\u003cli\u003eModerne IT Infrastruktur\u003c/li\u003e\n\u003cli\u003eeine attraktive Vergütung mit leistungsgerechter Boni,\u003c/li\u003e\n\u003cli\u003eMöglichkeiten zur Weiterentwicklung DKV Euro Service\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInteressiert?\u003c/h2\u003e\n\u003cp\u003eWir freuen uns auf Ihre Bewerbung über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003eFür Ihre Rückfragen steht Ihnen Lisa Pieper unter +49 2102 5517- 204 zur Verfügung.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://dkv.redirect.your-jobresponse.com/operator_web_services_m_w_d_ratingen_bei_duesseldorf/256885/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eDKV Euro Service - DKV MOBILITY SERVICES Group\u003c/h2\u003e\n\u003cp\u003eAls führender europäischer Mobilitätsdienstleister widmen wir uns effizienten Mobilitätslösungen zur Steuerung gewerblicher Fuhrparks und bringen Digitalisierung auf die Straße. Zu unserem Portfolio gehören smarte Produkte und Dienstleistungen rund ums Tanken, alternative Antriebsarten, Mautabwicklung, Liquiditätsvorteile und innovative vernetzte Services. In unserem Know-how steckt die Kompetenz von mehr als 1.000 Mitarbeiterinnen und Mitarbeitern in 13 Ländern. Der DKV Euro Service ist Teil der DKV MOBILITY SERVICES Group, die 2018 einen Umsatz von 8,6 Milliarden Euro erwirtschaftete. Mit vier Gruppenunternehmen gestalten wir erfolgreich Mobilität: DKV Euro Service, REMOBIS Refund Service, LUNADIS und DKV MOBILITY SERVICES Business Center.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://dkv.redirect.your-jobresponse.com/operator_web_services_m_w_d_ratingen_bei_duesseldorf/256885/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEoxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--faa0b736a80ebcc48e69c5ae5da8ae281f91f391/DKV%20.jpg"},{"id":"df799d54-3192-47c2-bd8a-b35d6dc777ee","type":"Full Time","url":"https://jobs.github.com/positions/df799d54-3192-47c2-bd8a-b35d6dc777ee","created_at":"Fri Oct 18 09:58:03 UTC 2019","company":"Ferryscanner","company_url":"https://www.ferryscanner.com/en/ferry","location":"Athens","title":"Senior Frontend Developer at Ferryscanner","description":"\u003cp\u003e\u003cstrong\u003eSenior Front-end Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you passionate about front-end technologies? Is javascript your middle name? Does the idea of working for a cool online company fascinate you?\u003c/p\u003e\n\u003cp\u003eWell, then this role was made for you! So, get ready to join our passionate and experienced team and work in our modern offices in the heart of Athens!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKey responsibilities\u003c/strong\u003e\nAs a Senior Front-End Developer, your main responsibility will be to implement and optimize front-end interfaces.\nMore specifically, you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild elegant, highly responsive front-end interfaces for ferryscanner.com website, on Rails and ReactJS stack. However, keep in mind we're not married to any framework!\u003c/li\u003e\n\u003cli\u003eIdentify and address user experience bottlenecks.\u003c/li\u003e\n\u003cli\u003eParticipate in design and code reviews.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAttractive Remuneration Package.\u003c/li\u003e\n\u003cli\u003ePrivate medical insurance.\u003c/li\u003e\n\u003cli\u003eWork in an international, dynamic and fun atmosphere among young and smart people.\u003c/li\u003e\n\u003cli\u003eHuge learning experience in using best practices and cutting-edge technologies.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequired skills \u0026amp; knowledge\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMinimum 5 years' working experience in software development, at least 3 years of which, in javascript.\u003c/li\u003e\n\u003cli\u003eFamiliarity in front-end technologies e.g.React, MobX, ES6, Sass, Webpack.\u003c/li\u003e\n\u003cli\u003eExperience translating visual designs into code.\u003c/li\u003e\n\u003cli\u003eUnderstanding of good Design practices and capability to suggest design improvements.\u003c/li\u003e\n\u003cli\u003eExperience with unit and integration testing.\u003c/li\u003e\n\u003cli\u003eA detail-oriented approach and a desire to strive for perfection.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired skills \u0026amp; knowledge\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBasic knowledge of Ruby / Ruby on Rails is a plus.\u003c/li\u003e\n\u003cli\u003eScaling front-end engineering through design systems and tooling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications \u0026amp; key competencies\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUniversity or College Degree in Computer Science.\u003c/li\u003e\n\u003cli\u003eExcellent command of English, both written and oral.\u003c/li\u003e\n\u003cli\u003eTeam spirit and excellent communication skills.\u003c/li\u003e\n\u003cli\u003ePassionate about web-related technologies.\u003c/li\u003e\n\u003cli\u003eDiscipline, Diligence, Accountability.\u003c/li\u003e\n\u003cli\u003e'Out of the box' thinking.\u003c/li\u003e\n\u003cli\u003eDesire for continuous learning and skills improvement.\u003c/li\u003e\n\u003cli\u003eFulfilled military obligations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\nApply now via the \u003ca href=\"https://ltpx.nl/hJsslsc\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisition is not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/6a2a951707a1fdf8fa855bd4bb5179b83021b8e2/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313238323831\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/veDVsX9\"\u003e\u003cstrong\u003eApply now\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzExIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9f12a4f9327bdf18ff1f5a9dfa4900ea409bf7f2/Company%20logo.png"},{"id":"d7352c67-72e0-4ca7-bde1-8b4a684787be","type":"Full Time","url":"https://jobs.github.com/positions/d7352c67-72e0-4ca7-bde1-8b4a684787be","created_at":"Thu Oct 17 13:16:31 UTC 2019","company":"PENTASYS AG","company_url":"http://karrierewelt.pentasys.de","location":"Frankfurt (Main)","title":"Softwareentwickler (m/w/d) Java/JEE","description":"\u003cp\u003eSoftwareentwickler (m/w/d) Java/JEE\nfür kundenspezifische Softwarelösungen\u003c/p\u003e\n\u003cp\u003eStandort: Frankfurt am Main, München,\nNürnberg, Stuttgart, Hamburg, Düsseldorf\u003c/p\u003e\n\u003cp\u003eStart: ab sofort\u003c/p\u003e\n\u003cp\u003eWir sind PENTASYS\u003c/p\u003e\n\u003cp\u003eWir optimieren Geschäftsprozesse durch smarte IT-Lösungen – seit über 20 Jahren.\nDie Büros: Haupsitz München, weitere in Frankfurt a. M., Nürnberg, Düsseldorf, Stuttgart und Hamburg.\nDas Gute: Unsere Projekte werden immer vielzähliger. Und vielfältiger.\nDas Beste: Unsere 400 Mitarbeiter.\u003c/p\u003e\n\u003cp\u003eUnser Ziel\u003c/p\u003e\n\u003cp\u003eViele neue Kolleginnen und Kollegen für unsere Entwickler­teams. Wir suchen Java-Entwickler für kunden­spezifische Entwicklungs­projekte. Vom Berufsanfänger bis zum Profi. Denn wir haben eine Menge Projekte zu realisieren. Freiraum? Bekommen Sie. Karriere­möglich­keiten? Haben Sie.\u003c/p\u003e\n\u003cp\u003eIhre Aufgaben als JAVA- / JEE-Entwickler\u003c/p\u003e\n\u003cp\u003eMit Spaß an der Arbeit herausragende Software für den Kunden entwickeln. Sie entwickeln leiden­schaftlich gerne Software und implementieren maßgeschneiderte JEE-Applikationen bei unseren Kunden. Dabei greifen Sie bspw. auf Technologien wie JSF und JPA zurück. Ihre Ergeb­nisse versionieren Sie im Team z. B. mit Git oder SVN und bauen komplette Softwarepakete mit Gradle oder Maven. Test­getriebene Entwicklung gehört für Sie ebenfalls zum guten Ton.\u003c/p\u003e\n\u003cp\u003eUnsere Projekt­vielfalt\u003c/p\u003e\n\u003cp\u003eNiemand kennt oder kann alles – Was Sie noch nicht kennen, lernen Sie bei uns. Als Teil unserer Entwicklerteams bauen Sie benutzerfreundliche Web-Applikationen durch moderne Webtechnologien wie HTML5 und CSS3 sowie JavaScript Frameworks wie Angular und React. Sie bauen REST-Schnittstellen mit Spring Boot, Spring oder Node.js und verwenden dazu Web- oder Application Server wie Apache Tomcat, Wildfly, Geronimo oder Nginx. Dabei setzen Sie Ihre Kenntnisse in der objektorientierten Programmierung ein und nutzen Entwicklungsumgebungen wie IntelliJ oder Eclipse. Die Anwendungen werden gekapselt in Docker-Container verteilt und mit Kubernetes konfiguriert. Diese Anwendungen laufen dann je nach Projektumfeld auf virtuellen Maschinen oder modernen Cloud-Plattformen wie Amazon AWS, Microsoft Azure oder Cloud Foundry. Wir begleiten Sie bei Ihrem Weg zum und durch den agilen Prozess, nach SCRUM oder Kanban. Zusätzlich zu unserer Projektvielfalt haben Sie durch unsere internen und externen Workshops die Möglichkeit, sich in diesen und vielen anderen Themen kontinuierlich weiterzuentwickeln.\u003c/p\u003e\n\u003cp\u003eUnser Angebot: Perspektiven für Entwickler\u003c/p\u003e\n\u003cp\u003eEntwicklung: Fachliche und persönliche Weiterentwicklung ist das A und O. Wir bieten Ihnen technologische, methodische und soziale Weiter­bildungen an. Von Profis. Für Profis.\nFreiheiten: Flexible Arbeitszeiten, Sabbatical, individuelle Karriere­gestaltung.\nFinanzen: Erfolgsbeteiligung, Reise­prämie, Übernahme von Reisekosten in Vor­leistung, vermögenswirksame Leistungen, Buchbudget, „Pimp Your IT“-Budget.\nUmfeld: Hochqualifizierte Kollegen, moderne IT-Ausstattung und attraktive Kunden­einsätze.\nCommunity: Feste gehören zum Programm. Dazu noch interne Coding Dojos, Commities of Practice und Themenabende.\u003c/p\u003e\n\u003cp\u003eAnforderungen\u003c/p\u003e\n\u003cp\u003e(Erste) praktische Erfahrung in der Entwicklung von Java/JEE basierten Softwarelösungen und den gängigen Java-Frameworks. Dazu Kenntnisse in einer oder verschiedenen Entwicklungs­umgebungen und im Umgang mit modernen Modellierungs­werkzeugen sowie gute Deutsch­kenntnisse.\u003c/p\u003e\n\u003cp\u003eSenden Sie uns Ihre Bewer­bung über unsere Karriere­welt – und wenn alles passt: Herzlich will­kom­men im Team!\u003c/p\u003e\n\u003cp\u003eWeitere Informationen über Ihre Karriere bei PENTASYS unter:\nkarrierewelt.pentasys.de\u003c/p\u003e\n\u003cp\u003eSIE HABEN NOCH FRAGEN?\nDann rufen Sie uns bitte an.\nUnsere HR-Abteilungen in München\n089/57952-553\nund Frankfurt\n069/7079839-553\nwissen bestens Bescheid\u003c/p\u003e\n\u003cp\u003ePENTASYS AG, Rüdesheimer Straße 9, 80686 München\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSenden Sie uns Ihre Bewer­bung über unsere Karriere­welt:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://karrierewelt.pentasys.de/bewerben?bewerbung=Softwareentwickler%20%28m/w/d%29%20Java/EE%20\u0026amp;announcement=5\"\u003ehttps://karrierewelt.pentasys.de/bewerben?bewerbung=Softwareentwickler%20%28m/w/d%29%20Java/EE%20\u0026amp;announcement=5\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1YxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0a4e1085897ae256a86b2056cac23e3e900cbcf5/pentasys_logo.png"},{"id":"2d04bba5-abf7-4b1c-8b74-f267121d7fa5","type":"Full Time","url":"https://jobs.github.com/positions/2d04bba5-abf7-4b1c-8b74-f267121d7fa5","created_at":"Thu Oct 17 08:48:17 UTC 2019","company":"De Nederlandsche Bank","company_url":"http:","location":"Amsterdam","title":"SharePoint ontwikkelaar","description":"\u003cp\u003eBouw mee aan de digitale werkplek in een snel bewegende ICT omgeving als SharePoint ontwikkelaar bij DNB.\u003c/p\u003e\n\u003cp\u003eJij hebt impact\nBij DNB werk je met impact op financiële stabiliteit en duurzame welvaart. Als SharePoint ontwikkelaar geef jij vorm aan één van de belangrijkste IT-platformen van De Nederlandsche Bank. Je bouwt mee aan de digitale werkplek en het nieuwe applicatielandschap dat gebruik maakt van state-of-the-art Microsoft technologieën. Jij geeft richting aan de technologische keuzes en je draait mee in een Agile ontwikkel omgeving voor SharePoint apps en .Net applicaties en de integratie met Azure.\u003c/p\u003e\n\u003cp\u003eZo doe je dat als SharePoint ontwikkelaar bij DNB\nAls SharePoint ontwikkelaar drijf je de digitale transformatie van de organisatie. Met behulp van een moderne ontwikkelstraat in Azure DevOps help jij in het verder professionaliseren van het Agile gedachtegoed en DevOps best practices. Test-driven development, continuous integration en automated deployment zijn termen waar je dagelijks mee bezig zult zijn in combinatie met het transformatietraject waarin DNB de stap naar SharePoint Online en Office365 maakt.\u003c/p\u003e\n\u003cp\u003eJe werkt in een dynamisch Agile team samen met collega-ontwikkelaars, een scrum master en een product owner waarin je samen verantwoordelijk bent om zoveel mogelijk impact te kunnen hebben voor de organisatie. Door opleidingen, coaching en regelmatig contact met je leidinggevende werk je aan je professionele en persoonlijke ontwikkeling.\u003c/p\u003e\n\u003cp\u003eWat ga je precies doen?\u003c/p\u003e\n\u003cp\u003e• Je drijft de digitale transformatie door middel van een migratie naar de nieuwste technologieën zoals SharePoint Online, Office 365 en Azure DevOps.\u003c/p\u003e\n\u003cp\u003e• Je ontwikkelt bank brede SharePoint functionaliteiten en bouwt maatwerkapplicaties op basis van C# en gangbare web-technologieën (HTML, CSS, JavaScript). Daarbij maak je gebruikt PowerShell om deployments zoveel mogelijk te automatiseren.\u003c/p\u003e\n\u003cp\u003e• Je zet je inhoudelijke kennis in voor het concreet maken van klantwensen door middel van refinement sessies en sprint planningen.\u003c/p\u003e\n\u003cp\u003e• Je pakt ontwikkelwerkzaamheden samen op met je team, waarbij je duidelijk en open communiceert om te zorgen dat er gezamenlijk resultaat komt, maar ook bijdraagt aan een constructieve omgeving waarin iedereen met plezier kan werken.\u003c/p\u003e\n\u003cp\u003eEen dag als SharePoint ontwikkelaar\nJe start je dag met de stand-up. In de Development Community Meeting later die ochtend bespreek je met de andere developers de tech meet-up die jullie aankomende tijd organiseren. Jij doet volgende week de aftrap van de Meet-up in het auditorium. Na de lunch met je collega’s, werk je aan de backlog items van de huidige sprint, waarbij je voor complexere oplossingen veel met je collega’s spart.\nLater die middag heb je een backlog refinement sessie met je team en de product owner. Na de workshop is er duidelijkheid, zijn de prioriteiten helder en is er een juiste schatting van de backlog items. Volgende week start je met een sprintplanning waarin de doelen worden vastgesteld waar je de komende weken aan zult werken. De dag is omgevlogen en met een tevreden gevoel ga je naar huis.\u003c/p\u003e\n\u003cp\u003eDit breng je mee\nBij DNB werk je met inhoudelijke professionals. De kwaliteit van het werk van je collega’s is hoog. Daarom vinden we het belangrijk dat jij het leuk vindt om te werken aan modernisering en constante verbetering van je werkgebied. Hierbij is het van belang dat je helder communiceert, weet hoe je zaken voor elkaar krijgt en goed kunt samenwerken met je collega’s.\u003c/p\u003e\n\u003cp\u003eWaar zijn we verder nog naar op zoek?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe hebt minimaal 5 jaar ervaring met software-ontwikkeling in C# en SharePoint, met behulp van Visual Studio en TFS.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e• Je hebt ervaring met SharePoint 2013 of nieuwer, Office Patterns and Practices. Ervaring met Microsoft PLA en de laatste ontwikkelrichtlijnen is een pre.\u003c/p\u003e\n\u003cp\u003e• Je hebt ervaring met het migreren naar nieuwe versies van SharePoint. Verdere kennis van werken met vooraanstaande technologieën zoals Azure DevOps en Office365 zijn een pre.\u003c/p\u003e\n\u003cp\u003e• Je hebt ervaring met Javascript, HTML5, CSS, TypeScript. Kennis van Angular versie 2 of hoger en/of React is een pre.\u003c/p\u003e\n\u003cp\u003e• En je hebt ervaring met Agile werkvormen en het professionaliseren van een DevOps omgeving waarbij je gebruik maakt van test-driven development, deployment scripts in Powershell en continuous integration.\u003c/p\u003e\n\u003cp\u003eHier doe je dat\nDe afdeling ICT intern bedrijf is een domeinafdeling welke zich richt op applicaties, pakketten en platformen voor eindgebruikers binnen het intern bedrijf. Hierbij kun je denken aan afdelingen zoals Juridische Zaken, Communicatie, en Informatiediensten. De ambitie van de afdeling is om moderne, robuuste en kostenbewuste dienstverlening te leveren aan DNB.\u003c/p\u003e\n\u003cp\u003eJe werkt in een dynamisch Agile team van acht man die zich richt op het zoveel mogelijk waarde toevoegen voor DNB en haar eindgebruikers. Je werkt hierbij samen met gebruikers, IT Architecten en je collega’s uit de development community in een constructieve en uitdagende omgeving waarin jij jezelf persoonlijk kunt ontwikkelen op het gebied van soft skills, coaching en persoonlijk leiderschap.\u003c/p\u003e\n\u003cp\u003eDit bieden we je\nEen 36-urige werkweek met werk midden in de financiële en economische actualiteit. Bij een heel diverse, betrouwbare en maatschappelijk betrokken werkgever, die voortdurend inspeelt op de veranderende eisen van onze omgeving. En die doorlopend innoveert. Dit biedt jou volop kansen je verder te verdiepen en nieuwe ervaringen op te doen. In Nederland, maar ook daarbuiten. Je start met een jaarcontract, bij goed functioneren en wanneer de (organisatorische) omstandigheden niet wijzigen is er uitzicht op voortzetting.\u003c/p\u003e\n\u003cp\u003eDe overige goede arbeidsvoorwaarden die horen bij deze functie:\u003c/p\u003e\n\u003cp\u003e• Een salaris van minimaal € 2.800,-- en maximaal € 5.200,-- bruto per maand, op basis van een 36-urige werkweek. De uiteindelijke inschaling is onder meer afhankelijk van je kennis en ervaring.\u003c/p\u003e\n\u003cp\u003e• Een 13de maand en 8% vakantietoeslag berekend over 13 maanden.\u003c/p\u003e\n\u003cp\u003e• Pensioenopbouw op basis van middelloon met voorwaardelijke indexatie. Eigen bijdrage in de premie 6,1%.\u003c/p\u003e\n\u003cp\u003e• Een volledige vergoeding van je OV-reiskosten woon-werkverkeer.\u003c/p\u003e\n\u003cp\u003e• Veel mogelijkheden jezelf door opleiding en training zowel vakinhoudelijk als persoonlijk te blijven ontwikkelen.\u003c/p\u003e\n\u003cp\u003e• Een goede balans tussen je professionele en je privéleven. In deze functie is het mogelijk om 4 dagen van 9 uur te werken.\u003c/p\u003e\n\u003cp\u003eDit allemaal bij een werkgever in hartje Amsterdam, die prima per openbaar vervoer bereikbaar is. Waar je bovendien – afhankelijk van je functie – deels thuis kunt werken en waar we ons werk steeds vaker op een agile manier doen.\u003c/p\u003e\n\u003cp\u003eSolliciteer nu!\nWil jij als SharePoint ontwikkelaar werken met impact? Solliciteer dan direct op deze vacature! Als sollicitatie ontvangen we graag uiterlijk 4 november 2019 een motivatiebrief en je complete cv via de 'solliciteer' button. Heb je eerst nog vragen? Hieronder staan onze contactgegevens, we vertellen je graag meer!\u003c/p\u003e\n\u003cp\u003eVoor de justitiële screening is deze functie ingedeeld in profiel 2a, meer informatie over de screening vind je op de pagina Over ons \u0026gt; Sollicitatieproces.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eKlik hier om te solliciteren!: \u003ca href=\"https://denederlandschebank.redirect.your-jobresponse.com/sharepoint_ontwikkelaar_amsterdam/256845/V819/solliciteren\"\u003ehttps://denederlandschebank.redirect.your-jobresponse.com/sharepoint_ontwikkelaar_amsterdam/256845/V819/solliciteren\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjEwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2f237b600f4bd8b1c07384e8b1bea946dbe3f3c/DNB_merkteken_pos_rgb-1920px-1-750x410.jpg"},{"id":"d6a3d5ac-a77a-47cf-9bb5-fb4bfc7f46be","type":"Full Time","url":"https://jobs.github.com/positions/d6a3d5ac-a77a-47cf-9bb5-fb4bfc7f46be","created_at":"Thu Oct 17 08:15:40 UTC 2019","company":"Tower / fournova","company_url":"https://www.fournova.com/","location":"Remote","title":"Rails Developer (Full-Stack)","description":"\u003ch1\u003eAbout the Team\u003c/h1\u003e\n\u003cp\u003eWe are a small, fully remote, and self-funded software company based in Germany. Our product \"\u003ca href=\"https://www.git-tower.com\"\u003eTower\u003c/a\u003e\" is the best Git client for Mac and Windows and is used by over 100,000 customers - from startups to Fortune 100 companies.\u003c/p\u003e\n\u003cp\u003eWe know we can achieve great goals only with the help of our peers. And at fournova, we are blessed to work in a team of extraordinary people. We’re not looking for someone to do the job. We’re looking for someone to join the team!\u003c/p\u003e\n\u003ch1\u003eAbout the Position\u003c/h1\u003e\n\u003cp\u003eWe're looking for a \u003cstrong\u003eRails Developer (Full-Stack)\u003c/strong\u003e to join our team. You’ll have the chance to work in many different areas: on exciting new products, our many ecosystem projects and websites.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eWeb Products\u003c/strong\u003e: You can help us build some exciting new products! You'll be using Ruby on Rails on the whole stack: from backend code all the way to HTML, CSS, and JavaScript. (Hint: we're big fans of \"classic\" web applications and page reloads; so if you're deeply in love with React or Vue.js, we're probably not the right place for you.)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eEcosystem Projects\u003c/strong\u003e: To deliver \"Tower\" (our Git desktop client) to \u003cem\u003ethousands of users\u003c/em\u003e, we've built our own ecosystem applications. Both our \"Licensing \u0026amp; Activation System\" as well as our \"Application Updates System\" are custom-built Rails applications, which are constantly gaining new features and improvements.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eLearning Content:\u003c/strong\u003e (\u003cem\u003eoptional\u003c/em\u003e) We love to learn new things. That's why we also love to help our users and community learn new things. Our learning content on Git and lots of other software topics is read by hundreds of thousands of people every month. In case you have a knack for \u003cem\u003ewriting good content\u003c/em\u003e, you're welcome to contribute through blog posts or in-depth tutorials for our community.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eRequired Skills\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eFluent in English\u003c/li\u003e\n\u003cli\u003e5+ years experience in web development (including HTML5, CSS / Sass, JavaScript)\u003c/li\u003e\n\u003cli\u003e3+ years experience with Ruby on Rails\u003c/li\u003e\n\u003cli\u003e(optional) experience with PHP\u003c/li\u003e\n\u003cli\u003eYou are a good and mindful communicator\u003c/li\u003e\n\u003cli\u003eYou are open to learn our toolchain (e.g. GitHub, Heroku, Zendesk, ActiveCampaign, Postmark and their APIs)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eAbout You\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003every reliable \u0026amp; thorough: you accept responsibility for your own work and its quality\u003c/li\u003e\n\u003cli\u003ehungry to be part of a team that creates things that matter\u003c/li\u003e\n\u003cli\u003eself-motivated and capable of working from home\u003c/li\u003e\n\u003cli\u003eopen to discussions and a mindful communicator\u003c/li\u003e\n\u003cli\u003ewilling to be part of a team \u0026amp; yet able to work independently\u003c/li\u003e\n\u003cli\u003epaying attention to details\u003c/li\u003e\n\u003cli\u003eopen-minded and respectful – regarding people, technologies and projects\u003c/li\u003e\n\u003cli\u003ehappy to become part of a small team of friendly \u0026amp; skilled professionals\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIs this a position \u0026amp; culture that resonates with you? Can you contribute something to make fournova even better? Yes and yes?!? \u003cstrong\u003e\u003ca href=\"https://www.fournova.com/jobs\"\u003eThen please get in touch with us!\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eGet in touch via \u003ca href=\"https://www.fournova.com/jobs\"\u003ehttps://www.fournova.com/jobs\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlowIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a075d9804b1240eff7ba0d29cc9ff3a317d16c50/tower-logo-light@2x.png"},{"id":"5086af3e-a27d-40d8-b443-d607a950088d","type":"Full Time","url":"https://jobs.github.com/positions/5086af3e-a27d-40d8-b443-d607a950088d","created_at":"Wed Oct 16 20:44:19 UTC 2019","company":"Lift \u0026 Co.","company_url":"http://www.lift.co","location":"Toronto","title":"Data Engineer","description":"\u003cp\u003e\u003cstrong\u003eData Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Lift \u0026amp; Co.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLift \u0026amp; Co. (TSXV:LIFT) is a cannabis-focused technology and media company that monetizes a platform of advertising solutions, events, and data insights.   We enable cannabis businesses to better understand and target cannabis consumers.  Our mission to empower Informed cannabis decisions is driven by:\u003c/p\u003e\n\u003cp\u003eA \"TripAdvisor\"-like reviews platform and the Industry's largest loyalty program, which serve as a marketplace connecting users to businesses;\nThe Lift \u0026amp; Co. Retail Training Certification, featuring an exclusive partnership with MADD Canada, where we are training tomorrow's budtenders In both government and private retailers;\nCanada's largest cannabis tradeshows and the Canadian Cannabis Awards, the gold standard for industry recognition.\u003c/p\u003e\n\u003cp\u003eLift \u0026amp; Co. is laying tracks for significant expansion through aggressive market growth to become the de facto global cannabis technology marketplace.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role\u003c/strong\u003e\nDevelop data collection/management systems, data analytics and other strategies that optimize statistical efficiency and quality.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDuties \u0026amp; Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eConduct insightful analysis using internal and external data to derive insights that will drive business decisions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAutomate the software continuous deployment pipeline\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImprove data quality through testing, tooling and continuously evaluating the performance\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBuild large-scale batch and real-time data pipelines with data processing frameworks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImplement Machine Learning and NLP algorithms for recommendations, sentimental analysis, etc.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou are:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComfortable with ambiguity and have the ability to synthesize information and make good decisions\u003c/li\u003e\n\u003cli\u003eA self-delegator with a strong ability to take initiative and fail quickly\u003c/li\u003e\n\u003cli\u003eAdept at ‘managing up’ and able to communicate with and inform senior leadership on key matters\u003c/li\u003e\n\u003cli\u003eFlexible – you enjoy a team, environment and company in which change is the norm\u003c/li\u003e\n\u003cli\u003eIterative in your mindset – you challenge the status quo, continuously thinking of ways to grow and evolve\u003c/li\u003e\n\u003cli\u003eEntrepreneurial – you thrive in high-growth environments\u003c/li\u003e\n\u003cli\u003eResourceful – when things are unclear, you figure it out\u003c/li\u003e\n\u003cli\u003eWell rounded – you value family/personal time, camaraderie, and giving back to the community\u003c/li\u003e\n\u003cli\u003eFlexible, nimble and love change and growth\u003c/li\u003e\n\u003cli\u003ePurposeful and mindful\u003c/li\u003e\n\u003cli\u003ePassionate – you care deeply about the work that you do\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eStrong programming skills: SQL, Python, Java, JavaScript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliar with Git and CI/CD tools, e.g. Jenkins, Ansible, etc.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork experience in building ETL pipelines and database modelling\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork experience with relational database systems: MySQL, Postgres, etc.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliar with NoSQL data stores: MongoDB, Elasticsearch, is a plus\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliar with classic Machine Learning and NLP algorithms is a plus\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBachelor’s degree in Statistics, Mathematics, Computer Science or related fields from an accredited college or university\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation \u0026amp; Perks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive base salary\u003c/li\u003e\n\u003cli\u003eCompetitive Benefits package\u003c/li\u003e\n\u003cli\u003eCasual and fun office environment with work from home options, pet-friendly office and fun social events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePlease submit your resume and a letter expressing why you want to work for Lift \u0026amp; Co.\nLift \u0026amp; Co. is an Equal Opportunity Employer in accordance with the Accessibility for Ontarians with Disabilities Act, 2005 and the Ontario Human Rights Code. Lift \u0026amp; Co. will provide accommodations throughout the recruitment and selection and/or assessment process to applicants with disabilities. We thank all interested candidates, however, only those selected for interviews will be contacted. Please indicate accommodations as required if contacted.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply to \u003ca href=\"mailto:HR@Lift.co\"\u003eHR@Lift.co\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkowIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bc6618840f184074fc55ef1b178cbec538a871d1/LiftCo-Logo-Black.jpg"},{"id":"cb24f618-6f83-47eb-8685-113b3448d616","type":"Full Time","url":"https://jobs.github.com/positions/cb24f618-6f83-47eb-8685-113b3448d616","created_at":"Wed Oct 16 13:21:06 UTC 2019","company":"Pacific Life","company_url":"https://pacificlife.contacthr.com/72652299","location":"Aliso Viejo, CA","title":"Software Solutions Engineer/Lead/Architect-Java","description":"\u003cp\u003eFor more than 150 years, Pacific Life has offered innovative products and services including life insurance, annuities, and mutual funds, along with a variety of investment products, all of which provide The Power to Help You Succeed. We firmly believe each employee plays a part in our continued growth and success, and we pride ourselves in providing a work environment that is challenging, inclusive, collaborative, and results-oriented. With a powerful past and a strong future, Pacific Life offers an environment where you're empowered to achieve your personal best. In return, we look to your passion and insight to help us grow. For additional company information, including current financial strength ratings, visit \u003ca href=\"http://www.PacificLife.com\"\u003ewww.PacificLife.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCurrently, we are seeking a talented Software Solutions Engineer/Architect to join the Life Insurance Division in Aliso Viejo, CA. The Life Insurance Division works with financial and insurance professionals to give families and businesses the life insurance coverage needed to help meet important financial protection, wealth accumulation, and wealth preservation goals.\u003c/p\u003e\n\u003cp\u003ePOSITION SUMMARY\u003c/p\u003e\n\u003cp\u003eThis individual will be a part of the Commissions IT team comprised of Business Systems Analysts and Developers.  As a Solutions Architect, you will design, develop and support full stack web applications using a variety of technologies and development platforms, preferably using Java, Node.js and AWS cloud.  This role will help architect new solutions, while also supporting and enhancing existing systems.\u003c/p\u003e\n\u003cp\u003eEssential Duties and Responsibilities\u003c/p\u003e\n\u003cp\u003eArchitects complex projects across multiple systems and leads the development team in designing, building, testing and deploying software releases to support business objectives.\u003c/p\u003e\n\u003cp\u003e*Acts as a lead to the group on new technologies and industry trends; tries out new tools, technologies and makes recommendations on technology solutions for our applications\n*Partners with business and other IT teams in designing and implementing the solutions that streamline applications and data; makes informed decisions on issues such as sacrificing speed for quality and when to apply an appropriate technology\n*Has expert-level knowledge of latest technology currently in use by team; leads peer review meetings, provides input, receives feedback and implements necessary changes for design and code reviews\n*Partners with DevOps and infrastructure teams to implement deployment automation, infrastructure and security needs\n*Acts as subject matter expert for overall system solution; provides long term technical strategy for application integrations and software; identifies potential long-term problems ahead of time and designs software to alleviate those problems\n*Designs component-based software solutions with the intent of creating reusable components, or pieces of functionality\n*Designs software that is highly available, scalable and fast\n*Responds promptly to production outages, investigates root cause and suggests appropriate resolution\n*Participates in on-call rotation for nightly batch cycle\u003c/p\u003e\n\u003cp\u003eFACTORS FOR SUCCESS\n*Two plus years as a Technical Lead or Solutions Architect\n*Five plus years of hands-on Java development experience\n*Two plus years of Node.js \u0026amp; Angular development\n*AWS, Azure or other Cloud platform experience\n*Proficiency with SDLC methodologies including Waterfall and Agile\n*Object-oriented analysis, design and SOA know-how\n*Exposure to microservices, web service development (SOAP, REST/JSON) and XML based configuration\n*Understanding of relational database concepts; experience with MySQL, Postgres and MS SQL Server preferred\n*Advanced SQL and database design skills\n*Fluency in developing and deploying on Linux and Windows environments\n*Experience supporting apps with a batch component (nightly scheduled jobs)\n*Excellent oral and written communication skills; positive, team-oriented attitude\n*Bachelor's degree in Computer Science or related field\n*Previous experience in Financial Services industry and specifically with incentive compensation systems a plus\u003c/p\u003e\n\u003cp\u003eJoin the Pacific Life team and watch your career grow! We offer a competitive compensation and benefits package that includes: * Competitive salary and bonus program * Medical, dental, and vision as part our commitment in investing in the health and well being of our employees * Two retirement savings plans: 401k savings plan with company match and Company Retirement Contribution (company-paid) * Generous vacation time and holiday pay  * And much more!\u003c/p\u003e\n\u003cp\u003ePacific Life Insurance Company is an Equal Opportunity /Affirmative Action Employer, M/F/D/V.  If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request an accommodation, contact a Human Resources Representative at Pacific Life Insurance Company.\u003c/p\u003e\n\u003cp\u003eJOB REQUIREMENTS:\n\u003c/p\u003e\n\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72652299\"\u003ehttps://pacificlife.contacthr.com/72652299\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72652299\"\u003ehttps://pacificlife.contacthr.com/72652299\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"77a33cfb-72c9-49e6-8d53-5bb99a40f8b3","type":"Full Time","url":"https://jobs.github.com/positions/77a33cfb-72c9-49e6-8d53-5bb99a40f8b3","created_at":"Tue Oct 15 23:04:35 UTC 2019","company":"Yaka Labs ","company_url":"https://yakalabs.com/","location":"Remote - New York City ","title":"Front End Developer ","description":"\u003cp\u003eYaka Labs is a well-funded San Francisco-based startup working in conjunction with Self-Sovereign Identity provider GlobaliD to develop a state-of-the-art ledger and wallet solution to transact in fiat, crypto, financial, and real assets. We are currently looking for a Front-End Developer with a focus in Data Visualization to work on our Risk \u0026amp; Analytics systems. We are a fast-paced and dynamic team with expertise in financial markets, data analytics, and crypto. We are looking for someone equally dynamic with a penchant for design and visualization to join us. This is a unique and challenging opportunity with significant upside potential.\u003c/p\u003e\n\u003cp\u003eThis position is entirely remote with approximately 10% travel.\u003c/p\u003e\n\u003cp\u003eResponsibilities\nDevelop real-time data visualizations for financial and business data sets.\nMaintain and enhance our internal reporting UI (Node/React).\nAd hoc data analysis, report prototyping, and proof-of-concept work.\nWork with business partners and analytics team to determine requirements, scope out new projects, and troubleshoot UI issues.\u003c/p\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cp\u003e3+ years of work experience with the following skills are required:\u003c/p\u003e\n\u003cp\u003eHard Skills\nD3, SVG, C3, or other JavaScript-based visualization libraries.\nNode.js, React, Redux or similar technologies.\nAWS, GitLab, Docker.\nSome Python is desirable.\u003c/p\u003e\n\u003cp\u003eSoft Skills\nSelf-motivated with the ability to work in a fast-paced, dynamic environment.\nHigh attention to detail.\nAbility to communicate clearly and frequently (both verbally and in writing).\nAbility to make independent design decisions with incomplete information.\u003c/p\u003e\n\u003cp\u003eBefore applying, please address the following questions:\u003c/p\u003e\n\u003cp\u003eAre you legally authorized to work in the United States?\u003c/p\u003e\n\u003cp\u003eWill you now, or in the future, require sponsorship for employment visa status (e.g. H-1B visa status)?\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:careers@yakalabs.com\"\u003ecareers@yakalabs.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"a9de427e-67d2-4ac4-a432-b27988b2f9b5","type":"Full Time","url":"https://jobs.github.com/positions/a9de427e-67d2-4ac4-a432-b27988b2f9b5","created_at":"Tue Oct 15 21:24:18 UTC 2019","company":"Defendify","company_url":"https://www.defendify.io","location":"Portland, Maine","title":"Senior Full Stack Developer","description":"\u003cp\u003eThanks for your interest in working with us! Defendify is a fast-growing, fun-loving startup with a small, vibrant team based in Portland, Maine. Resourcefulness, responsiveness, problem-solving, and simplicity are values that shape who we are, what we do, and how we deliver amazing customer experiences.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePosition Details\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a full stack developer to join us full time. While you may have an existing focus on one side—front or back end—it is important to be(come) comfortable in both environments. This is a unique and exciting opportunity as we continue to expand the footprint of our groundbreaking, all-in-one cybersecurity platform.\u003c/p\u003e\n\u003cp\u003eWe are looking for a team player who:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHas a passion for solving problems and is eager to grow, learn, and tackle daily and long-term challenges and goals.\u003c/li\u003e\n\u003cli\u003eWill dig in and ask questions from users to understand requirements; make a plan; dive into an existing codebase and learn where to make changes, or where to start new code.\u003c/li\u003e\n\u003cli\u003eIs a good communicator who enjoys collaboration and thrives in a development culture that values clean code, accessibility, compatibility, and optimization.\u003c/li\u003e\n\u003cli\u003eMaintains excellent knowledge of how modern web applications work, including REST API usage, application security, session management, and development best practices.\u003c/li\u003e\n\u003cli\u003eHas an open mind toward technologies: As a startup, we need to use whatever is the best tool to solve a problem, not always the most popular or the most complicated.\u003c/li\u003e\n\u003cli\u003eIs comfortable self-directing their own work. No micro-management here!\u003c/li\u003e\n\u003cli\u003eEnjoys participating in team discussions and events, including Defendify’s ongoing charity work and missions within the community.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEvery team member is a valuable contributor to our core SaaS product with day-to-day responsibilities covering a variety of development needs including building, maintaining, and supporting the Defendify platform. All are encouraged to contribute strategic ideas and participate in QA/QC, and it is important to be comfortable working in an Agile/SCRUM development environment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements - Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cem\u003eBackground:\u003c/em\u003e Significant full-time development experience (employed or freelance). Specific number of years is not as important as demonstrated contributions.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eVariety:\u003c/em\u003e You should have worked on large projects in addition to lots of small feature improvements and bug fixes, comfortable with a model of continuous improvement.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eOwnership:\u003c/em\u003e You should have been responsible for the entire lifecycle of code in at least one major project, from scratch to QA to deployment to maintenance.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eProcess:\u003c/em\u003e You should also be comfortable with the philosophy and implementation of development automation: tests, continuous integration, cloud deployment, and frequent production releases.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eTechnology:\u003c/em\u003e JavaScript experience is paramount in both Node and browser environments. Closures, destructuring, async/await and other aspects of modern JavaScript should be familiar in your everyday coding experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements – Technical\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cem\u003eJavaScript:\u003c/em\u003e We use libraries and frameworks as needed, but you need to be able to write and understand plain JS. Both Node and browser experience are required.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eFront End and Internet Stack:\u003c/em\u003e You should have experience with HTML5, CSS3, and familiarity with the ecosystem of related technologies, like DOM and SASS. In addition, TCP/IP, DNS, and especially how they relate to HTTP. Vue (or similar framework) experience and knowledge of site builders such as Jekyll/Hugo are helpful.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eVersion Control:\u003c/em\u003e You will be expected to understand how to use Git(Hub) for source control and deployments.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eRelational Databases:\u003c/em\u003e Some relational database experience strongly preferred. Pluses include: Experiences in relational and in-memory databases (MySQL, Postgres, Redis) as well as knowledge in generic SQL.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eOperations:\u003c/em\u003e Some experience with Amazon Web Services (AWS), Heroku, or similar services.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Success\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are not alone in your role – Defendify’s development team is made up of “A” players dedicated to your training and success. We thrive on an open-door policy and transparent management system that fosters team collaboration.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a flexible position open to candidates with varying levels of experience and offers long term growth potential via a well-defined career path. Compensation is competitive and commensurate with experience, and is variable based on personal and team performance. Our benefits package is comprehensive and includes health, dental, and vision coverage, educational reimbursement, a 401(k) program, paid time-off and more.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLove What You Do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDefendify employees enjoy a modern work environment and culture where everyone genuinely cares about the work they do. We’re passionate about our product, the problems we’re solving, our customers, our partners, and the all-star team we’re building. We’re in it together, enjoying work and play every day from team lunches, impromptu social outings and celebrations, and charity missions to Friday afternoon ping-pong tournaments and Wacky Game Wednesday. And yes, there is coffee, lots and lots of coffee!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpportunity Knocks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis position offers a great opportunity to make an impact as a part of a small team solving big problems, making cybersecurity possible for Small Business. Are you a creative self-starter with an appetite to learn and grow? If so, we'd love to hear from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now at \u003ca href=\"https://www.defendify.io/careers\"\u003ehttps://www.defendify.io/careers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXAwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5b0c5b16f01708cfca41d4eb3b03d3c1ba77ae1c/Defendify_grey_R.png"},{"id":"c57950f9-b6f2-45db-92c8-1dbb8516baf0","type":"Full Time","url":"https://jobs.github.com/positions/c57950f9-b6f2-45db-92c8-1dbb8516baf0","created_at":"Tue Oct 15 19:50:13 UTC 2019","company":"ACV Auctions","company_url":"https://www.acvauctions.com/","location":"Buffalo","title":"Software Engineer in Test","description":"\u003cp\u003eQuality Engineer/Software Engineer in Test\u003c/p\u003e\n\u003cp\u003eACV Auctions is reinventing a $100 billion industry through an online, wholesale vehicle marketplace that provides car dealerships a more effective and transparent way of buying and selling wholesale vehicles through 20-minute auctions. Our technology modernizes the entire arc of auction operations, providing third- party inspections, account management, title and payment processing, managing arbitration and transportation. The company strives to be the most trusted source in the industry for dealers to buy and sell wholesale vehicles.\u003c/p\u003e\n\u003cp\u003eWho we are looking for:\u003c/p\u003e\n\u003cp\u003eACV Auctions is looking for an exceptional Software Engineer in Test to build and manage a mobile app automation testing framework to ensure consistent data capture across web and mobile devices. In this role you will actively participate in test strategy, development, execution, automation and application troubleshooting.\nThe ideal candidate possesses experience in developing and implementing automation testing frameworks for web apps, native Android and native iOS.\u003c/p\u003e\n\u003cp\u003eWhat you will do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDefining test requirements, test strategies and test designs\u003c/li\u003e\n\u003cli\u003eDesigning and building test automation infrastructure\u003c/li\u003e\n\u003cli\u003eDeveloping and executing automated tests\u003c/li\u003e\n\u003cli\u003eManage multiple priorities and tasks in a dynamic work environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you will need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years’ experience in software testing, 2+ years in a leadership or senior engineering role.\u003c/li\u003e\n\u003cli\u003eDemonstrated experience overseeing and managing people in the testing function for an enterprise software product.\u003c/li\u003e\n\u003cli\u003eHave worked as an integral member of the development team collaborating with product, engineering, and other business units by testing and releasing software following agile methods.\u003c/li\u003e\n\u003cli\u003eAbility to write and execute unit, functional, integration and regression test scenarios; Familiarity with standards compliance and general principles of usability.\u003c/li\u003e\n\u003cli\u003eExceptional interpersonal communication skills (written and verbal), attention to detail, extreme organization, problem-solving and time management skills.\u003c/li\u003e\n\u003cli\u003eExperience working with automated testing frameworks including, but not limited to, Selenium, Appium, and Jasmine.\u003c/li\u003e\n\u003cli\u003eExperience testing and troubleshooting applications written in web technologies (like HTML, CSS, JavaScript and associated frameworks/libraries); Prior experience with Jenkins, Kubernetes, Docker, VueJS, AngularJS, MySQL, Perl, Python, Java, Service Oriented Architectures, or AWS a plus.\u003c/li\u003e\n\u003cli\u003eA familiarity with software languages and SQL knowledge; you can write select statements (including semi-complex joins) to query data at rest in the database or in log files.\u003c/li\u003e\n\u003cli\u003eFamiliarity with screen capture and other recording solutions to document steps to troubleshoot and reproduce issues identified during testing.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we will offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary and benefits\u003c/li\u003e\n\u003cli\u003eUpbeat Innovated Culture\u003c/li\u003e\n\u003cli\u003eProfessional training opportunities\u003c/li\u003e\n\u003cli\u003eFlexible schedules\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eACV Auctions is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on the company website or message your CV to \u003ca href=\"mailto:jkowalski@acvauctions.com\"\u003ejkowalski@acvauctions.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVIwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--492b937080b2948a2f738fe90742351404f92022/ACV_Auctions_Logo.jpg"},{"id":"8ce73d82-fc32-4074-9187-12f042bb002a","type":"Full Time","url":"https://jobs.github.com/positions/8ce73d82-fc32-4074-9187-12f042bb002a","created_at":"Tue Oct 15 19:25:51 UTC 2019","company":"ACV Auctions","company_url":"https://www.acvauctions.com/","location":"Toronto","title":"Sr. Android Engineer","description":"\u003cp\u003eACV Auctions is reinventing a $100 billion industry through an online, wholesale vehicle marketplace that provides a more effective and transparent way of buying and selling wholesale vehicles through 20-minute auctions. Our technology modernizes the entire arc of auction operations, providing third-party inspections, title and payment processing, managing arbitration and transportation.\u003c/p\u003e\n\u003cp\u003eWho we are looking for:\u003c/p\u003e\n\u003cp\u003eACV Auctions is looking for a Senior Android Software Engineer responsible for the development and maintenance of our Android applications for a diverse set of devices. You will work alongside a team of software engineers to build and ship new features that will drive the growth of ACV Auctions. Commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.\u003c/p\u003e\n\u003cp\u003eWhat you will do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork closely with our Product and Design teams to develop ACV Auctions on the Android platform.\u003c/li\u003e\n\u003cli\u003eDesign, build and maintain high-performance, reusable and reliable Java and/or Kotlin code.\u003c/li\u003e\n\u003cli\u003eContribute industry best practices and technology to the development and maintenance of our Android applications.\u003c/li\u003e\n\u003cli\u003eHelp maintain code quality by implementing bug fixes and solving bottlenecks.\u003c/li\u003e\n\u003cli\u003eDesign, build and automate high-quality unit, integration, and UI tests.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you will need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA minimum of 5 years experience in Android development.\u003c/li\u003e\n\u003cli\u003eHave released and maintained at least one Android application in the Google Play Store.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of the Android SDK and multiple versions of Android for a variety of devices.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of Android UI design principles, patterns, and best practices.\u003c/li\u003e\n\u003cli\u003eFamiliarity with RESTful APIs.\u003c/li\u003e\n\u003cli\u003eExperience with offline storage, threading, mobile memory management and performance tuning, benchmarking and optimization.\u003c/li\u003e\n\u003cli\u003eExperience automating UI and unit tests using relevant testing frameworks.\u003c/li\u003e\n\u003cli\u003eFamiliarity with real-time streaming, and using push notifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we will offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary and benefits\u003c/li\u003e\n\u003cli\u003eUpbeat Innovated Culture\u003c/li\u003e\n\u003cli\u003eProfessional training opportunities\u003c/li\u003e\n\u003cli\u003eFlexible schedules\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eACV Auctions is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on the career page or send your CV over to \u003ca href=\"mailto:anika@acvauctions.com\"\u003eanika@acvauctions.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUIwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--87e7c479249a804ae6073485b5c2fd643aed83c5/ACV_Auctions_Logo.jpg"},{"id":"c8c80fd5-9224-4a78-9d25-97ccc2ba0080","type":"Full Time","url":"https://jobs.github.com/positions/c8c80fd5-9224-4a78-9d25-97ccc2ba0080","created_at":"Tue Oct 15 15:42:59 UTC 2019","company":"mobilcom-debitel GmbH","company_url":"https://www.mobilcom-debitel.de/","location":"Büdelsdorf","title":"Softwareentwickler (w/m/d) - Backend Services","description":"\u003cp\u003eDie Marke mobilcom-debitel ist in der freenet Group als Digital-Lifestyle-Provider positioniert und bietet eigene Mobilfunk- und Datenangebote, Dienste und weitere Produkte, wie die mobilcom-debitel Cloud, MusicFlat oder mobilcom-debitel SmartHome sowie kompetente Beratung und eine Auswahl der Produkte in über 560 Shops sowie in den Stores der Marke GRAVIS.\u003c/p\u003e\n\u003cp\u003eFür unseren Standort Büdelsdorf (bei Kiel) suchen wir schnellstmöglich tatkräftige Unterstützung in Vollzeit:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSoftwareentwickler (w/m/d) - Backend Services\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eDAS MACHEN SIE MÖGLICH:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSie haben die Verantwortung für die Konzeption und Entwicklung von neuen Softwarelösungen im Bereich der Microservices mit aktuellen Programmiersprachen und Frameworks\u003c/li\u003e\n\u003cli\u003eZusammen im Team arbeiten Sie in einem agilen Softwareentwicklungsprozess und besitzen die Möglichkeit die Entwicklung im Unternehmen aktiv mitzugestalten\u003c/li\u003e\n\u003cli\u003eEine intensive Einarbeitung in die Technologien/Themen unterstützen wir mit Tech-Talks, Pair programming und Workshops\u003c/li\u003e\n\u003cli\u003eGemeinsam im 15-köpfigen Team entwickeln Sie laufend die verwendeten Werkzeuge und Methoden mit innovativen Ideen weiter\u003c/li\u003e\n\u003cli\u003eSie sorgen in Eigenverantwortung für eine hohe Qualitätssicherung durch Konzeption und Ausführung von automatisierten Unit- und Integrationstests\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDAS BRINGEN SIE MIT:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSie verfügen über ein abgeschlossenes Studium mit Informatikbezug oder eine vergleichbare Qualifikation. Auch Quereinsteiger mit relevanter Berufserfahrung sind willkommen\u003c/li\u003e\n\u003cli\u003eErfahrungen in der Entwicklung mit serverseitigem node.JS und Java bringen Sie mit. Außerdem verfügen Sie über gute Kenntnisse in REST-Services und ideal wären Erfahrungen in GraphQL\u003c/li\u003e\n\u003cli\u003eTeamarbeit wird bei uns groß geschrieben. Sie sind ein Teamplayer und haben Spaß daran gemeinsam Lösungen zu erarbeiten\u003c/li\u003e\n\u003cli\u003eScrumprozesse, Dailys, regelmäßige Retrospektvien und Eigenverantwortlichkeit gehören für Sie zur täglichen Arbeit dazu\u003c/li\u003e\n\u003cli\u003eSie haben Erfahrung mit gängigen IDEs (z. B. Eclipse, IntelliJ) und entsprechenden Entwicklertools (z. B. Git, Docker, bamboo oder jenkins)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDAS ERLEBEN SIE BEI UNS:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWeiterentwicklung@freenet bietet persönliche und fachliche Entwicklungsmöglichkeiten\u003c/li\u003e\n\u003cli\u003eWohlfühlatmosphäre durch Duz-Kultur und lockerem Dresscode\u003c/li\u003e\n\u003cli\u003eKollegiales Miteinander sowie Team- und Firmenevents\u003c/li\u003e\n\u003cli\u003eAttraktives Mitarbeiterfahrzeugmodell als Rundum-sorglos-Paket inklusive Wartung, Versicherung, Steuern und Tanken\u003c/li\u003e\n\u003cli\u003eZuschuss zu einem Mobilfunktarif\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eEINE GRUPPE. ALLE MÖGLICHKEITEN.\u003c/h2\u003e\n\u003cp\u003eBewerben Sie sich vorzugsweise online über das Bewerbungsformular oder senden Sie Ihre vollständige Bewerbung mit Angabe der Anzeigenquelle und Ihres Gehaltswunsches an: mobilcom-debitel GmbH | Ein Unternehmen der freenet Group | Joachim Halefeld | Hollerstraße 126 | 24782 Büdelsdorf\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2pnfcO2\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2pnfcO2\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDUwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b3042bb8f82c206236d02bdb7896843fa3459ad1/mobilcom.jpg"},{"id":"c802f063-68ed-4e2a-aacb-bfa33c29f4cf","type":"Full Time","url":"https://jobs.github.com/positions/c802f063-68ed-4e2a-aacb-bfa33c29f4cf","created_at":"Tue Oct 15 09:54:27 UTC 2019","company":"European Molecular Biology Laboratory (EMBL)","company_url":"http://www.embl.org/jobs","location":"Heidelberg, Germany","title":"Web Developer","description":"\u003cp\u003e\u003cstrong\u003eAbout EMBL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are Europe’s flagship research laboratory for the life sciences – an intergovernmental organisation performing scientific research in disciplines including molecular biology, physics, chemistry and computer science. We are an international, innovative and interdisciplinary laboratory with over 1700 employees from many nations operating across six sites, in Heidelberg (DE, headquarters), Barcelona (ES), Cambridge (UK), Hamburg (DE), Grenoble (FR) and Rome (IT). Our mission is to perform basic research in molecular biology; to offer vital services to scientists in the member states; to train scientists, students and visitors at all levels; to develop new instruments and methods in the life sciences whilst actively engaging in technology transfer activities, and to help integrate European life science research at all levels.\u003c/p\u003e\n\u003cp\u003eEMBL IT Services operate and support the IT infrastructure and services at EMBL headquarters in Heidelberg and for the laboratory’s sites in Barcelona and Rome. We develop and maintain the technical infrastructure for the EMBL corporate website and are currently involved in a major re-design and implementation of a new infrastructure for this site, in collaboration with our Web Development colleagues at EMBL-EBI in Cambridge.\u003c/p\u003e\n\u003cp\u003eWe are looking for an enthusiastic Web Developer to join the Software and Solutions team within EMBL IT Services, who will be responsible for our current website infrastructure and is expected to take a key role in this new project.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTo develop and maintain the technical infrastructure for the EMBL websites\u003c/li\u003e\n\u003cli\u003eTo integrate the content management system, web apps, database resources and enterprise search with our website\u003c/li\u003e\n\u003cli\u003eTo provide technical support for this infrastructure to our internal customers\u003c/li\u003e\n\u003cli\u003eTo design and implement our new major website\u003c/li\u003e\n\u003cli\u003eTo closely collaborate with our Communications Team and the Web Development team at EMBL-EBI in Cambridge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProven professional experience in web development\u003c/li\u003e\n\u003cli\u003eMature knowledge in PHP/frameworks, JavaScript/frameworks, HTML, CSS, XML\u003c/li\u003e\n\u003cli\u003eExperience with web content management systems\u003c/li\u003e\n\u003cli\u003eBasic understanding of SQL\u003c/li\u003e\n\u003cli\u003eGood working knowledge in administration of Linux systems, web servers and relational databases\u003c/li\u003e\n\u003cli\u003eBackground in enterprise search technologies (e.g. Elasticsearch, Solr)\u003c/li\u003e\n\u003cli\u003eThe ability to work both independently and as part of a team, you are well-organised and self-motivated\u003c/li\u003e\n\u003cli\u003eExcellent communication and interpersonal skills\u003c/li\u003e\n\u003cli\u003eProficiency in spoken and written English\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou might also have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in containerizing applications using Docker\u003c/li\u003e\n\u003cli\u003eKnowledge in implementing and applying CI/CD methodology\u003c/li\u003e\n\u003cli\u003eScripting skills such as Python, Bash, JS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy join us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe offer you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe opportunity to work with the latest tools and technology\u003c/li\u003e\n\u003cli\u003eCertified training and continued development of your professional and personal skills\u003c/li\u003e\n\u003cli\u003eTechnological exchange and working with IT teams across EMBL\u003c/li\u003e\n\u003cli\u003eA competitive salary and a comprehensive pension scheme; medical, educational and other social benefits, as well as financial sponsorship for relocation and installation for you and your family\u003c/li\u003e\n\u003cli\u003eA flexible and friendly, international working environment fostering creativity\u003c/li\u003e\n\u003cli\u003eAn inclusive, equal opportunity employer strongly committed to achieving gender balance\u003c/li\u003e\n\u003cli\u003eTo be part of one of the world’s highest ranked scientific research organizations and to commit to this joint effort to better understand the principles of life\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIf you feel you have the right skills and experience, please apply online at \u003ca href=\"https://www.embl.de/jobs/searchjobs/index.php?ref=HD01634\u0026amp;newlang=1\u0026amp;pos%5b%5d=ITS\u0026amp;loc%5b%5d=0\"\u003ewww.embl.org/jobs\u003c/a\u003e!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDiscover more on working with EMBL IT Services at \u003ca href=\"http://www.embl.de/itservices\"\u003eembl.de/itservices\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eIf you feel you have the right skills and experience, please apply online at \u003ca href=\"https://www.embl.de/jobs/searchjobs/index.php?ref=HD01634\u0026amp;newlang=1\u0026amp;pos%5b%5d=ITS\u0026amp;loc%5b%5d=0\"\u003ewww.embl.org/jobs\u003c/a\u003e!\u003c/strong\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdE4wIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2d1170f02cb01d774e377a5df7e0f1a7861ef2a6/EMBL_Logo_250x175.jpg"},{"id":"3ac51201-9e28-4db5-9c91-2392988f97cb","type":"Full Time","url":"https://jobs.github.com/positions/3ac51201-9e28-4db5-9c91-2392988f97cb","created_at":"Tue Oct 15 09:50:22 UTC 2019","company":"European Molecular Biology Laboratory (EMBL)","company_url":"http://www.embl.org/jobs","location":"Heidelberg, Germany","title":"Web Backend Developer","description":"\u003cp\u003e\u003cstrong\u003eAbout EMBL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are Europe’s flagship research laboratory for the life sciences – an intergovernmental organisation performing scientific research in disciplines including molecular biology, physics, chemistry and computer science. We are an international, innovative and interdisciplinary laboratory with over 1700 employees from many nations operating across six sites, in Heidelberg (DE, headquarters), Barcelona (ES), Cambridge (UK), Hamburg (DE), Grenoble (FR) and Rome (IT). Our mission is to perform basic research in molecular biology; to offer vital services to scientists in the member states; to train scientists, students and visitors at all levels; to develop new instruments and methods in the life sciences whilst actively engaging in technology transfer activities, and to help integrate European life science research at all levels.\u003c/p\u003e\n\u003cp\u003eEMBL IT Services operate and support the IT infrastructure and services at EMBL headquarters in Heidelberg and for the laboratory’s sites in Barcelona and Rome. In collaboration with the EMBL-EBI in Cambridge our team is creating and implementing a new web infrastructure for all EMBL websites.\u003c/p\u003e\n\u003cp\u003eWe are looking to recruit an enthusiastic Web Developer to join the Software and Solutions team within EMBL IT Services, who will be responsible for driving and implementing a new enterprise database service, in order to improve web access to the laboratory’s dynamic content.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eClosely collaborate with stakeholders across all EMBL sites to define the requirements for the enterprise database\u003c/li\u003e\n\u003cli\u003eDesign and implement a database schema for all dynamic business objects involved\u003c/li\u003e\n\u003cli\u003eImplement the backend feeds to this database\u003c/li\u003e\n\u003cli\u003eProvide a lightweight REST API to access the data\u003c/li\u003e\n\u003cli\u003eClosely interact with frontend web development teams consuming the API\u003c/li\u003e\n\u003cli\u003eSupport, monitor and manage your product\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA degree in computer sciences or similar\u003c/li\u003e\n\u003cli\u003eSeveral years of professional experience in web application development using PHP and JavaScript\u003c/li\u003e\n\u003cli\u003eProficiency in designing and implementing data models in SQL and NO-SQL\u003c/li\u003e\n\u003cli\u003eBackground in database administration\u003c/li\u003e\n\u003cli\u003eSuccessfully delivered solid and production ready solutions\u003c/li\u003e\n\u003cli\u003eThe willingness to work in a rapidly changing and heterogeneous environment\u003c/li\u003e\n\u003cli\u003eThe ability to work both independently and as part of a team, you are well-organised and self-motivated\u003c/li\u003e\n\u003cli\u003eExcellent communication and interpersonal skills\u003c/li\u003e\n\u003cli\u003eProficiency in spoken and written English\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou might also have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in containerizing applications using Docker\u003c/li\u003e\n\u003cli\u003eKnowledge in implementing and applying CI/CD methodology\u003c/li\u003e\n\u003cli\u003eScripting skills such as Python, Bash, JS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy join us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe offer you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe opportunity to work with latest technology\u003c/li\u003e\n\u003cli\u003eCertified training and continued development of your professional and personal skills\u003c/li\u003e\n\u003cli\u003eTechnological exchange and working with IT teams across EMBL\u003c/li\u003e\n\u003cli\u003eA competitive salary and a comprehensive pension scheme; medical, educational and other social benefits, as well as financial sponsorship for relocation and installation for you and your family\u003c/li\u003e\n\u003cli\u003eA flexible and friendly, international working environment fostering creativity\u003c/li\u003e\n\u003cli\u003eAn inclusive, equal opportunity employer strongly committed to achieving gender balance\u003c/li\u003e\n\u003cli\u003eTo be part of one of the world’s highest ranked scientific research organizations and to commit to this joint effort to better understand the principles of life\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIf you feel you have the right skills and experience, please apply online at \u003ca href=\"https://www.embl.de/jobs/searchjobs/index.php?ref=HD01638\u0026amp;newlang=1\u0026amp;pos%5b%5d=ITS\u0026amp;loc%5b%5d=0\"\u003ewww.embl.org/jobs\u003c/a\u003e!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDiscover more on working with EMBL IT Services at \u003ca href=\"http://www.embl.de/itservices\"\u003eembl.de/itservices\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eIf you feel you have the right skills and experience, please apply online at \u003ca href=\"https://www.embl.de/jobs/searchjobs/index.php?ref=HD01638\u0026amp;newlang=1\u0026amp;pos%5b%5d=ITS\u0026amp;loc%5b%5d=0\"\u003ewww.embl.org/jobs\u003c/a\u003e!\u003c/strong\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEYwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--001d98c4133b9f9a370ffbc6deab1d38506b62b4/EMBL_Logo_250x175.jpg"},{"id":"ab86aa90-f7ae-4eb5-b8b1-8cfa522aab97","type":"Full Time","url":"https://jobs.github.com/positions/ab86aa90-f7ae-4eb5-b8b1-8cfa522aab97","created_at":"Mon Oct 14 13:28:38 UTC 2019","company":"VONQ","company_url":"http://www.vonq.com","location":"Rotterdam","title":"Frontend developer","description":"\u003cp\u003e\u003cem\u003eMake impact on a unique product that has a big potential to grow! At VONQ we help companies attract more qualified applicants. We are growing and in the transition to a software driven business, so there is a lot of exciting stuff to get done! As a Frontend specialist you know like no other how important a smooth customer journey is, and you make users dazzle with your skills! Up for the challenge? Apply at VONQ for Frontend Developer in Rotterdam!\u003c/em\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eSenior Frontend Developer\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eRotterdam, fulltime, ASAP\u003c/em\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eMake tools people love to use and create the ultimate customer journey\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eAs a Frontend expert at VONQ you’ll have a huge contribution to our core product: the Job Marketing Platform (JMP). It’s a big data-driven application with a recommendation engine to help recruiters market jobs online.\u003c/p\u003e\n\u003cp\u003eThe platform is used daily by our customers and we have an ambitious roadmap to build it out further. Make it work better, give more insights and create the ultimate customer journey. And that’s where you come in!\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWhat your actual job looks like\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou’ll work in an agile multidisciplinary team: pairing, code reviews and giving/receiving feedback is something you’ll do regularly\u003c/li\u003e\n\u003cli\u003eIn order to create awesome interfaces for our clients, you’ll work closely together with both Backend specialists and UX Designers. You know like no other how to turn design into working software!\u003c/li\u003e\n\u003cli\u003eYou’ll work on creating the ultimate customer journey \u0026amp; data visualisations\u003c/li\u003e\n\u003cli\u003eYou’ll make sure that the JMP is good working and you are always looking for ways to improve further and implement new features.\u003c/li\u003e\n\u003cli\u003eYou’ll enjoy the state of your code: regular refactoring, and maintaining a good test coverage is in or normal workflow.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou will be part of an international and experienced Engineering department\u003c/strong\u003e  consisting of Backend and Frontend Developers, Data- and DevOps Engineers, an Agile Coach and a CTO.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWhat our perfect picture looks like\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eThis describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ year experience as a Frontend Developer and have an Agile mindset\u003c/li\u003e\n\u003cli\u003eExcellent English communication skills\u003c/li\u003e\n\u003cli\u003eExperience with HTML, CSS (SCSS), JavaScript (ES2015+)\u003c/li\u003e\n\u003cli\u003eExperience with React, and ideally Redux, BEM methodology, unit testing (Jest), and E2E testing (Cucumber)\u003c/li\u003e\n\u003cli\u003eAffinity and experience with data visualisations\u003c/li\u003e\n\u003cli\u003eExperience in working in a scrum team\u003c/li\u003e\n\u003cli\u003eA passion for building tools!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eBonus points!\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eIt’s an absolute plus if you are a Frontend specialist with a full stack mindset: having backend and/or devops experience (PHP)!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eThis is why you should join our team\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.\u003c/p\u003e\n\u003cp\u003eOur product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!\u003c/p\u003e\n\u003cp\u003eWe have legendary company outing, beers on Friday and lots of FUN!\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eThere is more! We offer:\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary, 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003eTime and budget for training\u003c/li\u003e\n\u003cli\u003eWorking in the most progressive city in NL\u003c/li\u003e\n\u003cli\u003eGet to work for a European leading company in the recruitment industry\u003c/li\u003e\n\u003cli\u003eRelocation support, and more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAre you ready to build with us on the ultimate customer journey and bring recruitment marketing to a new dimension?\u003c/strong\u003e Apply by clicking on the application form. Questions? You can reach out to \u003ca href=\"mailto:info@vonq.com\"\u003einfo@vonq.com\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.redirect.your-jobresponse.com/frontend_developer_rotterdam/256651/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.redirect.your-jobresponse.com/frontend_developer_rotterdam/256651/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjEwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--12a3c6ac8042b2d1fedf10917f74ebffc9a601d0/VONQ%20logojpg.jpg"},{"id":"f7c24055-a597-4834-b61f-80a9ba0c3972","type":"Full Time","url":"https://jobs.github.com/positions/f7c24055-a597-4834-b61f-80a9ba0c3972","created_at":"Mon Oct 14 12:17:32 UTC 2019","company":"Issuu ","company_url":"http:","location":"Copenhagen, Denmark","title":"Fullstack Developer (Copenhagen)","description":"\u003cp\u003eAt Issuu, we empower content creators through cutting edge tools, technology and services. We exist to help creators of longform, highly visual content build audiences and businesses. We're looking for a Fullstack Developer to join our ride.\u003c/p\u003e\n\u003cp\u003eWe are the right company for you, if you\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewant to work on a product that matters to a lot of people – We receive hundreds of visits per second and host over 50M+ documents,\nconsider yourself one of the best at what you do and you're looking for equally talented colleagues,\u003c/li\u003e\n\u003cli\u003eare self-driven and would never just want to take the next ticket,\u003c/li\u003e\n\u003cli\u003eare curious and never stopped learning and exploring new languages, technologies and solutions,\u003c/li\u003e\n\u003cli\u003eseek a culture where all voices matter when it comes to shaping the future of the product,\u003c/li\u003e\n\u003cli\u003ewant to work with colleagues who have ‘here to help’ attitude, and absolutely want to help you\nsucceed.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe believe you can help us succeed by\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003edelivering results that create value for the end users, while we ensure a high-performance,  high-availability, robust product that scale with our traffic (10.000++ requests/second ) and data-heavy platforms (100++ terabytes),\u003c/li\u003e\n\u003cli\u003eworking across disciplines, and take a holistic, end-2-end approach to software development,\nbeing at the forefront of development practices, Agile, Continuous Delivery, Software as Service, Cloud-based, Docker, React,\u003c/li\u003e\n\u003cli\u003eworking equally well creating back-end and front-end solutions that can run in production at the scale of our traffic,\u003c/li\u003e\n\u003cli\u003esolving problems from just about every area of computer science, including search, information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, big data and so on.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for someone who has\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea Master’s degree in CS or equivalent,\u003c/li\u003e\n\u003cli\u003eexperience with Functional Programming (E.g. OCaml, Erlang),\u003c/li\u003e\n\u003cli\u003ehas worked on 2+ large scale commercial projects taken from inception to production,\u003c/li\u003e\n\u003cli\u003eexperience with dynamically typed systems (e.g. Python, Javascript, Erlang),\u003c/li\u003e\n\u003cli\u003eexperience with C/C++ or other low-level languages with manual memory management,\u003c/li\u003e\n\u003cli\u003eexperience with scalable microservice architecture,\u003c/li\u003e\n\u003cli\u003ethe ability to work on any system, from code running in the browser to big data analytics dealing with terabytes of data,\u003c/li\u003e\n\u003cli\u003eexcellent communications skills in English,\u003c/li\u003e\n\u003cli\u003eopportunity to obtain a valid EU work permit.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCan you say yes to most of these qualifications? If you want to build truly scalable systems and work on something that matters, it’s time to apply!\u003c/p\u003e\n\u003cp\u003eOther things you should know are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewe're currently working on Issuu’s Story Cloud both on web and mobile apps, machine learning for better understanding of our content, internal analytics and our famous reading experience to mention a few examples,\u003c/li\u003e\n\u003cli\u003ewe currently use Python, OCaml, Javascript, Erlang and a bit of C++, and we’re extremely open to using new languages and/or technologies,\nour architecture is microservice-oriented using AMQP,\u003c/li\u003e\n\u003cli\u003ewe deploy multiple times a day on AWS and use Docker Swarm, MySQL, Redis, Node, etc.,\u003c/li\u003e\n\u003cli\u003ewe strive to be agile (Who doesn’t?), but we're not religious about Scrum, Kanban or any other methodology.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWould You Like to Join?\nWe're looking for the right person to join our team in Copenhagen and if it's you, don't hesitate to apply! In addition to the Engineering team, you find members from both Customer Success, Product, Design, Analytics and Management.\u003c/p\u003e\n\u003cp\u003eWe provide delicious catered lunches, regular outings and nice parties, but we also build arcade machines, design escape rooms, host video and craft beer evenings and have one of the slickest table tennis setups going around.\u003c/p\u003e\n\u003cp\u003eDig deeper.\nMost of our content creators are on a mission to change their world in some way. They are passionate and driven and we consider ourselves the same. Check some of them out:\nThe avantgarde Italian kids fashion magazine: \u003ca href=\"https://issuu.com/kidswearmagazine\"\u003ehttps://issuu.com/kidswearmagazine\u003c/a\u003e\nThe Danish outdoor garage start-up magazine: \u003ca href=\"https://issuu.com/outsite.org\"\u003ehttps://issuu.com/outsite.org\u003c/a\u003e\nThe Polish/Irish photographer: \u003ca href=\"https://issuu.com/thefix-analogue-magazine\"\u003ehttps://issuu.com/thefix-analogue-magazine\u003c/a\u003e\nThe American Meteorite Exchange Inc. Magazine: \u003ca href=\"https://issuu.com/meteorite-times\"\u003ehttps://issuu.com/meteorite-times\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe encourage everyone to apply regardless of race, religion, color, national origin, gender, sexual orientation, age, marital, veteran or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply using this link:\n\u003ca href=\"https://jobs.lever.co/issuu/e80e3f6e-4e2a-4e63-b6df-61f16d4b7209\"\u003ehttps://jobs.lever.co/issuu/e80e3f6e-4e2a-4e63-b6df-61f16d4b7209\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVowIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ebb6d9484a7de1393cf7a4c4fa4eb7260b6f5c84/issuu-logo-stacked-colour.jpg"},{"id":"9096c778-0807-4d8e-828f-9d579f233270","type":"Full Time","url":"https://jobs.github.com/positions/9096c778-0807-4d8e-828f-9d579f233270","created_at":"Mon Oct 14 07:42:55 UTC 2019","company":"ASML","company_url":"http://www.asml.com","location":"Veldhoven","title":"Senior Software Design Engineer","description":"\u003ch2\u003e\u003cstrong\u003eSenior Software Design Engineer\u003c/strong\u003e\u003c/h2\u003e\n\u003ch2\u003e\u003cstrong\u003eIn a nutshell\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eLOCATION\u003c/strong\u003e\nVeldhoven, Netherlands\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTEAM\u003c/strong\u003e\nResearch \u0026amp; development\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEXPERIENCE\u003c/strong\u003e\n3-7 years\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDEGREE\u003c/strong\u003e\nBachelor\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB CATEGORY\u003c/strong\u003e\nComputer science \u0026amp; software engineering\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTRAVEL\u003c/strong\u003e\nNo\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eIntroduction\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eASML is leading in the worldwide development, production and sales of high end lithography systems for the semiconductor industry. Worldwide over 20.000 people work at ASML, with important settlings in the United States, Asia and the head office in Veldhoven. The employees of ASML share the passion for technology with a customer focus. At ASML one works ongoing for the further development and implementation of complex and high-quality technological systems. Working at ASML is therefore challenging and extremely dynamic. To remain successful the company has ambitious objectives and high standard requirements.\nWithin ASML, the sector Development and Engineering is responsible for the specification, design, integration, qualification, and sustaining of all ASML products.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eJob Mission\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eOur software departments are expanding and we are looking for several Senior Design Engineers to join our teams!\u003c/p\u003e\n\u003cp\u003eWithin ASML, we have several software departments and each is specialized in creating, maintaining and configuring various complex software products.\nDepending on the department, you could be working on high tech Java products, or C# applications or on C/C++ applications on embedded Linux or algorithm programming.\nYou will provide the software solutions that make our machines complete and unique.\nIn close cooperation with colleagues from software and other disciplines (mechatronics, optics, electronics, physics) you are a member of a multi-disciplinary project team.\nYour solutions emerge from sound software engineering practice and take low effort to develop and maintain.\nYou are a high-quality driven engineer, you pay attention to every detail of your work and you leave no room for errors.\nYou want to work in a highly-complex environment where calculations and measurements are done at a nanometer level.\nYou want to impact the world with your work and you want your projects to reach millions of people worldwide.\nYou want to be respected for your work and you want to have some of the best engineers in the world as your colleagues.\u003c/p\u003e\n\u003cp\u003eHow about being part of the elite engineering team of ASML? After all, we are the largest producer of lithography machines in the world!\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eAt ASML, we use various programming languages, as per each department's needs.\nThe specificity of all of our teams is that they work in a highly complex, multidisciplinary environment which leaves no room for error in the live environment and for which quality is essential.\nYou will design, analyze, document and test the required software specifications.\nYou will use C/C++, Python, object oriented design programming and Linux within a highly complex embedded environment.\nYou will work in a multidisciplinary environment, involving physics, mechatronics, customer support and factory departments.\nYou will work on embedded or application level programming, on computer systems or software platforms, depending on your ambitions we will find you the best match as software designer at ASML.\nYou will work with C# or Java on application level programming.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eEducation\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eYou have aBSc., MSc., PhD or PdEng in Computer Science, Electrical Engineering, Aerospace Engineering, Mathematics, Physics, Electronics or similar technical domain.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eExperience\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eSoftware engineer with minimum 5-10 years of experience in large-scale software applications involving: embedded programming or algorithm development or application level programming on various types on layers and technologies.\nKey competencies for this role are Unix/Linux, C, C#, Java, C++, UML, Python, VxWorks, Matlab.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003ePersonal skills\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eYou should first of all be passionate about technology and should be excited by the idea that his work will impact millions of end-users worldwide.\nYou should be analytical, product and quality-oriented.\nYou like to investigate issues, you are creative in solving problems and you do not fear to present your solutions.\nYou are open-minded, you like to discuss about technical challenges and you want to push the boundaries of technology.\nYou are an innovator and you constantly seek to improve your knowledge and your work.\nYou are a role model for your team and they trust your technical as well as interpersonal and coaching skills.\nYou take ownership and you support your team, you are the backbone of your group.\nYou are client and quality oriented – you do not settle for second best solutions, but you strive to find the best ways to acquire top results.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eOther information\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHigh quality people are a key asset to our company. To recognize that, we offer highly competitive compensation and benefits packages to attract and retain the very best people and let them share in the success that they build. Our rewards philosophy is to attract and retain specific professional knowledge and competencies within the company by offering a competitive package in local markets where ASML is active.\nWe cannot process applications sent outside of the system, please use the application form if you are interested in our vacancies.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://asml.redirect.your-jobresponse.com/senior_software_design_engineer_veldhoven/256573/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://asml.redirect.your-jobresponse.com/senior_software_design_engineer_veldhoven/256573/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDEwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1236029ea4d5b00b9c82f41642ef74cd643d36d0/ASML-logo-.jpg"},{"id":"fa53ecb5-45f9-4242-a662-1858fcff966a","type":"Full Time","url":"https://jobs.github.com/positions/fa53ecb5-45f9-4242-a662-1858fcff966a","created_at":"Fri Oct 11 22:58:27 UTC 2019","company":"Gurtin Municipal Bond Management, a PIMCO Company","company_url":"https://www.gurtin.com/careers","location":"San Diego","title":"Full Stack Developer, C# and Angular","description":"\u003cp\u003eJob Description:\nGurtin Municipal Bond Management, a PIMCO Company, has earned a strong reputation for technical innovation through best-in-class portfolio management and credit research applications. Based in the Solana Beach office, a Senior .NET Engineer will join a dynamic software team responsible for the technology capabilities of a growing financial services company. This role will be engaged in developing custom financial software tools and integrations in a Microsoft .NET environment, currently using primarily C# and JavaScript as well as SQL Server. Engineers have the opportunity to participate in all aspects of the software development lifecycle including design, development, and ongoing improvements.\u003c/p\u003e\n\u003cp\u003eOn our innovative team, engineers are often in a position to build applications from the ground up as well as supporting current applications. This allows our team to gain experience with new and interesting tools while reinforcing skills in current widely used technologies. In this environment, developers can not only see how their work improves the firm’s operations on a daily basis, but also have the opportunity to experience dramatic and personal growth both intellectually and in their career progression. The ideal candidate will be motivated, curious, well organized, willing to learn, and have a passion for software development.\u003c/p\u003e\n\u003cp\u003eThis is an exciting time to join the Gurtin team given our recent partnership with PIMCO, one of the premiere fixed income managers in the country with 14 offices worldwide and $1.8 trillion AUM.  Our combined municipal assets exceed $40B.  Technology is a distinguished excellence for Gurtin; and this role will afford the ideal engineer a plethora of integration projects and opportunity to contribute and build/challenge their software development skills.\u003c/p\u003e\n\u003cp\u003ePrincipal Responsibilities:\nDesign and development of new tools and features for proprietary financial applications using C#, ASP.NET, MVC, JavaScript, and SQ.\nResearch new tools and methods, and help integrate them into existing systems or development procedures.\nProactively look for solutions to problems and use a balanced approach to solving those problems using software.\nTroubleshoot and resolve reported issues for applications.\u003c/p\u003e\n\u003cp\u003eRequirements/Qualifications:\nBachelor’s Degree in Computer Science, Engineering, or equivalent.\n5+ years development experience with .NET framework, preferably C#.\nExperience with JavaScript and associated UI Frameworks (Angular, JQuery) preferred.\nExperience with Microsoft SQL Server, queries, procedures, and views.\nStrong understanding of software best practices, scalability, optimization.\nMotivated by and enjoys solving business problems and seeing immediate impact on business users\nAbility to work independently or with a team, plan work, and handle multiple assignments simultaneously.\nStrong oral and written communication skills.\nStrong time and task management skills.\u003c/p\u003e\n\u003cp\u003eDesired Experience:\nWeb Application experience: C#, JavaScript, HTML, Bootstrap.\nWindows Services, WCF, and ASP.NET MVC.\nExperience with Java is a plus.\nMicrosoft Visual Studio and Team Foundation Server.\nAutomated build/deployment tools.\u003c/p\u003e\n\u003cp\u003eCompensation:\nBase compensation is commensurate with experience, and bonus is at the discretion of management.  This is a full time position and includes all benefits provided to full-time employees of the firm.\u003c/p\u003e\n\u003cp\u003eCompany Description:\nGurtin Municipal Bond Management, a PIMCO company, is an investment management firm founded on a simple premise: Do what you do best, and never settle. Serving high and ultra-high net-worth individuals, we provide focused expertise in managing investment-grade municipal portfolios that generate tax-free income. As of August 30, 2019, combined municipal assets under management across Gurtin and PIMCO totaled $40 billion. Recognized as a “Top Workplace” for the past three years in a row by the San Diego Union-Tribune, we offer a unique culture that combines the casual and collaborative work environment of the West Coast with the intensity, sophistication, and professionalism of Wall Street, and are always looking to invest in talented individuals who will excel at Gurtin. (Learn more about the Top Workplace award and selection methodology.)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease upload your resume here:\n\u003ca href=\"https://theapplicantmanager.com/jobs?pos=GU319\"\u003ehttps://theapplicantmanager.com/jobs?pos=GU319\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"788d329d-a032-440e-95ba-16f7501b7422","type":"Full Time","url":"https://jobs.github.com/positions/788d329d-a032-440e-95ba-16f7501b7422","created_at":"Fri Oct 11 20:33:30 UTC 2019","company":"Insomniac Design","company_url":"http://insomniacdesign.com","location":"Washington, DC","title":"Senior Web Developer (Full-Stack + Drupal)","description":"\u003cp\u003eAs a Senior Web Developer you will use your exceptional web development skills and experiences to architect and develop responsive Drupal websites and web applications. As a member of our world-class agency, you will work on innovative and inspired work across a variety of clients.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build/theme custom websites and applications\u003c/li\u003e\n\u003cli\u003eHigh level of expertise with technologies including PHP, Content Management Systems (Drupal 7 and Drupal 8), Laravel, Node, and Angular\u003c/li\u003e\n\u003cli\u003eInnovation in deliverables – show a strong desire and passion to implement new technologies to make the next project better than the last. We can always do better.\u003c/li\u003e\n\u003cli\u003eWork closely with creative team as necessary, to ensure proper implementation of designs to ensure adequate retention of user experience.\u003c/li\u003e\n\u003cli\u003eWork directly with creative director, designers, project managers, and user experience leads on assigned projects.\u003c/li\u003e\n\u003cli\u003eThorough cross-browser and cross-device testing of the product\u003c/li\u003e\n\u003cli\u003eProvide test scripts\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills \u0026amp; Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCandidates for this position must have previous experience developing large complex Drupal 7 and 8 enterprise web applications that include custom views and modules.\u003c/li\u003e\n\u003cli\u003e4+ years experience with responsive Drupal development and theming experience\u2028\u003c/li\u003e\n\u003cli\u003e4+ years experience in Object Oriented Design \u0026amp; Development\u003c/li\u003e\n\u003cli\u003e3+ years experience with REST API integrations and mastery of working with MySQL databases\u003c/li\u003e\n\u003cli\u003e3+ years in developing adaptive/responsive websites using frameworks such as Bootstrap as a minimum\u003c/li\u003e\n\u003cli\u003eExperience with implementing and configuring SOLR search\u003c/li\u003e\n\u003cli\u003eExceptional proficiency coding in PHP/HTML/CSS/JavaScript/Sass and Twig frameworks and consistently developing clean, semantic, valid markup\u003c/li\u003e\n\u003cli\u003eSome past experience developing application with the Symphony 2 Framework would be a big plus\u003c/li\u003e\n\u003cli\u003eAn expert in creating custom Drupal views and modules due to the nature of our projects – we are very creative.\u003c/li\u003e\n\u003cli\u003eAbility to analyze requirements and write detailed technical / functional specifications\u003c/li\u003e\n\u003cli\u003eAbility to work independently, prioritize tasks and hit deadlines in a fast-paced work environment\u2028\u003c/li\u003e\n\u003cli\u003eDemonstrates good judgment, excellent planning, problem-solving, troubleshooting, management, and communication (verbal and written) skills with the ability to think strategically, act quickly, multi-task, and work collaboratively in an environment that values creativity and flexibility to make things happen\u003c/li\u003e\n\u003cli\u003eDemonstrated experience working within fast-paced environments.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eApplicant Eligibility: Please note, only candidates who are US citizens or able to work on a permanent basis without visa sponsorship are eligible to apply. No recruiters or staffing agencies.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply at: \u003ca href=\"https://jobs.lever.co/insomniacdesign/c232da44-f6d5-4927-8d3e-e3404e9c33a5/apply\"\u003ehttps://jobs.lever.co/insomniacdesign/c232da44-f6d5-4927-8d3e-e3404e9c33a5/apply\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOnly applications via this link will be considered.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3QwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e36ee440ce7a441a0a9282fb3138af9459483339/InsomniacSymbol_pink.png"},{"id":"a9a347e5-7bc7-47a7-a83e-60083b737b61","type":"Full Time","url":"https://jobs.github.com/positions/a9a347e5-7bc7-47a7-a83e-60083b737b61","created_at":"Fri Oct 11 14:51:53 UTC 2019","company":"TMP Worldwide","company_url":"https://www.tmp.com/","location":"Chicago, Illinois","title":"Full Stack Developer - Chicago","description":"\u003cp\u003eOverview\u003c/p\u003e\n\u003cp\u003eWhen the world throws technology challenges at us, we eat them up. And then we ask for more. Welcome to life on the TMP technology team. Here, you’ll work on our scalable, evolving platform, face tremendous software challenges, and work on projects for Fortune 100 clients. You'll be part of a fiercely collaborative technology team charged with creating digital solutions that are transforming the way employers and job seekers connect. Developing next-generation applications and products for some of the most recognized brands in the world. And actively supporting our diverse suite of best-in-class technologies. All this in an environment that constantly challenges you to push beyond boundaries and enhance your expertise—with the support of a global team of industry experts. Sound like a fit for your talent and passion? Read on.\u003c/p\u003e\n\u003cp\u003eTMP is seeking a motivated individual to join our development team as Full Stack Engineer.\u003c/p\u003e\n\u003cp\u003eWhat does a great Full Stack Developer do?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eSetup, configure, maintain and enhance proper infrastructure to support\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNode.js and Python based MicroServices\u003c/li\u003e\n\u003cli\u003eData analytics-driven environments\u003c/li\u003e\n\u003cli\u003eCampaign management systems\u003c/li\u003e\n\u003cli\u003eMaintain and enhance large scale API system\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCode REST interfaces to support various internal/external requests\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCode Python and Node.js based microservices\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCode Unit / Integration tests to allow for embedding in continuous integration service\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDrive feature engineering and experimentation to improve the performance of our various algorithms\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEvaluate the technical tradeoffs of every decision\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eJoining TMP gives you an opportunity to collaborate with, learn from, and grow together with like-minded, successful tech veterans who have a track record of building great products.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo learn more about TMP Software Development and what we are working on- check out these links:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.tmp.com/tmp-technology-jobs\"\u003ehttps://www.tmp.com/tmp-technology-jobs\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eRequirements for consideration\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eQuick and critical thinker, ability to work with minimal supervision\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAble to build enterprise-grade software with minimal and changing requirements\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSelf-driven, independent, creative and eager to learn new skills\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExcellent and proven knowledge of JavaScript/Node.js/React\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExcellent and proven knowledge of Python\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGood knowledge of the following technologies :\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRedshift / Postgres / SQL / Sequelize\nDocker\nShell scripting\nAWS environments\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge of Rust is a plus\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProficiency in Git, JIRA, and Teamcity are a plus\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years in a production environment a plus\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJoin the global leader in talent acquisition technologies that’s committed to finding new ways to leverage software, strategy and creative to enhance our clients’ employer brands – across every connection point. We’re looking for unconventional thinkers. Relentless collaborators. And ferocious innovators. Talented individuals who are ready to work towards solutions that transform the way employers and job seekers connect.\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\u003c/p\u003e\n\u003cp\u003e#GDSoftware\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://bit.ly/full-stack-developer-chicago\"\u003ehttp://bit.ly/full-stack-developer-chicago\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1YwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1dd811a7e7cb7a0a5efa4566f79bd388cc08b863/tmp-large.png"}]