[{"id":"cb24f618-6f83-47eb-8685-113b3448d616","type":"Full Time","url":"https://jobs.github.com/positions/cb24f618-6f83-47eb-8685-113b3448d616","created_at":"Wed Oct 16 13:21:06 UTC 2019","company":"Pacific Life","company_url":"https://pacificlife.contacthr.com/72652299","location":"Aliso Viejo, CA","title":"Software Solutions Engineer/Lead/Architect-Java","description":"\u003cp\u003eFor more than 150 years, Pacific Life has offered innovative products and services including life insurance, annuities, and mutual funds, along with a variety of investment products, all of which provide The Power to Help You Succeed. We firmly believe each employee plays a part in our continued growth and success, and we pride ourselves in providing a work environment that is challenging, inclusive, collaborative, and results-oriented. With a powerful past and a strong future, Pacific Life offers an environment where you're empowered to achieve your personal best. In return, we look to your passion and insight to help us grow. For additional company information, including current financial strength ratings, visit \u003ca href=\"http://www.PacificLife.com\"\u003ewww.PacificLife.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCurrently, we are seeking a talented Software Solutions Engineer/Architect to join the Life Insurance Division in Aliso Viejo, CA. The Life Insurance Division works with financial and insurance professionals to give families and businesses the life insurance coverage needed to help meet important financial protection, wealth accumulation, and wealth preservation goals.\u003c/p\u003e\n\u003cp\u003ePOSITION SUMMARY\u003c/p\u003e\n\u003cp\u003eThis individual will be a part of the Commissions IT team comprised of Business Systems Analysts and Developers.  As a Solutions Architect, you will design, develop and support full stack web applications using a variety of technologies and development platforms, preferably using Java, Node.js and AWS cloud.  This role will help architect new solutions, while also supporting and enhancing existing systems.\u003c/p\u003e\n\u003cp\u003eEssential Duties and Responsibilities\u003c/p\u003e\n\u003cp\u003eArchitects complex projects across multiple systems and leads the development team in designing, building, testing and deploying software releases to support business objectives.\u003c/p\u003e\n\u003cp\u003e*Acts as a lead to the group on new technologies and industry trends; tries out new tools, technologies and makes recommendations on technology solutions for our applications\n*Partners with business and other IT teams in designing and implementing the solutions that streamline applications and data; makes informed decisions on issues such as sacrificing speed for quality and when to apply an appropriate technology\n*Has expert-level knowledge of latest technology currently in use by team; leads peer review meetings, provides input, receives feedback and implements necessary changes for design and code reviews\n*Partners with DevOps and infrastructure teams to implement deployment automation, infrastructure and security needs\n*Acts as subject matter expert for overall system solution; provides long term technical strategy for application integrations and software; identifies potential long-term problems ahead of time and designs software to alleviate those problems\n*Designs component-based software solutions with the intent of creating reusable components, or pieces of functionality\n*Designs software that is highly available, scalable and fast\n*Responds promptly to production outages, investigates root cause and suggests appropriate resolution\n*Participates in on-call rotation for nightly batch cycle\u003c/p\u003e\n\u003cp\u003eFACTORS FOR SUCCESS\n*Two plus years as a Technical Lead or Solutions Architect\n*Five plus years of hands-on Java development experience\n*Two plus years of Node.js \u0026amp; Angular development\n*AWS, Azure or other Cloud platform experience\n*Proficiency with SDLC methodologies including Waterfall and Agile\n*Object-oriented analysis, design and SOA know-how\n*Exposure to microservices, web service development (SOAP, REST/JSON) and XML based configuration\n*Understanding of relational database concepts; experience with MySQL, Postgres and MS SQL Server preferred\n*Advanced SQL and database design skills\n*Fluency in developing and deploying on Linux and Windows environments\n*Experience supporting apps with a batch component (nightly scheduled jobs)\n*Excellent oral and written communication skills; positive, team-oriented attitude\n*Bachelor's degree in Computer Science or related field\n*Previous experience in Financial Services industry and specifically with incentive compensation systems a plus\u003c/p\u003e\n\u003cp\u003eJoin the Pacific Life team and watch your career grow! We offer a competitive compensation and benefits package that includes: * Competitive salary and bonus program * Medical, dental, and vision as part our commitment in investing in the health and well being of our employees * Two retirement savings plans: 401k savings plan with company match and Company Retirement Contribution (company-paid) * Generous vacation time and holiday pay  * And much more!\u003c/p\u003e\n\u003cp\u003ePacific Life Insurance Company is an Equal Opportunity /Affirmative Action Employer, M/F/D/V.  If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request an accommodation, contact a Human Resources Representative at Pacific Life Insurance Company.\u003c/p\u003e\n\u003cp\u003eJOB REQUIREMENTS:\n\u003c/p\u003e\n\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72652299\"\u003ehttps://pacificlife.contacthr.com/72652299\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72652299\"\u003ehttps://pacificlife.contacthr.com/72652299\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"fa53ecb5-45f9-4242-a662-1858fcff966a","type":"Full Time","url":"https://jobs.github.com/positions/fa53ecb5-45f9-4242-a662-1858fcff966a","created_at":"Fri Oct 11 22:58:27 UTC 2019","company":"Gurtin Municipal Bond Management, a PIMCO Company","company_url":"https://www.gurtin.com/careers","location":"San Diego","title":"Full Stack Developer, C# and Angular","description":"\u003cp\u003eJob Description:\nGurtin Municipal Bond Management, a PIMCO Company, has earned a strong reputation for technical innovation through best-in-class portfolio management and credit research applications. Based in the Solana Beach office, a Senior .NET Engineer will join a dynamic software team responsible for the technology capabilities of a growing financial services company. This role will be engaged in developing custom financial software tools and integrations in a Microsoft .NET environment, currently using primarily C# and JavaScript as well as SQL Server. Engineers have the opportunity to participate in all aspects of the software development lifecycle including design, development, and ongoing improvements.\u003c/p\u003e\n\u003cp\u003eOn our innovative team, engineers are often in a position to build applications from the ground up as well as supporting current applications. This allows our team to gain experience with new and interesting tools while reinforcing skills in current widely used technologies. In this environment, developers can not only see how their work improves the firm’s operations on a daily basis, but also have the opportunity to experience dramatic and personal growth both intellectually and in their career progression. The ideal candidate will be motivated, curious, well organized, willing to learn, and have a passion for software development.\u003c/p\u003e\n\u003cp\u003eThis is an exciting time to join the Gurtin team given our recent partnership with PIMCO, one of the premiere fixed income managers in the country with 14 offices worldwide and $1.8 trillion AUM.  Our combined municipal assets exceed $40B.  Technology is a distinguished excellence for Gurtin; and this role will afford the ideal engineer a plethora of integration projects and opportunity to contribute and build/challenge their software development skills.\u003c/p\u003e\n\u003cp\u003ePrincipal Responsibilities:\nDesign and development of new tools and features for proprietary financial applications using C#, ASP.NET, MVC, JavaScript, and SQ.\nResearch new tools and methods, and help integrate them into existing systems or development procedures.\nProactively look for solutions to problems and use a balanced approach to solving those problems using software.\nTroubleshoot and resolve reported issues for applications.\u003c/p\u003e\n\u003cp\u003eRequirements/Qualifications:\nBachelor’s Degree in Computer Science, Engineering, or equivalent.\n5+ years development experience with .NET framework, preferably C#.\nExperience with JavaScript and associated UI Frameworks (Angular, JQuery) preferred.\nExperience with Microsoft SQL Server, queries, procedures, and views.\nStrong understanding of software best practices, scalability, optimization.\nMotivated by and enjoys solving business problems and seeing immediate impact on business users\nAbility to work independently or with a team, plan work, and handle multiple assignments simultaneously.\nStrong oral and written communication skills.\nStrong time and task management skills.\u003c/p\u003e\n\u003cp\u003eDesired Experience:\nWeb Application experience: C#, JavaScript, HTML, Bootstrap.\nWindows Services, WCF, and ASP.NET MVC.\nExperience with Java is a plus.\nMicrosoft Visual Studio and Team Foundation Server.\nAutomated build/deployment tools.\u003c/p\u003e\n\u003cp\u003eCompensation:\nBase compensation is commensurate with experience, and bonus is at the discretion of management.  This is a full time position and includes all benefits provided to full-time employees of the firm.\u003c/p\u003e\n\u003cp\u003eCompany Description:\nGurtin Municipal Bond Management, a PIMCO company, is an investment management firm founded on a simple premise: Do what you do best, and never settle. Serving high and ultra-high net-worth individuals, we provide focused expertise in managing investment-grade municipal portfolios that generate tax-free income. As of August 30, 2019, combined municipal assets under management across Gurtin and PIMCO totaled $40 billion. Recognized as a “Top Workplace” for the past three years in a row by the San Diego Union-Tribune, we offer a unique culture that combines the casual and collaborative work environment of the West Coast with the intensity, sophistication, and professionalism of Wall Street, and are always looking to invest in talented individuals who will excel at Gurtin. (Learn more about the Top Workplace award and selection methodology.)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease upload your resume here:\n\u003ca href=\"https://theapplicantmanager.com/jobs?pos=GU319\"\u003ehttps://theapplicantmanager.com/jobs?pos=GU319\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"be2b29b3-9be3-40dc-aa03-76b112acd03b","type":"Full Time","url":"https://jobs.github.com/positions/be2b29b3-9be3-40dc-aa03-76b112acd03b","created_at":"Wed Oct 09 19:35:08 UTC 2019","company":"Vouch","company_url":"http://vouch.us","location":"San Francisco","title":"Senior Frontend Engineer","description":"\u003cp\u003eAbout us:\nInsurance... sounds slow, old-fashioned, and unexciting. Exactly. Insurance is broken, and it's failing fast-moving, innovative startups.\u003c/p\u003e\n\u003cp\u003eVouch is a new, technology-first insurance company, backed with $24.5M in funding from world-class investors. Like Stripe for payments or Brex for credit cards, Vouch is creating the go-to business insurance for startups.\u003c/p\u003e\n\u003cp\u003eWe're doing this by making insurance fast, responsive, and focused on our customer - startup founders. Instead of printed PDF applications and week-long waits, Vouch is building new technology to solve real problems, writing policies that actually cover relevant startup scenarios, and designing simple experiences in an otherwise frustrating industry.\u003c/p\u003e\n\u003cp\u003eThe Role:\nVouch is looking for a Front End Engineer to join our team.  You will have the opportunity to quickly contribute critical code and help to shape fundamental aspects of our codebase and engineering culture.\u003c/p\u003e\n\u003cp\u003eOur Ideal Candidate:\n5+ years of industry experience writing front-end production code\nExpert in one or more modern JavaScript frameworks like Vue, React or Angular (in order of preference)\nStrong understanding of the latest ES standards and language features\nBuild reusable front-end interfaces and components with various levels of abstraction\nCollaborate closely with product and design teams to build new features and beautiful interactive interfaces in mobile and desktop environments\nStrong understanding of modern asynchronous architecture (lazy/optimistic loading, handling 'offline' application state, etc.)\nStrong understanding of how to measure and optimize front-end performance and pagespeed metrics\nNice to haves:\nExposure to developing full stack in different programming languages (preferably Ruby/Python)\nExperience with Typescript\nExperience working with and building REST APIs as well as API design principles and best practices\u003c/p\u003e\n\u003cp\u003eWhat We Offer:\nMedical/Dental/Vision insurance\nReimbursements for cell, commuter benefits, and wellness (gym, classpass, etc.)\u003c/p\u003e\n\u003cp\u003eVouch is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here:\n\u003ca href=\"https://grnh.se/bd0861b81\"\u003ehttps://grnh.se/bd0861b81\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUowIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--467ec45230f320bbe663b1f59b5b416d65d8471b/V.png"},{"id":"e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3","type":"Full Time","url":"https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3","created_at":"Sat Aug 03 00:50:23 UTC 2019","company":"Game Closure","company_url":"http://gameclosure.com","location":"San Francisco, Mountain View, Tokyo, Remote","title":"Senior Game Engineer (REMOTE)","description":"\u003cp\u003eGAME CLOSURE\u003c/p\u003e\n\u003cp\u003eSan Francisco, Mountain View, Tokyo, Remote  -  Full Time\u003c/p\u003e\n\u003cp\u003eGame Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.\u003c/p\u003e\n\u003cp\u003eIt's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end\u003c/li\u003e\n\u003cli\u003eBe the champion for the user!\u003c/li\u003e\n\u003cli\u003eInsist on the highest standards and create functional and engaging features that will delight our users\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gaming\u003c/li\u003e\n\u003cli\u003eInnovate and iterate on process, systems and technology to deliver world­-class social games\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eProficient at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with analytics and A/B testing in mobile games\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf starter, analytical and creative\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eCheck out Everwing on Facebook Instant Games in Messenger. Can you build this game?\u003c/li\u003e\n\u003cli\u003eUnderstanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003cli\u003eExpert knowledge of TypeScript\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eGC Perks:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, Dental, \u0026amp; Vision: Top quality insurance options with 100% of premiums covered\u003c/li\u003e\n\u003cli\u003eSocial Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more\u003c/li\u003e\n\u003cli\u003eCommuter Pass + Free Parking: Your commute and parking to the office is on us!\u003c/li\u003e\n\u003cli\u003ePTO: Unlimited vacation policy\u003c/li\u003e\n\u003cli\u003eMeals: Free daily lunches, well stocked kitchen, healthy snacks and drinks\u003c/li\u003e\n\u003cli\u003ePet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"},{"id":"485a0e0a-aeed-4a38-88bb-56b44de83dc2","type":"Full Time","url":"https://jobs.github.com/positions/485a0e0a-aeed-4a38-88bb-56b44de83dc2","created_at":"Fri Oct 04 23:59:24 UTC 2019","company":"VS Media, Inc.","company_url":"https://www.vsmedia.com/","location":"Thousand Oaks, CA","title":"Frontend Designer (Graphics + CSS + HTML)","description":"\u003cp\u003eFrontend Designer (Graphics + CSS + HTML)\u003c/p\u003e\n\u003cp\u003e(Westlake Village, CA)\u003c/p\u003e\n\u003cp\u003eFounded in June 1996, VS Media is an industry leader specializing in highly interactive, high-traffic, live video chat websites. Spanning the globe with over 200 million visitors per month and 80 million ads per day, we provide a platform for people to discover new kinds of interactive content through live video and chat services. Our size and scale stretches across every continent, delivering powerful technology to enhance our clients’ online presence. From streaming live video to billing solutions to gamification development, we leverage the latest technology to provide the best digital experience possible.\u003c/p\u003e\n\u003cp\u003eAbout the Job\u003c/p\u003e\n\u003cp\u003eWe currently have an experienced-level position open for a Frontend Designer with a desire to learn and strong attention to detail that can help augment our existing team. The ideal candidate would be well-rounded with a variety of experience in interaction, UI and UX design. This is a full-time position in our Westlake Village office. Given the responsibilities involved with this position, we cannot accept candidates who would work remotely.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAble to create clean aesthetically appealing web designs for clients, users and internal products.\u003c/li\u003e\n\u003cli\u003eAble to confidently articulate how a design solution answers user needs, business goals, technical constraints and other projects facets, as well as translate that solution into a premium visual design.\u003c/li\u003e\n\u003cli\u003eResponsible for implementing designs/layouts (made by you or others) that user will see and interact with in a web application.\u003c/li\u003e\n\u003cli\u003eResponsible for building reusable code and libraries for future use.\u003c/li\u003e\n\u003cli\u003eResponsible for optimizing applications for maximum speed and scalability.\u003c/li\u003e\n\u003cli\u003eHand coding all HTML/CSS.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualification Requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of professional experience with interaction/visual design for web development.\u003c/li\u003e\n\u003cli\u003eExpert at web markup (HTML, CSS). We need a frontend designer who can design and code without a premade theme or CMS.\u003c/li\u003e\n\u003cli\u003eStrong frontend design portfolio of pertinent work is required (a link to your portfolio is required).\u003c/li\u003e\n\u003cli\u003eMust be able to create responsive as well as adaptive websites. Must be able to make webpages mobile friendly and pass all google mobile tests.\u003c/li\u003e\n\u003cli\u003eAbreast of UI design best practices, trends and techniques.\u003c/li\u003e\n\u003cli\u003eCreating wireframes.\u003c/li\u003e\n\u003cli\u003eAbility to work well in a team environment.\u003c/li\u003e\n\u003cli\u003eUnderstanding of vanilla JavaScript, a plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs we are an internet-focused tech company, please note that we do manage adult-oriented content. This position directly involves working around such explicit material on a daily basis, therefore it is imperative that the ideal candidate have no issue with this aspect of the business. Please take a look at \u003ca href=\"https://www.flirt4free.com\"\u003ehttps://www.flirt4free.com\u003c/a\u003e for an example. VS Media understands and respects that such content is not suitable for all applicants.\u003c/p\u003e\n\u003cp\u003eFor consideration, please send along a resume, cover letter, portfolio link and salary requirements.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on our company website, and include a link to your portfolio with relevant work samples. \u003ca href=\"https://vsmedia.bamboohr.com/jobs/\"\u003ehttps://vsmedia.bamboohr.com/jobs/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlZ6IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f96ff92a02bddd1fc780c5b59735f1cacc5bec7/VSM%20Logo.jpg"},{"id":"bef92653-9ad7-4fb2-bacf-d4e3cd4b90a3","type":"Full Time","url":"https://jobs.github.com/positions/bef92653-9ad7-4fb2-bacf-d4e3cd4b90a3","created_at":"Thu Oct 03 23:13:17 UTC 2019","company":"Expensify","company_url":"http://Expensify","location":"San Francisco","title":"Web Full Stack Engineer","description":"\u003cp\u003e\u003cstrong\u003eYour Mission, Should You Choose to Accept:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin our passionate team of top-notch engineers to solve a real-world problem, and help people spend less time managing expenses and more time pursuing their real goals. As we revolutionize the way people manage their expenses, being part of the Expensify team means building the easiest, fastest, and most efficient platform to automate everything expense-related.\u003c/p\u003e\n\u003cp\u003eEven though we work hard at Expensify, we make sure our employees are happy. Our most talked about perk is our Offshore where we spend a month abroad working from a remote location as a team. This year we’re going to Vietnam, do you want to join?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhether you’re building features like calendar integrations, importing credit card transactions, or pulling information from receipts, you’re self-driven and collaborative. You’re an autonomous individual who is passionate about writing beautiful and concise code. You’re willing to work with other engineers, designers, and customer-facing teams to turn our dreams into reality.\u003c/p\u003e\n\u003cp\u003eAs a Web Full Stack Engineer, your responsibilities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eSquashing bugs: big, small, and hairy!\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePlanning, building, and maintaining cross-stack features like accounting integrations, advanced receipt scanning, and more.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGuiding and enabling others in the organization: we'll share our editor tricks, dotfiles, and productive workflows. Share yours!\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAsking questions about things you don’t understand and challenging the status quo.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor the best possible fit, we are looking for someone who:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eHas experience writing real-world software to solve real-world problems.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommunicates well, both interpersonally and in their code.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIs a natural problem solver, knows how to solve problems by automating their solutions.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstands the role and impact that programming can have on the organization as a whole.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWants to develop and grow their skills in programming and leadership within the organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for people who have a strong understanding of algorithms and design patterns that can apply those concepts into a production level codebase. Knowledge and experience with Javascript, PHP, C++, Java, iOS or Android is a plus. This position is the foundation for launching a career with Expensify, with the expectation that you’ll carry these skills into new domains.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation \u0026amp; Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eFull-time, salaried position\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e401k with employer match\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e100% Medical/Dental/Vision contributions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommuter benefits\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFree lunch\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFlexible vacation policy\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork from home when you need to\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNext Steps\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApplying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time-consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way to help us out is by answering the following questions:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eWhat's the URL of your website? If you don't have one, why not?\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhat's your coding history? When did you start, and what have you done between then and now?\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhat do you want to do with the rest of your life, and how is Expensify a step toward your long-term goals?\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHow did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eResume not your thing? That’s great, we don’t really read them anyway! Forward your responses to the questions to \u003ca href=\"mailto:jobs@expensify.com\"\u003ejobs@expensify.com\u003c/a\u003e. We're excited to hear from you!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://we.are.expensify.com\"\u003ehttps://we.are.expensify.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXB6IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfd776b9566d92e661c9d77815261eeac8c3074c/expensify-app-logo.png"},{"id":"8ac44442-1d92-48f9-b7b8-969a1ed462e9","type":"Full Time","url":"https://jobs.github.com/positions/8ac44442-1d92-48f9-b7b8-969a1ed462e9","created_at":"Thu Oct 03 20:44:29 UTC 2019","company":"Scale Inc","company_url":"http:","location":"Sherman Oaks","title":"Senior Software Engineer (PHP)","description":"\u003cp\u003eScale is an upstart eCommerce company creating best-in-class medical supplements and beauty products. We use an analytical approach and technology to power our growth engine, and are looking for  an experienced senior full-stack engineer to join and help build and improve our web properties. You’ll work with our team of engineers to build and maintain features that create rich and compelling experiences for our customers, and expand the platform that drives our business operations.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eWrite and maintain code primarily in PHP and JavaScript (along with other languages as needed)\nDesign / architect / build new applications, features, and tools\nHelp improve system performance and scalability\nHelp track down and fix system bugs\nHelp mentor junior developers\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003e5+ years experience developing web applications\n3+ years of PHP experience with an MVC framework\nExperience with frontend Javascript libraries/frameworks (jQuery, React, Angular)\nExperience building and consuming APIs and web services\nExperience working with relational databases such as MySQL containing large amounts of data\nStrong grasp of technologies across the stack from the browser to the server\nStrong understanding of the browser DOM\nStrong communication skills both written and verbal\u003c/p\u003e\n\u003cp\u003eBonus Qualifications:\u003c/p\u003e\n\u003cp\u003eExperience with Node.js\nExperience with additional languages such as Go, Python, Java, etc.\nHands on experience with containerization and orchestration (Docker / Kubernetes)\nContributions to open source projects\u003c/p\u003e\n\u003cp\u003eWho We Are:\u003c/p\u003e\n\u003cp\u003eScale owns and operates several brands in the health and beauty verticals (our biggest - \u003ca href=\"https://1md.org\"\u003ehttps://1md.org\u003c/a\u003e, \u003ca href=\"https://hairlavie.com\"\u003ehttps://hairlavie.com\u003c/a\u003e). We formulate best-in-class supplement and care products based on clinical studies and in partnership with doctors and medical labs.\nWe sell our products online on eCommerce websites that are powered by our in-house eCommerce platform, built with the Zend Framework (LEMP stack). Our eCommerce platform controls every aspect of our websites as well as many of our business operations, such as customer service, inventory management, deep reporting and analytics and much more.\u003c/p\u003e\n\u003cp\u003eWhy You Should Join:\u003c/p\u003e\n\u003cp\u003eAt Scale you’ll be joining our existing team of skilled and passionate developers in a leadership position, and will have the opportunity to greatly impact the technical direction of our company. Technology provides the infrastructure to everything we do, and your contribution can determine the success and growth of our company.\u003c/p\u003e\n\u003cp\u003eDevelopment work at Scale is varied and challenging. We’re always trying to push the envelope with how we can use technology to drive business processes. We collect and process large amount of data to inform business decisions on a daily basis. We are constantly optimizing and improving the user experience we provide our customers.\u003c/p\u003e\n\u003cp\u003eIf this sounds like a workplace you could thrive in, we would love to hear from you!\u003c/p\u003e\n\u003cp\u003eWhy You Should Join:\u003c/p\u003e\n\u003cp\u003eAt Scale you’ll be joining our existing team of skilled and passionate developers in a leadership position, and will have the opportunity to greatly impact the technical direction of our company. Technology provides the infrastructure to everything we do, and your contribution can determine the success and growth of our company.\u003c/p\u003e\n\u003cp\u003eDevelopment work at Scale is varied and challenging. We’re always trying to push the envelope with how we can use technology to drive business processes. We collect and process large amount of data to inform business decisions on a daily basis. We are constantly optimizing and improving the user experience we provide our customers.\u003c/p\u003e\n\u003cp\u003eIf this sounds like a workplace you could thrive in, we would love to hear from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:Recruitment@scale.tech\"\u003eRecruitment@scale.tech\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"97479b00-c22f-472d-875f-b2653b9c52ab","type":"Full Time","url":"https://jobs.github.com/positions/97479b00-c22f-472d-875f-b2653b9c52ab","created_at":"Fri Sep 27 22:54:55 UTC 2019","company":"Stealth","company_url":"http:","location":"Los Angeles, CA","title":"Front End Web Developer","description":"\u003cp\u003eGreat opportunity for experienced Front-End Developer to implement new design across desktop, tablet and mobile views for existing (PHP) Enthusiast multi-media platform by providing hourly contract support working with senior management team.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCode SCSS/HTML5 designs to be responsive/adaptive for desktop/tablet \u0026amp; mobile views for existing PHP-developed platform\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOnline Web Portfolio demonstrating 3+ years professional UIUX, HTML, SCSS experience website front-end development\u003c/li\u003e\n\u003cli\u003e3 years of JavaScript experience\u003c/li\u003e\n\u003cli\u003eExpert understanding of browser compatibility issues\u003c/li\u003e\n\u003cli\u003eComfortable with Git and Webpack (or Gulp)\u003c/li\u003e\n\u003cli\u003eConfident, agile creative self-starting team player with stellar attention-to-detail\u003c/li\u003e\n\u003cli\u003eAccustomed to quick turnaround responding to customer takeaways\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNice to have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with CodeIgniter or other MVC framework\u003c/li\u003e\n\u003cli\u003eExperience with ReactJS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePosition\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContract-to-hire position working in-house (Century City) - devices provided\u003c/li\u003e\n\u003cli\u003eMinimum one month engagement\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation\n$60,000 - $70,000\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:pashjayc@gmail.com\"\u003epashjayc@gmail.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"05e76964-a9fe-4fcf-b4bb-cf1b74250248","type":"Full Time","url":"https://jobs.github.com/positions/05e76964-a9fe-4fcf-b4bb-cf1b74250248","created_at":"Fri Sep 27 12:35:29 UTC 2019","company":"Pacific Life","company_url":null,"location":"Aliso Viejo, CA","title":"Solutions Architect","description":"\u003cp\u003eFor more than 150 years, Pacific Life has offered innovative products and services including life insurance, annuities, and mutual funds, along with a variety of investment products, all of which provide The Power to Help You Succeed. We firmly believe each employee plays a part in our continued growth and success, and we pride ourselves in providing a work environment that is challenging, inclusive, collaborative, and results-oriented. With a powerful past and a strong future, Pacific Life offers an environment where you're empowered to achieve your personal best. In return, we look to your passion and insight to help us grow. For additional company information, including current financial strength ratings, visit \u003ca href=\"http://www.PacificLife.com\"\u003ewww.PacificLife.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCurrently, we are seeking a talented Solutions Architect to join the Life Insurance Division in Aliso Viejo, CA. The Life Insurance Division works with financial and insurance professionals to give families and businesses the life insurance coverage needed to help meet important financial protection, wealth accumulation, and wealth preservation goals.\u003c/p\u003e\n\u003cp\u003ePOSITION SUMMARY\nThis individual will be a part of the eBusiness team comprised of Business Systems Analysts and .NET Developers.  As a Solutions Architect, you will design and develop full stack web applications using a variety of technologies and development platforms, preferably using .NET, Azure and AWS cloud.  This role will perform independent research to understand and master emerging technologies in the industry and provide technical leadership on complex projects.  Formulates and defines system scope and objectives and develops application software to solve highly complex problems requiring a high degree of ingenuity and innovation.  Are you a team player who has a vigorous interest in Cloud technologies, is solutions-oriented and strives to deliver top-quality deliverables?\u003c/p\u003e\n\u003cp\u003eEssential Duties \u0026amp; Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitecting complex projects across multiple systems and leading the development team in designing, build, test and deploy software releases to support the business objectives. (Required)\u003c/li\u003e\n\u003cli\u003eActs as a lead to the group on new technologies and industry trends; tries out new tools, technologies and makes recommendations on technology solutions for our applications\u003c/li\u003e\n\u003cli\u003ePartners with business and other IT teams in designing and implementing the solutions that streamline applications and data; make informed decisions on issues such as sacrificing speed for quality and ease of development versus clarity and when to apply an appropriate technology\u003c/li\u003e\n\u003cli\u003eHas expert-level knowledge of latest technology currently in use by team; leads peer review meetings, provides input, receives feedback and implements necessary changes for design and code reviews\u003c/li\u003e\n\u003cli\u003ePartners with DevOps and CIT to implement any infrastructure and security needs\u003c/li\u003e\n\u003cli\u003eActs as subject matter expert for overall system solution; provides long term technical strategy for application integrations and software; identifies potential long-term problems ahead of time and designs software to alleviate those problems. Designs component-based software solutions with the intent of creating reusable components, or pieces of functionality.  Designs software that is highly available, scalable and fast\u003c/li\u003e\n\u003cli\u003eDevelops innovative approaches to web and component-based software development at Pacific Life; serves as department technical expert and Mentor other developers to improve their designs and documentation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFACTORS FOR SUCCESS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e8+ years progressive technology experience in web application development using .NET, including 3+ years of Cloud development experience, using Azure and/or AWS (required).\u003c/li\u003e\n\u003cli\u003eStrong understanding of agile methodology and experience working with cross functional teams.\u003c/li\u003e\n\u003cli\u003eStrong development experience in .NET, C#, ASP.NET, HTML5, CSS, Bootstrap, SaaS; also, be familiar with databases - SQL Server, NOSQL\u003c/li\u003e\n\u003cli\u003e3+ years of development experience in Angular, React, Jquery, nodeJS, Gulp, webpack, Swagger API, TFS, VSTS, GIT, and Jenkins\u003c/li\u003e\n\u003cli\u003eExperience in cross-platform application integration (Java, .NET)\u003c/li\u003e\n\u003cli\u003eFamiliarity with Google APIs, AWS, or other Cloud APIs\u003c/li\u003e\n\u003cli\u003eExperience with testing tools - Jasmine, Karma, Robot Framework\u003c/li\u003e\n\u003cli\u003eProven leadership, organizational, interpersonal, analytical and problem-solving skills\u003c/li\u003e\n\u003cli\u003eStrong team building, partnership and collaboration skills\u003c/li\u003e\n\u003cli\u003eDemonstrate ability to prioritize/communicate conflicting demands in a fast-paced environment.\u003c/li\u003e\n\u003cli\u003eSelf-starter, ability to work independently with strong initiative, lead and mentor team members\u003c/li\u003e\n\u003cli\u003eA Bachelor's degree in Information Systems or Computer Science\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e#LI-DD1\u003c/p\u003e\n\u003cp\u003eJoin the Pacific Life team and watch your career grow! We offer a competitive compensation and benefits package that includes: * Competitive salary and bonus program * Medical, dental, and vision as part our commitment in investing in the health and wellbeing of our employees * Two retirement savings plans: 401k savings plan with company match and Company Retirement Contribution (company-paid) * Generous vacation time and holiday pay  * And much more!\u003c/p\u003e\n\u003cp\u003ePacific Life Insurance Company is an Equal Opportunity /Affirmative Action Employer, M/F/D/V.  If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request an accommodation, contact a Human Resources Representative at Pacific Life Insurance Company.\u003c/p\u003e\n\u003cp\u003eJOB REQUIREMENTS:\n\u003c/p\u003e\n\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72241029\"\u003ehttps://pacificlife.contacthr.com/72241029\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72241029\"\u003ehttps://pacificlife.contacthr.com/72241029\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"439f06ca-1599-4de8-9e65-e00f7767776a","type":"Full Time","url":"https://jobs.github.com/positions/439f06ca-1599-4de8-9e65-e00f7767776a","created_at":"Fri Sep 27 12:30:07 UTC 2019","company":"Pacific Life","company_url":null,"location":"Aliso Viejo, CA","title":"Lead Architect","description":"\u003cp\u003eFor more than 150 years, Pacific Life has offered innovative products and services including life insurance, annuities, and mutual funds, along with a variety of investment products, all of which provide The Power to Help You Succeed. We firmly believe each employee plays a part in our continued growth and success, and we pride ourselves in providing a work environment that is challenging, inclusive, collaborative, and results-oriented. With a powerful past and a strong future, Pacific Life offers an environment where you're empowered to achieve your personal best. In return, we look to your passion and insight to help us grow. For additional company information, including current financial strength ratings, visit \u003ca href=\"http://www.PacificLife.com\"\u003ewww.PacificLife.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCurrently, we are seeking a talented Lead Architect to join the Life Insurance Division in Aliso Viejo, CA. The Life Insurance Division works with financial and insurance professionals to give families and businesses the life insurance coverage needed to help meet important financial protection, wealth accumulation, and wealth preservation goals.\u003c/p\u003e\n\u003cp\u003ePOSITION SUMMARY\nResponsible for partnering across our product, Innovations, and technology teams to bring innovative solutions to bear, whether through Third-Party Administrators (TPAs), other external or internal partners, with a particular focus on the new Bite-Size product offering.  Includes working with peers across IT to manage the delivery and support of internal technology solutions leveraging TPAs as well as coordination of TPA developed solutions.  Evaluates new opportunities based on strategic need and provides input into the division's IT strategy.\u003c/p\u003e\n\u003cp\u003eEssential Duties and Responsibilities\u003c/p\u003e\n\u003cp\u003e*Partners with key business stakeholders to understand current \u0026amp; future business needs and provides sustainable \u0026amp; cost-effective technology solutions involving the division's third-party administrators (TPAs)\n*Oversees technology matters related to the division's IT Product TPAs; including integration design, delivery of technical requirements, SLA and escalation management\n*Leads the IT team supporting the division's TPA integration technology platforms; including architecture, analysis, development, testing and production support\n*Provides architectural and technical guidance to team as needed\n*Evaluates new TPA opportunities based on strategic need\n*Remains current on TPA trends and capabilities; incorporating relevant data into the division's IT strategy\n*Serves as a liaison between the Enterprise Architecture and managed delivery teams; translating relevant components of the technology strategy to ensure alignment of solutions and deliverables.\u003c/p\u003e\n\u003cp\u003eFACTORS FOR SUCCESS\u003c/p\u003e\n\u003cp\u003e*Bachelor's Degree in Computer Science, Computer Engineering, MIS or related field\n*5-7 years in a technology delivery role as a developer, technical lead or solution architect\n*2-3 years as a solution architect designing integrated solutions across multiple technologies and platforms (preferable in the life insurance industry)\n*Demonstrated ability to guide the work of staff members and provide technical guidance as required\n*Experience delivering stable, scalable and maintainable integrated solutions through collaborative partnerships across multiple technology teams and stakeholders\n*Working knowledge of multiple programming languages (ex: Java, JavaScript, .NET, COBOL, etc.)\n*Experience utilizing one or more modern integration technologies (ex: MuleSoft, DataPower, BizTalk, etc.)\n*Basic understanding of Web design and underlying modern frameworks (ex: TypeScript, Angular, RxJS, etc.)\n*Familiarity with Cloud architectures \u0026amp; platforms and designing hybrid Cloud solutions\n*Basic understanding of modern security principals and how to architect and develop secure solutions\u003c/p\u003e\n\u003cp\u003eKey Competencies:\u003c/p\u003e\n\u003cp\u003e*Ability to thrive in an agile environment and quickly adapt to changes in business demands\n*Outside the box thinker with a balanced approach to R\u0026amp;D and a pragmatic approach to developing solutions\n*Ability to apply and execute strategic direction and business objectives\n*Comfortable managing through ambiguity while information necessary to deliver a comprehensive solution evolves\n*Capable of solving complex problems in areas outside of domain expertise\n*Ability to multi-task and juggle competing priorities\n*Comfortable working in a fast paced, goal-oriented \u0026amp; outcome focused environment with limited supervision\n*Comfortable working on a team geographically dispersed across the US and around the globe\u003c/p\u003e\n\u003cp\u003e#LI-DD1\u003c/p\u003e\n\u003cp\u003eJoin the Pacific Life team and watch your career grow! We offer a competitive compensation and benefits package that includes: * Competitive salary and bonus program * Medical, dental, and vision as part our commitment in investing in the health and wellbeing of our employees * Two retirement savings plans: 401k savings plan with company match and Company Retirement Contribution (company-paid) * Generous vacation time and holiday pay  * And much more!\u003c/p\u003e\n\u003cp\u003ePacific Life Insurance Company is an Equal Opportunity /Affirmative Action Employer, M/F/D/V.  If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request an accommodation, contact a Human Resources Representative at Pacific Life Insurance Company.\u003c/p\u003e\n\u003cp\u003eJOB REQUIREMENTS:\n\u003c/p\u003e\n\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72236745\"\u003ehttps://pacificlife.contacthr.com/72236745\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply for this position, please copy and paste the following link into your browser address bar:\n\u003ca href=\"https://pacificlife.contacthr.com/72236745\"\u003ehttps://pacificlife.contacthr.com/72236745\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"1639d216-ea0c-4078-8c5b-1a5b29d3c28b","type":"Full Time","url":"https://jobs.github.com/positions/1639d216-ea0c-4078-8c5b-1a5b29d3c28b","created_at":"Tue Sep 24 17:13:39 UTC 2019","company":"LeanData","company_url":"https://www.leandatainc.com/","location":"Sunnyvale","title":"Software Engineer","description":"\u003cp\u003e\u003cstrong\u003eAre you excited about working with a world-class team to build market-leading SaaS products that accelerate revenue for some of the world’s biggest brands?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Software Engineer at LeanData, you’ll be using your creative, collaborative and engineering skills to develop new products and features for our Salesforce.com SaaS application. You’ll be working in a fast-paced, high-growth environment as key member of our engineering team.\u003c/p\u003e\n\u003cp\u003eWe're looking for engineers who love to take on responsibility and bring unique ideas to challenging projects.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities (what you’ll be doing):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCollaborate to develop new products and features for our Salesforce.com SaaS application\u003c/li\u003e\n\u003cli\u003eDesign and develop a processing platform using various configuration management technologies.\u003c/li\u003e\n\u003cli\u003eTest software development methodology in an agile environment.\u003c/li\u003e\n\u003cli\u003eProvide ongoing maintenance, support and enhancements in existing systems and platforms.\u003c/li\u003e\n\u003cli\u003eCollaborate cross-functionally with business users, project managers and other engineers\u003c/li\u003e\n\u003cli\u003eProvide recommendations for continuous improvement.\u003c/li\u003e\n\u003cli\u003eWork alongside other engineers on the team to consistently apply best practices.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications (What you’ll need to have):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of some or all of the following: Java, SQL, Salesforce Apex, Javascript, jQuery, Angular\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies that will give the company a competitive edge·\u003c/li\u003e\n\u003cli\u003eThrive in a fast-paced environment in a rapidly growing startup·\u003c/li\u003e\n\u003cli\u003ePassion for coding demonstrated in your work and side projects·\u003c/li\u003e\n\u003cli\u003eAbility to understand customer needs and translate those into software features\u003c/li\u003e\n\u003cli\u003eAbility to work in Sunnyvale on a daily basis\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you (we’d like you to have):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e1+ years of experience\u003c/li\u003e\n\u003cli\u003eExperience in a start-up environment,\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAt this time, we are unable to provide visa sponsorship.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout LeanData:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLeanData provides the market’s leading Revenue Ops platform enabling high-growth B2B companies to improve the buyer experience and accelerate time to revenue. As the leader in Lead-to-Account Matching, Routing and Marketing Attribution solutions, LeanData stands at the center of CRM, connecting the right data to the right people at the right time across the go-to-market process.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy work at LeanData:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLeanData covers employee insurance premiums up to 90%.\u003c/li\u003e\n\u003cli\u003eUnlimited PTO\u003c/li\u003e\n\u003cli\u003e10 company holidays\u003c/li\u003e\n\u003cli\u003eCommuter benefits for Caltrain\u003c/li\u003e\n\u003cli\u003eLaptop vesting program\u003c/li\u003e\n\u003cli\u003eSnacks and drinks provided daily\u003c/li\u003e\n\u003cli\u003e401K plan\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eWe warmly welcome into the LeanData family all persons without regard to ethnic and racial identity, indigenous heritage, national origin, religion, gender, gender identity, gender expression, sexual orientation, age, disability, marital status, veteran status, genetic information, or any other legally protected status.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://hire.withgoogle.com/public/jobs/leandatainc/view/P_AAAAAACAAA8JDAY20BToZW?trackingTag=github\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1p6IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c89abebda4bba27b4440a6af54d3a8aedaa89f05/yJafvA6W.png"},{"id":"3230ac37-443e-4968-86d6-10b4e4b9eb21","type":"Full Time","url":"https://jobs.github.com/positions/3230ac37-443e-4968-86d6-10b4e4b9eb21","created_at":"Fri Sep 20 13:18:52 UTC 2019","company":"Issuu.com","company_url":"http://Issuu.com","location":"Palo Alto","title":"Integration Engineer","description":"\u003cp\u003eAt Issuu, we empower content creators through cutting edge tools, technology and services. We exist to help creators of longform, highly visual content build audiences and businesses. We're looking for a Fullstack Developer to join our ride as Integration Engineer.\u003c/p\u003e\n\u003cp\u003eWe are the right company for you, if you\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewant to work on a product that matters to a lot of people\u003c/li\u003e\n\u003cli\u003eWe receive hundreds of visits per second - and host over 50M+ publications,\u003c/li\u003e\n\u003cli\u003econsider yourself one of the best at what you do and you're looking for equally talented colleagues,\u003c/li\u003e\n\u003cli\u003eare self-driven and would never just want to take the next ticket,\u003c/li\u003e\n\u003cli\u003eare curious and never stopped learning and exploring new languages, technologies and solutions,\u003c/li\u003e\n\u003cli\u003eseek a culture where all voices matter when it comes to shaping the future of the product,\u003c/li\u003e\n\u003cli\u003ewant to work with colleagues who have ‘here to help’ attitude, and absolutely want to help you succeed.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe believe you can help us succeed by being responsible for\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003esupporting outbound marketing activities as required such as: active blogging, conference presentation, technical-paper development, and article placement,\u003c/li\u003e\n\u003cli\u003esupporting the PM in making sure the product demo is updated and running,\u003c/li\u003e\n\u003cli\u003ecreating and documenting product demonstration setups,\ndelivering demonstrations to partners and customers and at conferences,\u003c/li\u003e\n\u003cli\u003ework with the PM in presenting concepts, prototypes, wireframes, demos and the technical processes to internal and external audiences,\u003c/li\u003e\n\u003cli\u003eprototyping integrations with third party platforms, products, APIs,\u003c/li\u003e\n\u003cli\u003esupporting Product Development with insights gained from interactions with partners and customers,\ndeveloping technical documents, training guides, and presentations for internal and external use.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for someone who has\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea Bachelor’s degree in CS or equivalent,\u003c/li\u003e\n\u003cli\u003eexperience presenting at conferences, meetups, and pitch meetings,\u003c/li\u003e\n\u003cli\u003ean ability to self-direct and solve problems with minimal input,\u003c/li\u003e\n\u003cli\u003eexperience with Functional Programming (E.g. OCaml, Erlang),\u003c/li\u003e\n\u003cli\u003ehas worked on 2+ large scale commercial projects taken from inception to production,\u003c/li\u003e\n\u003cli\u003eexperience with dynamically typed systems (e.g. Python, Javascript, Erlang),\u003c/li\u003e\n\u003cli\u003eexperience with C/C++ or other low-level languages with manual memory management,\u003c/li\u003e\n\u003cli\u003eexperience with scalable microservice architecture,\u003c/li\u003e\n\u003cli\u003ethe ability to work on any system, from code running in the browser to big data analytics dealing with - terabytes of data,\u003c/li\u003e\n\u003cli\u003estrong competence in building user interfaces,\u003c/li\u003e\n\u003cli\u003ean ability to travel domestically and abroad,\u003c/li\u003e\n\u003cli\u003eexcellent communication skills in English.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCan you say yes to most of these qualifications? If you want to join a great team and work on something that matters, it’s time to apply!\u003c/p\u003e\n\u003cp\u003eWould You Like to Join?\nThis is the perfect opportunity to join a multinational company and being able to leave your mark on processes and procedures that impacts everyone at Issuu. You will get the opportunity to travel to our CPH office as part of your onboarding and hereafter as agreed upon in your team.\u003c/p\u003e\n\u003cp\u003eIn our Palo Alto office, you’ll find members from all parts of Issuu, including Product, Design, Customer Success, Data Analytics, Marketing, BD and Management. We are conveniently close to the Palo Alto Caltrain Station and provide delicious catered lunches, regular outings, healthy drinks and snacks, and a friendly, creative, welcoming atmosphere in a cool office set-up. As if that wasn’t enough, we offer a state of the art health benefits, amazing colleagues, and a flexible working environment.\u003c/p\u003e\n\u003cp\u003eDetails: A valid US work permit is required.\u003c/p\u003e\n\u003cp\u003eDig deeper.\nMost of our content creators are on a mission to change their world in some way. They are passionate and driven and we consider ourselves the same. Check some of them out:\u003c/p\u003e\n\u003cp\u003eThe avantgarde Italian kids fashion magazine: \u003ca href=\"https://issuu.com/kidswearmagazine\"\u003ehttps://issuu.com/kidswearmagazine\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe San Francisco Opera magazine: \u003ca href=\"https://issuu.com/sanfranciscoopera\"\u003ehttps://issuu.com/sanfranciscoopera\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Danish outdoor garage start-up magazine: \u003ca href=\"https://issuu.com/outsite.org\"\u003ehttps://issuu.com/outsite.org\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Polish/Irish photographer: \u003ca href=\"https://issuu.com/thefix-analogue-magazine\"\u003ehttps://issuu.com/thefix-analogue-magazine\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe American Meteorite Exchange Inc. Magazine: \u003ca href=\"https://issuu.com/meteorite-times\"\u003ehttps://issuu.com/meteorite-times\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe encourage everyone to apply regardless of race, religion, color, national origin, gender, sexual orientation, age, marital, veteran or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease submit your application through this link: \u003ca href=\"https://jobs.lever.co/issuu/0d2686cc-75af-4160-a89e-0044bd0ac7ea\"\u003ehttps://jobs.lever.co/issuu/0d2686cc-75af-4160-a89e-0044bd0ac7ea\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3h5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fe847ec67b3b620949c364ff898352190271d00/issuu-logo-stacked-colour.jpg"},{"id":"76fcadae-e84e-11e8-88fc-96a168773892","type":"Full Time","url":"https://jobs.github.com/positions/76fcadae-e84e-11e8-88fc-96a168773892","created_at":"Wed Nov 14 20:50:03 UTC 2018","company":"NBCUniversal","company_url":"https://www.nbcunicareers.com/","location":"Universal City, CA","title":"Media Software Engineer","description":"\u003cp\u003eResponsibilities :\u003c/p\u003e\n\u003cp\u003eCoding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.\u003c/p\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cp\u003eKnowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP \u0026amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism\u003c/p\u003e\n\u003cp\u003eDesired Characteristics\u003c/p\u003e\n\u003cp\u003eScope of activities within projects include:\nBusiness requirements, documentation \u0026amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf interested, please apply here: \u003ca href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\"\u003ehttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"9999f1f0-e448-11e8-966e-602e38acf303","type":"Full Time","url":"https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303","created_at":"Fri Nov 09 21:36:14 UTC 2018","company":"BlueVine","company_url":"http://bluevine.com","location":"Redwood City, Ca","title":"Senior Python Developer","description":"\u003cp\u003eAt BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eSenior Python Developer\u003c/strong\u003e at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build state-of-the-art web \u0026amp; mobile application using a variety of languages and tools\u003c/li\u003e\n\u003cli\u003eBuild distributed backend application in the cloud\u003c/li\u003e\n\u003cli\u003eUnderstand repeatable automated processes for building the application, test it, document it, and deploy it at scale\u003c/li\u003e\n\u003cli\u003eA desire to work as part of a growing, fast-paced, and highly-flexible team\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product designers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe able to develop a project through its entire lifecycle\u003c/li\u003e\n\u003cli\u003eHave strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines\u003c/li\u003e\n\u003cli\u003eProvide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of Python (4+ years)\u003c/li\u003e\n\u003cli\u003eKnowledge of Django (2+ years)\u003c/li\u003e\n\u003cli\u003eExperience with Celery, RESTful APIs and server-side APIs integration\u003c/li\u003e\n\u003cli\u003eKnowledge of ORM, SQL and Data Modeling\u003c/li\u003e\n\u003cli\u003eExperience with TDD and ability to write quality unit tests\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, devops and web security\u003c/li\u003e\n\u003cli\u003eKnowledge of JavaScript, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eAbility to quickly learn new technologies and adapt to a fast-paced development environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e[Senior Python Developer] (\u003ca href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e)\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"},{"id":"24c31152-e440-11e8-9240-8dede5d34cb0","type":"Full Time","url":"https://jobs.github.com/positions/24c31152-e440-11e8-9240-8dede5d34cb0","created_at":"Fri Nov 09 16:54:38 UTC 2018","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Full Stack Engineer","description":"\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarcom is Apple’s Global Marketing Communications group. We lead all of Apple’s advertising and marketing to ensure the flawless development and execution of world class communications.\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://apple.com\"\u003ehttp://apple.com\u003c/a\u003e is a critical part of Apple’s product marketing strategy and a showcase for internet standards and innovation. In the role of Full Stack Engineer, you build the development, testing and content integration pipeline for the platform. We expect you to grow developer productivity, enable continuous deployment, flawless content editing and minimize QA lifecycles.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Qualifications:\nStrong JavaScript/Node.js skills, with experience developing web applications and a real passion for learning more.\nYou have an understanding of npm, and experience with publishing modules\nExperience with web packaging tools like browserify, webpack and babel\nYou have capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine\nYou are proficient in web application security; incorporating security into the software development lifecycle\nYou're familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins\nYou have Broad UNIX knowledge and skills and are proficient working in bash\nYou have strong verbal and written interpersonal skills\nYou have experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript\nYou dream of working in a creative and dynamic environment.\u003c/p\u003e\n\u003cp\u003eDescription:\nCollaborates with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability\u003c/p\u003e\n\u003cp\u003eManages expectations and provides ongoing status updates to team members.\u003c/p\u003e\n\u003cp\u003eResponsible for critical architectural planning, approaches to content management, integration and serving applications across the development pipeline.\u003c/p\u003e\n\u003cp\u003eUses virtual machines and containerization technologies such as Docker and leads development efforts on large-scale web-based projects,\u003c/p\u003e\n\u003cp\u003eEnsures robust and lasting solutions are selected and embraced.\u003c/p\u003e\n\u003cp\u003eWorks under tight deadlines and keeps producers updated on an ongoing basis.\u003c/p\u003e\n\u003cp\u003eDevelops positive multi-functional relationships and works well with all levels of management.\u003c/p\u003e\n\u003cp\u003eProvides solutions to complex problems in a concise and articulate way.\u003c/p\u003e\n\u003cp\u003eSeen as the 'go to\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 113025781\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=e0b804211ba9acb4bb3a3848d81de03a\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2771689af44c596d7935ae1de19a193ac678333/f470d99d-33e6-44f5-ac37-d1237f0a00d1"},{"id":"fa55ec4a-dd65-11e8-867f-7944d54de916","type":"Full Time","url":"https://jobs.github.com/positions/fa55ec4a-dd65-11e8-867f-7944d54de916","created_at":"Wed Oct 31 23:38:11 UTC 2018","company":"Bio-Rad Laboratories","company_url":"http://www.bio-rad.com","location":"Pleasanton, CA","title":"Backend Web Developer (Software Developer III Non-IT)","description":"\u003cp\u003eBackend Web Developer (Software Developer III Non-IT)\nBio-Rad Laboratories\u003c/p\u003e\n\u003cp\u003eOverview\nWho We Are and What We Do\u003c/p\u003e\n\u003cp\u003eBio-Rad is an established Fortune 1000 biotech company that creates products that help people live longer, healthier lives. Bio-Rad’s Digital Biology Group (DBG) in Pleasanton makes products (including data products) that are helping to eradicate cancer (among other things). We’ve worked hard at building a great culture here at the DBG that cultivates collaboration and innovation, and people are honestly really passionate about what they do here. Check Us Out\u003c/p\u003e\n\u003cp\u003eWhat We Are Looking For\u003c/p\u003e\n\u003cp\u003eA solid backend developer who will develop and own our cloud-based applications and platform for all our data products at the DBG. Are you passionate about delivering highly scalable and reusable code? Does driving and influencing cloud strategy at a Fortune 1000 company excite you?\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe one of the founding members of our new cloud data platform.\u003c/li\u003e\n\u003cli\u003eWork in a collaborative environment to apply well architected solutions within this space.\u003c/li\u003e\n\u003cli\u003eArchitect complex business logic and features to add to our web based applications from concept to implementation.\u003c/li\u003e\n\u003cli\u003eWork alongside Scientists, Marketing, and R\u0026amp;D Engineers through the Product Development life cycle and beyond.\u003c/li\u003e\n\u003cli\u003eDevelop / Improve the core infrastructure for high scalability.\u003c/li\u003e\n\u003cli\u003eWorking with an awesome group of humble, (super smart), hardworking team players that own their technical debt and slay it.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years’ experience as a Software Developer.\u003c/li\u003e\n\u003cli\u003eHands-on development experience with Python, Flask and Java in Linux environments.\u003c/li\u003e\n\u003cli\u003eHave successfully built scalable APIs according to best practices.\u003c/li\u003e\n\u003cli\u003eExperience with MySql, NoSQL databases, familiarity with Spark or Redshift Data warehousing.\u003c/li\u003e\n\u003cli\u003eExperience with Cloud Hosting (AWS preferred).\u003c/li\u003e\n\u003cli\u003eQuick learner with the ability to understand complex workflows and develop and validate innovative solutions to solve difficult problems.\u003c/li\u003e\n\u003cli\u003eExperienced with test automation: TDD, unit/integration/functional testing.\u003c/li\u003e\n\u003cli\u003eExperienced implementation efforts following an Agile software development lifecycle approach.\u003c/li\u003e\n\u003cli\u003eExcellent communication skills, both written and verbal.\u003c/li\u003e\n\u003cli\u003eA team-oriented contributor that aims to enhance the effectiveness of their colleagues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Bio-Rad:\u003c/p\u003e\n\u003cp\u003eBio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.\u003c/p\u003e\n\u003cp\u003eBio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.\u003c/p\u003e\n\u003cp\u003eEEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age\u003c/p\u003e\n\u003cp\u003eAgency Non-Solicitation:\u003c/p\u003e\n\u003cp\u003eBio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor full application instructions and position description, visit \u003ca href=\"http://apptrkr.com/1325674\"\u003ehttp://apptrkr.com/1325674\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405fc0cd9aa563ecebeb8a7c041756da5d943aa1/9cdade0a-86e8-468a-855c-c5e820ec6520"},{"id":"48d5274e-dd45-11e8-8130-eacb3354d656","type":"Full Time","url":"https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656","created_at":"Wed Oct 31 19:45:06 UTC 2018","company":"Traction","company_url":"https://www.tractionco.com/","location":"Sunnyvale, CA ","title":"Lead Full Stack Developer","description":"\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"f3e305e6-dc66-11e8-8ec9-7dcb52a38c24","type":"Full Time","url":"https://jobs.github.com/positions/f3e305e6-dc66-11e8-8ec9-7dcb52a38c24","created_at":"Tue Oct 30 17:13:04 UTC 2018","company":"CommunityVenturePartners","company_url":"https://marinpost.org","location":"Mill Valley","title":"seeking webmaster assistance with frontend and backend.","description":"\u003cp\u003eThe Marin Post (\u003ca href=\"https://marinpost.org\"\u003ehttps://marinpost.org\u003c/a\u003e) seeking webmaster assistance, full-stack coder for frontend and backend coding.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork part time with flexible hours.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork remotely but MUST live in San Francisco Bay Area and be available for occasional face to face meetings in Southern Marin or North San Francisco (Please DO NOT APPLY if you do not live in SF Bay Area).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePay per experience level. Please provide an accurate resume of experience. Your prior employment will be verified.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eApplicant requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003ePHP, Javascript, HTML, CSS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with Craft CMS and Twig or similar Content Management Systems but helpful to have experience with Craft CMS API (plugin) programming (\u003ca href=\"https://craftcms.com/\"\u003ehttps://craftcms.com/\u003c/a\u003e)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eVersed in Git / Github, able to create a pull request.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eemail resume to: \u003ca href=\"mailto:communityventurepartners@comcast.net\"\u003ecommunityventurepartners@comcast.net\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"ac69c278-d70b-11e8-8d68-56afb6a47cd3","type":"Full Time","url":"https://jobs.github.com/positions/ac69c278-d70b-11e8-8d68-56afb6a47cd3","created_at":"Tue Oct 23 21:37:34 UTC 2018","company":"Yardi Systems","company_url":null,"location":"Santa Barbara, CA","title":"Web Developer","description":"\u003cp\u003eYardi Systems, the leader in asset and property management software, is currently seeking a Web Developer to join their growing office in Santa Barbara, CA!\u003c/p\u003e\n\u003cp\u003eThe full stack developer must be able to define project specifications, collaborate with stake holders, code complex business logic, implement intuitive user interfaces and otherwise support the corporate marketing websites.\u003c/p\u003e\n\u003cp\u003eResponsibilities\n· Create and maintain WordPress plugins and themes\n· Develop appropriate code structures to solve specific tasks\n· Coordinate/collaborate with staff and teams to develop and deploy projects\n· Assist and support in the upkeep and maintenance of websites\n· Troubleshoot and resolve technical problems\u003c/p\u003e\n\u003cp\u003eRequirements\n· Associate degree, certification or commensurate experience\n· 2+ years of full stack development experience\n· Proficiency with PHP, HTML, CSS, JavaScript/JQuery\n· Experience creating and using APIs and web services (REST/SOAP)\n· An assertive, engaging personality with a history of generating results\n· Goal oriented and able to self-direct\n· Team player who can motivate and encourage the best from others\u003c/p\u003e\n\u003cp\u003ePLEASE APPLY TO: \u003ca href=\"http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\"\u003ehttp://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eYardi Systems is a successful independent software company with a proven history of growth and market leadership in the multi-billion dollar global commercial real estate industry. We employ talented, motivated and innovative people that are focused on delivering superior solutions to our clients and are passionate about working with other highly skilled professionals in team environments.\u003c/p\u003e\n\u003cp\u003eIf you are seeking an opportunity to join a winning team, work with the latest Microsoft technologies and develop your career, then Yardi Systems is the place for you. We have a pleasant and casual work environment, competitive salaries, and a comprehensive benefits package. Our corporate culture stresses integrity, respect, trust, responsibility, and fun.\u003c/p\u003e\n\u003cp\u003eEOE Race/Gender/Disability/Vets\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\"\u003ehttp://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGxYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9fa7253823c51144912b764364fd29d454040a8b/9fac2ffb-e092-4661-8711-4fa829b30ac9"}]